Repository: villageboy09/cs
Catalog: lib/l10n/app_*.arb
Languages: hi, te

# chilli_disease_and_pest_management_key
source: Diseases and Control for Chilli Plants: Damping Off Symptoms: Rotting of base in nursery plants, patchy plant death. Control: Avoid high seed density, treat seeds with Mancozeb, apply Metalaxyl + Mancozeb or Copper Oxychloride sprays. Cercospora Leaf Spot Symptoms: White spots with brown margins on leaves, yellowing under shade. Control: Spray Azoxystrobin, Mancozeb + Carbendazim, or Mancozeb (Dithane M-45). Bacterial Leaf Spot Symptoms: Small brown spots with pale yellow rings on leaves. Control: Spray Streptocycline + Copper Oxychloride mix. Die Back and Fruit Rot Symptoms: Brown spots on fruit, overall plant and fruit dryness. Control: Treat seeds with Mancozeb or Carbendazim, spray Tebuconazole, Pyraclostrobin + Metiram, Difenoconazole, Copper Hydroxide, Propiconazole, or Azoxystrobin. Choanephora Blight Symptoms: Stem lesions leading to stem rot. Control: Spray Pyraclostrobin + Metiram or Streptocycline + Copper Oxychloride mix. WILT Symptoms: Sudden wilting, white mycelial growth on stem base. Control: Rotate crops, drench with Bordeaux mixture or Copper Oxychloride, apply Trichoderma with manure. Powdery Mildew Symptoms: White ash spots on leaf undersides, spreading to leaf tops. Control: Spray wettable sulphur, Karathane, Myclobutanil, Hexaconazole. Leaf Curl Virus Symptoms: Wrinkled yellow leaves, curled leaf edges. Control: Rotate crops, seed treatment with Imidacloprid, set up yellow sticky traps, spray Acetamiprid, Spiromesifen, Thiomethoxam, or Diafenthiuron. Cucumber Mosaic Virus Symptoms: Thinning pale leaves, black spots on fruits. Control: Spray Imidacloprid or Acetamiprid. Peanut Bud Necrosis Symptoms: Black spots, yellow leaf spots, stunted growth. Control: Treat seeds with Imidacloprid, use Neem seed infusion, spray Acetamiprid, Spinosad, Diafenthiuron, or Fipronil. Integrated Management of Virus Diseases Use Neem cake, Azadirachtin, and practice Integrated Nutrient Management. Spray Neem seed kernel extract or neem leaf extract. Use Chilli Garlic Paste or Fermented Buttermilk. Follow safety precautions while spraying pesticides. Insect Pest Control: Thrips: Seed treatment with Imidacloprid, spray Acetamiprid or Spinosad. Mites: Spray wettable sulphur, Propargite, Fenpyroximate, or Spiromesifen. Whitefly: Spray Imidachloprid, Acetamiprid, Spiromesifen, Diafenthiuron, or Thiamethoxam. Aphids: Spray Imidacloprid or Acetamiprid. Integrated Pest Management (POD Borers) Deep summer ploughing, sow maize or jowar around the field, use pheromone traps, apply NPV larval equivalents, establish bird perches, and destroy egg masses. Chilli Midge Mix Neem oil or spray Chlorantraniliprole. Safety Measures: Read pesticide labels, check sprayers, wear protective gear, and store pesticides safely. Dispose of empty pesticide bottles properly. Follow indigenous pest management methods like Neem seed kernel or leaf extract, Chilli Garlic Paste, or Fermented Buttermilk.
hi: बाजरे के पौधों के लिए बीमारियाँ और नियंत्रण: डैम्पिंग ऑफ लक्षण: नर्सरी के पौधों में बेस का गलना, पैची पौधे की मौत। नियंत्रण: उच्च बीज घनत्व से बचें, बीजों को Mancozeb के साथ उपचार करें, Metalaxyl + Mancozeb या कॉपर ऑक्सीक्लोराइड स्प्रे लगाएं। सर्कोस्पोरा पत्ती स्पॉट लक्षण: पत्तियों पर सफेद धब्बे जिसमें भूरे किनारे होते हैं, छाया के नीचे पीलापन। नियंत्रण: छिड़काव Azoxystrobin, Mancozeb + Carbendazim, या Mancozeb (डिथान M-45)। बैक्टीरियल पत्ती स्पॉट लक्षण: पत्तियों पर छोटे भूरे धब्बे जिन पर हलके पीले ढाल होती है। नियंत्रण: स्प्रे स्ट्रेपटोसाइक्लिन + कॉपर ऑक्सीक्लोराइड मिश्रण। डाइबैक और फल रोट लक्षण: फल पर भूरे धब्बे, कुल मिट्टी और फल की सूखापन। नियंत्रण: बीजों को Mancozeb या Carbendazim के साथ उपचार करें, स्प्रे Tebuconazole, Pyraclostrobin + Metiram, Difenoconazole, कॉपर हाइड्रॉक्साइड, प्रोपिकोनाजोल, या Azoxystrobin। कोयनेफोरा ब्लाइट लक्षण: डंठलों में छेदन जो डंठलों के स्थान का गलना करते हैं। नियंत्रण: स्प्रे Pyraclostrobin + Metiram या स्प्रेटोसाइक्लिन + कॉपर ऑक्सीक्लोराइड मिश्रण। विल्ट लक्षण: अचानक मुरझाना, डंठल के आधार पर सफेद काईलीय वृद्धि। नियंत्रण: फसलों की रोटेशन, बोर्डो मिश्रण या कॉपर ऑक्सीक्लोराइड से ड्रेंच, खाद के साथ त्रिचोडर्मा लागू करें। पाव्डरी माइल्ड्यू लक्षण: पत्तियों के पीछे सफेद राख के धब्बे, पत्तियों के ऊपर फैलने के लिए। नियंत्रण: स्प्रे वेटेबल सल्फर, कैराथेन, माईक्लोब्यूटनिल, हेक्साकोनाजोल। पत्ती कर्ल वायरस लक्षण: मुरझाई हुई पीली पत्तियाँ, कर्ल पत्तों पर कुण्डलित किनारे। नियंत्रण: फसलों का पैलाव, इमिडाक्लोप्रिड के साथ बीजों का इलाज, पीला चिपचिपा जाल स्थापित करें, स्प्रे Acetamiprid, Spiromesifen, Thiomethoxam, या Diafenthiuron। ककड़ी मोजेक वायरस लक्षण: पतले पीले पत्तियाँ, फलों पर काले धब्बे। नियंत्रण: स्प्रे इमिडाक्लोप्रिड या एसीटामिप्रिड। मूंगफली बड़ नेक्रोसिस लक्षण: काले धब्बे, पीली पत्तियों पर धब्बे, विकृति की वृद्धि। नियंत्रण: बीजों को इमिडाक्लोप्रिड के साथ उपचार करें, नीम के बीज की इंफ्यूजन का उपयोग करें, स्प्रे Acetamiprid, Spinosad, Diafenthiuron, या Fipronil। वायरस बीमारियों का एकीकृत प्रबंधन नीम केक, आजादिराख्तिन, और एकीकृत पोषण प्रबंधन का अभ्यास करें। स्प्रे नीम बीज कर्नल अरक्षण या नीम पत्ती का अरक्षण करें। चिल्ली लहसुन पेस्ट या फरमेंटेड बटरमिल्क का उपयोग करें। सिर्फाइड की सलाह का पालन करें जब आपके पेस्टिसाइड का छिड़काव कर रहे हों। कीट प्रबंधन: थ्रिप्स: बीजों का उपचार इमिडाक्लोप्रिड के साथ करें, स्प्रे Acetamiprid या Spinosad। दानेदार: स्प्रे वेटेबल सल्फर, प्रोपार्गाइट, फेनपायरॉक्सिमेट, या स्पिरोमेसिफेन। सफेद मक्खी: स्प्रे इमिडाक्लोप्रिड, Acetamiprid, Spiromesifen, Diafenthiuron, या थियामेथॉक्साम। एफिड्स: स्प्रे इमिडाक्लोप्रिड या Acetamiprid। कीट प्रबंधन (पीओडी बोरर्स) गहरे गर्मियों में हल्के, चारे के आसपास मक्का या ज्वार को बोने, फेरोमोन फंदे का उपयोग करें, एनपीवी लार्वल समकक्ष लागू करें, पक्षियों की डाली बनाएं, और अंडे की मासों को नष्ट करें। चिल्ली मिड्ज नीम तेल या स्प्रे क्लोरान्ट्रानिलिप्रोल मिलाएं। सुरक्षा उपाय: कीटनाशक लेबल पढ़ें, स्प्रेयर की जाँच करें, सुरक्षा सामग्री पहनें, और कीटनाशक को सुरक्षित रखें। खाली कीटनाशक बोतलों को सही ढंग से निपटाएं। नीम के बीज कर्नल या पत्ती का निकाल, चिल्ली लहसुन पेस्ट, या फरमेंटेड बटरमिल्क जैसे स्थानीय कीट प्रबंधन उपायों का पालन करें।
te: బజ్రా మొక్కలకు వ్యాధులు మరియు నియంత్రణ: డంపింగ్ ఆఫ్ లక్షణాలు: ఆధార తెగులు, నర్సరీ మొక్కలలో పాచి మొక్కల మరణం. నియంత్రణ: అధిక విత్తన సాంద్రతను నివారించండి, మాంకోజెబ్‌తో విత్తనాలను శుద్ధి చేయండి, మెటాలాక్సైల్ + మెటాలాక్సైల్ + స్ప్లోర్ ఓపెర్‌సైబ్‌ను వర్తించండి. సెర్కోస్పోరా లీఫ్ స్పాట్ లక్షణాలు: గోధుమ రంగు అంచులతో ఆకులపై తెల్లటి మచ్చలు, నీడలో పసుపు రంగులోకి మారడం. నియంత్రణ: అజోక్సిస్ట్రోబిన్, మాంకోజెబ్ + కార్బెండజిమ్, లేదా మాంకోజెబ్ (డితాన్ ఎమ్-45) బాక్టీరియల్ లీఫ్ స్పాట్ లక్షణాలు: ఆకులపై చిన్న గోధుమ రంగు మచ్చలు ఫ్లాకీ పసుపు పొలుసులతో. నియంత్రణ: స్ట్రెప్టోసైక్లిన్ + కాపర్ ఆక్సిక్లోరైడ్ మిశ్రమాన్ని స్ప్రే చేయండి. డైబ్యాక్ మరియు ఫ్రూట్ రాట్ లక్షణాలు: పండ్లపై గోధుమ రంగు మచ్చలు, పండ్లపై పూర్తిగా కలుషితం మరియు పొడి మెటిరామ్, డైఫెనోకోనజోల్, కాపర్ హైడ్రాక్సైడ్, ప్రొపికోనజోల్ లేదా అజోక్సీస్ట్రోబిన్. కూనెఫోరా ముడతలు లక్షణాలు: పెటియోల్ సైట్ యొక్క కుళ్ళిపోవడానికి దారితీసే కాండాలు. నియంత్రణ : పైరాక్లోస్ట్రోబిన్ + మెటిరామ్ లేదా స్ప్రేటోక్సైక్లోమ్డ్ మిశ్రమం టింగ్ , కొమ్మ అడుగుభాగంలో తెల్లటి హైలిన్ పెరుగుదల. నియంత్రణ: పంటల భ్రమణం, బోర్డియక్స్ మిశ్రమం లేదా కాపర్ ఆక్సిక్లోరైడ్‌తో ముంచి, ట్రైకోడెర్మాను పేడతో వేయండి బూజు తెగులు లక్షణాలు: ఆకుల వెనుక భాగంలో తెల్లటి బూడిద మచ్చలు, ఆకుల పైభాగానికి వ్యాపిస్తాయి. నియంత్రణ: వెటబుల్ సల్ఫర్, కారథేన్, మైక్లోబుటానిల్, హెక్సాకోనజోల్‌ను పిచికారీ చేయండి. లీఫ్ కర్ల్ వైరస్ లక్షణాలు: వాడిపోయిన పసుపు ఆకులు, ఆకులను కాయిల్స్‌గా మార్చండి. నియంత్రణ: మల్చ్ పంటలు, విత్తనాలను ఇమిడాక్లోప్రిడ్, స్ప్రే స్ప్రే ట్రాప్స్‌తో శుద్ధి చేయండి. స్పిరోమెసిఫెన్, థియోమెథాక్సామ్, లేదా డయాఫెంథియురాన్. దోసకాయ మొజాయిక్ వైరస్ లక్షణాలు: పలుచని పసుపు ఆకులు, పండ్లపై నల్ల మచ్చలు నియంత్రణ: విత్తనాలను ఇమిడాక్లోప్రిడ్‌తో శుద్ధి చేయండి, వేప గింజల కషాయం, ఎసిటామిప్రిడ్, స్పినోసాడ్, డయాఫెంథియురాన్ లేదా ఫిప్రోనిల్‌ను పిచికారీ చేయండి. వైరస్ వ్యాధుల సమగ్ర నిర్వహణ వేప కేక్, అజాడిరాక్టిన్ మరియు ఇంటిగ్రేటెడ్ న్యూట్రిషన్ వేప సంరక్షణ నిర్వహణ. . మిరప వెల్లుల్లి పేస్ట్ లేదా పులియబెట్టిన మజ్జిగ ఉపయోగించండి. nమీ పురుగుమందును పిచికారీ చేసేటప్పుడు సిరక్యూస్ యొక్క సలహాను అనుసరించండి. తెగుళ్ల నిర్వహణ: త్రిప్స్: విత్తనాలను ఇమిడాక్లోప్రిడ్‌తో శుద్ధి చేయండి, ఎసిటామిప్రిడ్ లేదా స్పినోసాడ్‌ను పిచికారీ చేయండి. ధాన్యాలు: స్ప్రే, ఎఫ్‌పిర్జిఫ్‌సిఫ్‌సేన్‌, స్ప్రేస్‌పిర్‌సిఫ్‌సీట్‌ . nWhiteflies: Imidacloprid, Acetamiprid, Spiromesifen, Diafentiuron, or Thiamethoxam NPV లార్వాకు సమానమైన వాటిని వర్తింపజేయండి, పక్షి కాస్ట్‌లను తయారు చేయండి మరియు గుడ్ల ద్రవ్యరాశిని నాశనం చేయండి. మిరపకాయలు వేప నూనెను జోడించండి లేదా క్లోరాంట్రానిలిప్రోల్‌ను పిచికారీ చేయండి. భద్రతా చర్యలు: పురుగుమందుల లేబుల్‌లను చదవండి, స్ప్రేయర్‌లను తనిఖీ చేయండి, రక్షణ గేర్‌లను ధరించండి మరియు ఖాళీ పురుగుమందులను భద్రంగా ఉంచండి. పురుగుమందుల సీసాలు సరిగ్గా. వేప గింజలు లేదా ఆకు సారం, మిరప వెల్లుల్లి పేస్ట్ లేదా పులియబెట్టిన మజ్జిగ వంటి స్థానిక తెగులు నిర్వహణ చర్యలను అనుసరించండి.

# chilli_inter_cultivation_key
source: Inter-cultivation with gorru and guntaka 15 days after transplanting, repeated every 15-20 days. Maintain weed-free crop up to 60 days after transplanting and 90 days after direct seeding. Chemical weed control options available. Pre-emergence application: Pendimethalin 38.7%SC (750ml/acre). Post-emergence application for heavy weed infestation: Quizalofop-p-ethyl (Targasuper) 400 ml/acre.
hi: प्रतिस्थापन के 15 दिन बाद गोरु और गुंटका के साथ अंतर-कृषि, हर 15-20 दिन बाद दोहराया गया। 60 दिनों के बाद नर्सरी के लागू होने और सीधे बोने के 90 दिनों के बाद विघटन। रसायनिक खरपतवार नियंत्रण विकल्प उपलब्ध हैं। पूर्व-उत्पन्न आवेदन: पेंडिमेथालिन 38.7% एससी (750 मिलीलीटर/एकड़)। भारी खरपतवार के लिए पोस्ट-उत्पन्न आवेदन: क्विजलोफोप-पी-एथिल (तार्गासुपर) 400 मिलीलीटर/एकड़।
te: మార్పిడి తర్వాత 15 రోజుల తర్వాత గోరు మరియు గుంటకతో అంతర-సాగు, ప్రతి 15-20 రోజులకు పునరావృతమవుతుంది. 60 రోజుల తర్వాత నర్సరీ అమలు మరియు నేరుగా విత్తిన 90 రోజుల తర్వాత క్రిమిసంహారక. రసాయన కలుపు తీయుట నియంత్రణ ఎంపికలు అందుబాటులో ఉన్నాయి. ఎమర్జెంట్ అప్లికేషన్: పెండిమెథాలిన్ 38.7% SC (750 ml/ఎకరం). భారీ కలుపు మొక్కల కోసం పోస్ట్-ఎమర్జెంట్ అప్లికేషన్: Quizlofop-p-ethyl (Targasuper) 400 ml/ac.

# chilli_post_harvesting_key
source: Follow necessary measures
hi: आवश्यक उपायों का पालन करें
te: అవసరమైన చర్యలను అనుసరించండి

# chilli_harvesting_key
source: Avoid pesticide application within 20 days of harvesting. Harvest fully ripened pods, avoiding cloudy weather. Use clean bags for harvesting and avoid using fertilizer bags. Harvest chilli 3-4 times. Dry harvested fruit by spreading on tarpaulin, turning frequently. Drying takes 2-3 weeks in open areas, preferably on elevated places. Faster drying on tarpaulin or sand yard, or in a poly house for higher quality. Cover dried chilli with tarpaulin or palm leaves. Avoid water application during packing. Separate mould-infested or light-colored pods from good chilli. Store filled bags on elevated surfaces. Dry chilli to 11% moisture content.
hi: फसलीय अनुप्रयोग को 20 दिनों के भीतर खारिज करें। पूरी रिपेन्ड पॉड को खारिज करें, बादली हवा से बचें। खारिज के लिए साफ थैले का उपयोग करें और खाद्य तत्व के बैग का उपयोग न करें। चिल्ली को 3-4 बार काटें। तड़पालिन पर खारिज फल को फैलाकर सुखा लें, बार-बार मोड़ते रहें। खारिज फलों को खुले स्थानों में 2-3 सप्ताह में सुखाने की आवश्यकता है, प्राथमिकता से ऊंचे स्थानों पर। अधिक गुणवत्ता के लिए तरपालिन या रेतीली यार्ड पर तेज़ सुखाना, या पॉली हाउस में तेज़ सुखाना। सुखा चिल्ली को तरपालिन पर पैक करें, बदलती जलवायु के तहत आवश्यकता अनुसार धूप लें।
te: 20 రోజులలోపు పంటకోత దరఖాస్తును విస్మరించండి. పండిన పాడ్ మొత్తాన్ని విస్మరించండి, మేఘావృతమైన గాలిని నివారించండి. విస్మరించడానికి శుభ్రమైన బ్యాగ్‌ని ఉపయోగించండి మరియు ఫుడ్ ఎలిమెంట్ బ్యాగ్‌ని ఉపయోగించవద్దు. మిరపకాయను విస్మరించండి. 3-4 సార్లు కత్తిరించండి. తిరస్కరించబడిన వాటిని ఆరబెట్టండి. పండ్లను టార్పాలిన్‌లపై విస్తరించి, తరచుగా తిప్పండి. తిరస్కరించబడిన పండ్లను 2-3 వారాల పాటు బహిరంగ ప్రదేశాల్లో ఎండబెట్టాలి, ప్రాధాన్యంగా ఎత్తైన ప్రదేశాలలో. తర్పాలిన్ లేదా ఇసుక యార్డ్‌లో త్వరగా ఎండబెట్టడం లేదా పాలీలో త్వరగా ఆరబెట్టడం ఇల్లు. ఎండు మిరపకాయలను టార్పాలిన్‌పై ప్యాక్ చేయండి, మారుతున్న వాతావరణంలో అవసరమైన విధంగా సూర్యరశ్మికి బహిర్గతం చేయండి.

# grams_soil_type_key
source: Loamy soil
hi: लोमी मिट्टी
te: లోమి మణ్ణు

# grams_seed_rate_key
source: 6 to 8 kilograms per acre
hi: 6 से 8 किलोग्राम / एकड़
te: అకరాకాలం కిలోలిటరులు ప్రతి ఎకరాకు 6 నుండి 8 కిలోలిటర్లు

# grams_seed_treatment_key
source: Insecticides: Control insect pests and diseases in seeds. Examples: Metalaxyl, Carbendazim. - Insecticides: Protect seeds from insect pests. Examples: Imidacloprid, Thiamethoxam. - Propagator: Include beneficial microorganisms for soil health. Example: Rhizobacteria. - Biostimulants: Promote seed germination and plant growth. Contains plant hormones and nutrients. - Coating: Improve seed handling and emergence. Contains polymers and nutrients.
hi: - कीटनाशक: बीजों में कीटाणुओं की बीमारियों को नियंत्रित करें। उदाहरण: मेटालैक्सिल, कार्बेंडाजिम। - कीटनाशक: बीजों को कीट जीवों से सुरक्षित रखें। उदाहरण: इमिडाक्लोप्रिड, थायमेथोक्साम। - प्रोपागेटर: भूमि स्वास्थ्य के लिए उपयोगी माइक्रोआर्गनिज्मों को शामिल करें। उदाहरण: फूलझी बैक्टीरिया बैक्टीरिया। - बायोस्टिमुलेंट्स: बीज के अंकुरण और पौधों की वृद्धि को बढ़ावा देना। पौधों और पोषक तत्व शामिल हैं। - कोटिंग: बीज की वाहनी और उद्भवन में सुधार करें। बहुलक्तिक और पोषक तत्व शामिल हैं।
te: కీటనాశకాలు: విత్తనాల్లో కీటనాళాలను నియంత్రించడానికి మరియు రోగాలను నివారించడానికి. ఉదాహరణలు: మెటాలాక్సెల్, కార్బెండజిమ్. - కీటనాశకాలు: కీటనాళాలను నివారించడానికి విత్తనాల్లో రక్షణ. ఉదాహరణలు: ఇమిడాక్లోప్రిడ్, థియామెతోక్సామ్. - ప్రొపగేటర్: భూ ఆరోగ్యానికి ఉపయోగపడే మైక్రోబైయోలాజెన్స్ సమావిష్టము. ఉదాహరణ: రైజోబ్యాక్టీరియా. - బైయోస్టిమ్యులెంట్స్: విత్తన స్వీకారం మరియు వాటి వృద్ధికి ప్రోత్సాహించడం. విటమిన్ కంటెంట్ను కలిగి ఉండినవి. కోటింగ్: విత్తనాల హాండ్లింగ్ మరియు అవగాహన పెంపకాను మెరుగుపరచడానికి అవగాహన పెంపకాను మార్గనివేషణ. - నెలపాలకు: నెలపాలకు: అక్టోబర్ - నవంబర్

# grams_growing_season_key
source: October - November
hi: अक्टूबर - नवंबर
te: ఒక్టోబర్ - నవంబర్

# grams_crop_duration_key
source: 100-120 days
hi: 100-120 दिन
te: 100-120 రోజులు

# grams_irrigation_schedule_key
source: Pre-sowing: Ensure sufficient soil moisture for germination. Pre-sowing irrigation may be necessary if soil moisture is low. - Seedling establishment (1-3 weeks): Irrigate every 7-10 days to establish seedlings. Provide moderate irrigation to maintain soil moisture. - Plant growth (4-8 weeks): Irrigation will be needed every 10-12 days based on soil moisture and rainfall. Provide adequate water to support root growth. - Critical growth stages (plant growth, flowering): Maintain sensitive soil moisture during these stages. Irrigate every 10-15 days or as needed. - Late growth stages (from pod development to maturity): Gradually reduce irrigation as the crop matures. Avoid excessive watering during pod development to prevent fungal diseases.
hi: पूर्व-बोना: अंकुरण के लिए मिट्टी की नमी पर्याप्त हो। यदि मिट्टी की नमी कम है, तो पूर्व-सिंचाई आवश्यक हो सकती है। - अंकुरण से पौधा स्थापना (1-3 सप्ताह): प्रत्येक 7-10 दिनों में सिंचाई करें ताकि पौधे स्थापित हो सकें। मिट्टी की नमी बनाए रखने के लिए माध्यमिक सिंचाई दें। - पौधों की वृद्धि (4-8 सप्ताह): मिट्टी की नमी और वर्षा के आधार पर हर 10-12 दिनों में सिंचाई की आवश्यकता होगी। पर्याप्त पानी प्रदान करें ताकि पौधों की जड़ीबूटी वृद्धि हो सके। - महत्वपूर्ण वृद्धि चरण (पौधों की वृद्धि, फूलन): इन चरणों के दौरान संवेदनशील मिट्टी की नमी बनाए रखें। प्रत्येक 10-15 दिनों में या आवश्यकतानुसार सिंचाई करें। - देरी वृद्धि चरण (पोड विकास से परिपूर्णता तक): फसल पकने के समय सिंचाई की आवश्यकता को धीरे-धीरे कम करें। पोड विकास के दौरान अधिक सिंचाई से फंगल बीमारियों को रोकने के लिए बचें।
te: ప్రీ-సోయింగ్: మొక్క మొగ్గలు అభ్యాసానికి సాధారణ మణ్ణు కొనుగోలు కావాలనిపిస్తుంది. మొక్క మొగ్గలను నియంత్రించడానికి మొక్క నీటి చిన్న బారింగ్ సాధారణం అవసరం. - సీడ్లింగ్ స్థాపన (1-3 వారాలు): సీడ్లింగ్‌లను స్థాపించడానికి ప్రతి 7-10 రోజులు నీటిని ఇవ్వడానికి అవసరమవుతుంది. మణ్ణు నీరు నిలబడుతుంటే మధ్యస్థ నీటిని అందించడానికి మిదటి నీటి ఆరోగ్యాన్ని అందించాలి. - మొక్క వికాసం (4-8 వారాలు): మొక్క వికాసంలో భూ నీరు మరియు వర్షంలో నీరు ఆధారంగా ప్రతి 10-12 రోజులు అవసరం. రూట్ వికాసానికి సాక్ష్యంగా నిత్యంతా వాటర్‌ను అందించాలి. - క్రిటికల్ వికాస దశలు (మొక్క వికాసం, పుష్పం): ఈ దశలు ముగిసిన సమయంలో స్థితికి అనుగుణంగా భూ నీరు ఆధారంగా ఉండాలి. ప్రతి 10-15 రోజులకు లేదా అవసరం అయితే ఆధారంగా నీరు అందించాలి. - దిగువ వికాస దశలు (పోడ్ అభివృద్ధి నుండి పారిపోతుండి): మొక్క వికసనం పూర్తి కాలంలో నీరు నిలబడుతుంటే నీరు సర్వనాశం చేయాలి. ఫంగల్ రోగాలను తట్టుకుని ఉండకుండా పాడు అభివృద్ధి సమయంలో మరియు పొడ్ అభివృద్ధి వ్యవధిలో అతి విలక్షణమైన నీరు నీరుతో కాలంలో నీరు అందించాలి.

# grams_nutrient_requirement_key
source: Nitrogen (N): 40-60 kilograms - Phosphorus (P): 20-30 kilograms - Potassium (K): 20-30 kilograms
hi: नाइट्रोजन (एन): 40-60 किलोग्राम - फास्फोरस (पी): 20-30 किलोग्राम - पोटैशियम (के): 20-30 किलोग्राम
te: పదిహానికలు (ఎన్): 40-60 కిలోలిటర్లు - ఫాస్ఫోరస్ (పి): 20-30 కిలోలిటర్లు - పొటాషియం (కే): 20-30 కిలోలిటర్లు

# grams_weed_management_key
source: Cultural practices: Crop rotation, proper bed preparation, and appropriate planting density help suppress weeds in maize fields. - Mechanical control: Hand weeding, inter-row cultivation, and shallow tillage can be effective in managing weeds. - Chemical control: - Pre-emergence herbicides: Pendimethalin, Metribuzin, and Trifluralin are commonly used to control weeds in maize fields. - Post-emergence herbicides: Imazethapyr, Bentazon, and Metsulfuron-methyl are used to control emerged weeds in maize fields.
hi: सांस्कृतिक प्रथाएँ: फसल चक्र, उचित बिस्तर तैयारी, और उचित रोपण घनत्व चने के खेतों में खरपतवारों को दबाने में मदद करती हैं। - यांत्रिक नियंत्रण: हाथ से खरपतवार निकालना, अंतर-पंक्ति कृषि, और हल्की खेती खरपतवारों को प्रबंधित करने में प्रभावी हो सकती है। - रासायनिक नियंत्रण: - पूर्व-उद्गम हर्बाइड: पेंडिमेथालिन, मेट्रिबुजिन, और ट्रिफ्लुरालिन खरपतवारों को नियंत्रित करने के लिए सामान्यत: प्रयोग किए जाते हैं। - पोस्ट-उद्गम हर्बाइड: इमाजेथापायर, बेंटाज़ॉन, और मेटसल्फुरॉन-मिथाइल उद्गम हर्बाइड्स चने के खेतों में उभरे हुए खरपतवारों को नियंत्रित करने के लिए प्रयोग किए जाते हैं।
te: కుంచి మరియు వీటి నివారణ: విత్తనానికి సరైన నిర్వహణ విధానాలను ఉపయోగించి కుంచి మరియు వీటి నిర్వాహణను సరిపడా నిర్వహించాలి. విత్తనానికి అనుకూలమైన విత్తనాల్లో అప్పటి తోటలు ప్రవృత్తి కలిగి ఉండకుండా విత్తనానికి ముఖ్యమైన తోటలను పరీక్షించడానికి సమయంలో విత్తన నిర్వహణ విధానాలను అనుమతించాలి. - విత్తన నిర్వహణ పద్ధతులు: అక్టోబర్ - నవంబర్

# grams_disease_and_pest_management_key
source: Disease and Pest Management: - Diseases: - White Rust (White Rust/Downy Mildew) - Symptoms: White pustules, swelling of stems. Treat seeds, use sprays, select healthy seeds, control weeds, and practice crop rotation. - Alternaria Leaf Spot - Symptoms: Brown spots, leaf drop. Use sprays, select healthy seeds, and practice crop rotation. - Grain Mould - Symptoms: Discolored grains, reduced yield. Avoid moisture for long periods, timely harvesting, and use fungicide sprays. - Ergot - Symptoms: Black grains, honeydew excretion. Clean seeds mechanically, use fungicide sprays (e.g., Benlate, Propiconazole), and ensure proper field sanitation. - Pests: - Aphids - Symptoms: Honeydew on leaves, yellowing, and drying. Use tolerant varieties, aphid traps, apply neem oil, and consider using dimethoate sprays. - Pod Borers - Symptoms: Larvae infested in pods, causing damage to seeds. Regularly monitor fields, handpick affected pods, and consider neem oil sprays. - Pod Sucking Bugs - Symptoms: Drying, shriveling. Early sowing, irrigation, rapid germination, and dimethoate sprays are helpful. - Wireworms - Symptoms: Round holes, drying. Dig in summers, early sowing, irrigation, and apply Karela oil sprays. - Whiteflies - Symptoms: Whiteflies feed on leaves, causing yellowing and drying. Use yellow sticky traps, neem oil sprays, and maintain good crop hygiene.
hi: रोग: - सफेद जंग (व्हाइट रस्ट / डाउनी माइल्ड्यू) - लक्षण: सफेद पुस्तुलों, तने का सूजन। संशोधित बीज और तांबे के स्प्रे का उपयोग करें। - प्रबंधन: बीज का इलाज करें, स्प्रे का प्रयोग करें, स्वस्थ बीज का चयन करें, खरपतवारों को नियंत्रित करें, और फसलों का चक्र करें। - अल्टरनेरिया पत्ती का स्पॉट - लक्षण: भूरे धब्बे, पत्तियों का पतन। स्वस्थ बीज और तांबे के स्प्रे का उपयोग करें। - प्रबंधन: स्वस्थ बीज का उपयोग करें, स्प्रे का प्रयोग करें, और फसलों का चक्र करें। - अनाज का मोल्ड - लक्षण: वर्णित अनाज, कम उत्पादन। बीमारी को कम करने के लिए लंबे समय तक नमी से बचें, समय पर कटाई करें, और फंगिसाइड स्प्रे का प्रयोग करें। - प्रबंधन: समय पर कटाई करें, फंगाइड स्प्रे का उपयोग करें (जैसे कि बेनलेट, प्रोपिकोनाज़ोल), और भंडारण के दौरान सही वेंटिलेशन सुनिश्चित करें। - एर्गोट - लक्षण: काले अनाज, मधुरे का स्राव। बीजों को मैकेनिकली साफ करें और फंगाइड स्प्रे (जैसे कि बेनलेट, प्रोपिकोनाज़ोल) का प्रयोग करने से एर्गोट को नियंत्रित किया जा सकता है। - प्रबंधन: बीजों को मैकेनिकली साफ करें, फंगाइड स्प्रे का प्रयोग करें, और फील्ड में सही स्वच्छता अनुपालन करें। - कीट: - सरसों की मक्खी - लक्षण: पत्ती की मुड़ाई, पतली वृद्धि। पीले झांजर और साबुन या नीम का तेल स्प्रे का प्रयोग करें। - प्रबंधन: सहिष्णु प्रजातियों का चयन करें, झांजर का प्रयोग करें, नीम तेल लगाएं, और डाईमेथोट स्प्रे का विचार करें। - पेंटेड बग - लक्षण: सूखना, सूखना। जल्दी बोना, सिंचाई, तेज अंकुरण, और डाईमेथोट स्प्रे सहायक होते हैं। - प्रबंधन: गहरे खेत जोतें, जल्दी बोना, सिंचाई, जल्दी अलगाव, और डाईमेथोट का प्रयोग करें। - सरसों का डंक - लक्षण: गोली होल, सूखते पत्ते। गर्मियों में खेत खोदना, जल्दी बोना, और करेले का तेल स्प्रे प्रभावी है। - प्रबंधन: गर्मियों में खोदें, जल्दी बोना, सिंचाई, शुद्धता से खेती करें, और क्विनलफोस स्प्रे का प्रयोग करें। - ग्राम पॉड बोरर - लक्षण: कीटाणुओं के पॉड में गुहरा, बीज को क्षति पहुंचाने का कारण। प्रभावित पॉडों को हाथ से चुनना और नीम का तेल लगाना मदद कर सकता है। - प्रबंधन: फील्ड को नियमित रूप से मॉनिटर करें, प्रभावित पॉडों को हाथ से चुनें, और नीम का तेल स्प्रे का प्रयोग करें। - सफेद मक्खी - लक्षण: सफेद मक्खियाँ पत्तियों पर खाती हैं, पीलापन और सूखना कारण। पीले चिपचिपे झालर और नीम का तेल स्प्रे प्रभावी प्रबंधन उपाय हैं। - प्रबंधन: पीले चिपचिपे झालर का प्रयोग करें, नीम का तेल स्प्रे करें, और अच्छी फसल की सफाई बनाए रखें।
te: సరైన ప్రతిరోధక మార్గాలు: మొక్కను రోగం నుండి పారిపోతే, విత్తన రోగాలను కట్టడానికి ఉపయోగించాలి. రోగాలను తొలగించడానికి మార్కాప్ హైడ్రోసియాన్ మరియు అన్య ప్రతిరోధక పద్ధతులను ఉపయోగించాలి. - రోగనిర్వాహణ పద్ధతులు: ప్రాధమిక నిర్వహణ పద్ధతులను అనుమతిస్తూ మంచి ప్రాధమిక నిర్వహణ విధానం అనుసరించాలి. నియంత్రణకు కొన్ని వెనుక రోగాలు ఆధారంగా నిలబడాలి. ఉదాహరణలు: నిలబడిన రోగాలు మరియు లేక కాలంలో పునరావర్తనలు అందించడానికి అధికమైన డేజ్ తో నిర్వాహించబడాలి.
