Repository: villageboy09/cs
Catalog: lib/l10n/app_*.arb
Languages: hi, te

source: Hello world
hi: नमस्ते
te: హలో ప్రపంచం

source: CropSync
hi: क्रॉपसिंक
te: పంట సింక్

source: About Us
hi: हमारे बारे में
te: మా గురించి

# aboutUsDescription
source: CropSync is an agritech startup dedicated to revolutionizing the agricultural sector. Our mission is to empower farmers with innovative solutions and data-driven insights to enhance crop productivity and improve livelihoods.
hi: क्रॉपसिंक एक एग्रीटेक स्टार्टअप है जो कृषि क्षेत्र को क्रांति लाने के लिए समर्पित है। हमारा मिशन किसानों को नवाचारी समाधानों और डेटा-संचालित अंदाजों से संवृद्धि और जीविकोपार्जन को बढ़ावा देना है।
te: క్రాప్‌సింక్ ఒక వ్యవసాయ సెక్టర్‌ను పునర్నిర్మాణ చేసే ఒక ఆగ్రిటెక్ స్టార్టప్ కాదు. మా పరిపాలన అనుభవాన్ని విస్తరించడం మరియు డేటా-నిర్ధారిత అంశాలతో పంట ఉత్పత్తిని మెరుగుపరచడం మా లక్ష్యం.

# joinUs
source: Join us on our journey towards sustainable agriculture!
hi: हमारे सतत कृषि की यात्रा में हमारे साथ जुड़ें!
te: సౌజన్యంగా వృద్ధిశీల వ్యవసాయం దారిలో మాకు చేరండి!

source: Our Services
hi: हमारी सेवाएं
te: మా సేవలు

source: Soil Testing
hi: मृदा परीक्षण
te: మణ్ణు పరీక్ష

# soilTestingDescription
source: Get detailed analysis of your soil composition to optimize crop yield.
hi: अपने मृदा संरचना का विस्तृत विश्लेषण प्राप्त करें और फसल उत्पादकता को बढ़ाने के लिए अनुकूल करें।
te: మీ మణ్ణు సంమిశ్రణాన్ని వివరములతో పొరకు ఉత్పత్తిని మెరుగుపరచండి.

source: Crop Advisory
hi: फसल सलाह
te: పంట సలహా

# cropAdvisoryDescription
source: Receive expert guidance and recommendations for crop management and cultivation.
hi: फसल प्रबंधन और खेती के लिए विशेषज्ञ मार्गदर्शन और सिफारिशें प्राप्त करें।
te: పంట నిర్వహణ మరియు వర్షను కొనుగోలు మరియు సలహాలను పొందండి.

source: Agri Finance
hi: कृषि वित्त
te: వ్యవసాయ ఫైనాన్స్

# agriFinanceDescription
source: Explore financing options tailored to the needs of farmers and agriculture businesses.
hi: किसानों और कृषि व्यवसायों की आवश्यकताओं के लिए वित्त प्राप्त करने के विकल्प अन्वेषित करें।
te: రైతులు మరియు వ్యవసాయ వ్యాపారాల ఆవశ్యాలకు అనుగుణంగా ఫైనాన్స్ ఎంపికలను అన్వయించండి.

source: Farm Input Supplies
hi: फार्म इनपुट सप्लाईज़
te: ఫార్మ్ ఇన్పుట్ సరఫరాలు

# farmInputSuppliesDescription
source: Browse a wide range of high-quality farm inputs and supplies for your agricultural needs.
hi: अपनी कृषि आवश्यकताओं के लिए एक व्यापक गुणवत्ता वाले फार्म इनपुट्स और सप्लाइज़ की विस्तृत श्रृंखला ब्राउज़ करें।
te: మీ వ్యవసాయ ఆవశ్యాలకు ఉన్నంతవరకు ఉన్న ఉన్నత గుణముల ఫార్మ్ ఇన్పుట్ మరియు సరఫరాలను వీక్షించండి.

source: Bajra
hi: बाजरा
te: బజ్ర

source: Maize
hi: मक्का
te: మక్కాజొన్న

source: Wheat
hi: गेहूं
te: గోధుమ

source: Jowar
hi: ज्वार
te: జొన్న

source: Barley
hi: जौ
te: బార్లీ

source: Mustard
hi: सरसों
te: ఆవాలు

source: Soyabean
hi: सोयाबीन
te: సోయాబీన్

source: Grams
hi: चना
te: గ్రాములు

source: Chilli
hi: मिर्च
te: మిరపకాయ

source: Guar
hi: ग्वार
te: గువార్

source: Soil Type
hi: मिट्टी के प्रकार
te: మణ్ణు రకం

# seedRate
source: Seed Rate (kg/acre)
hi: बीज दर (किलो/एकड़)
te: సీడ్ రేట్ (కిలోలు/ఏకరం)

source: Seed Treatment
hi: बीज उपचार
te: సీడ్ శిక్షణ

source: Growing Season
hi: उगाई गई मौसम
te: పెరిగింపు ఋతువ ు

source: Crop Duration
hi: फसल की अवधि
te: పంట కాలావధి

source: Irrigation Schedule
hi: सिंचाई का अनुसूची
te: పారిపోతి షెడ్యూల్

# nutrientManagement
source: Nutrient Management(NPK) in Kg
hi: पोषक तत्व प्रबंधन (एनपीके) किलो में
te: పోషక నిర్వహణ (ఎన్పికె)

source: Weed Management
hi: खाद्य प्रबंधन
te: గొడవెల నిర్వహణ

# diseaseAndPestManagement
source: Disease & Pest Management
hi: रोग और कीट प्रबंधन
te: వ్యాధి మరియు కీట నిర్వహణ

source: Harvesting
hi: कटाई
te: మొలక

source: Post Harvesting
hi: कटाई के बाद
te: మొలక తరువాత

source: Description:
hi: विवरण:
te: వివరణ:

# images
source: Image:
hi: छवियाँ:
te: చిత్రాలు:

# barley_soil_type_key
source: Sandy Loam Soil
hi: सैंडी लोम मिट्टी
te: స్యాండీ లోమ్ మణ్ణు

# barley_seed_rate_key
source: 20-25 kg/acre
hi: 20-25 किलोग्राम/एकड़
te: 20-25 కిలోలు/ఏకరం

# barley_seed_treatment_key
source: Prevention of Gundia (Ergot Disease): Soak seeds in a 20% salt solution for 5 minutes. Remove floating seeds and debris, then wash and dry the remaining seeds. General Treatment: Apply 3 grams of thiram per kilogram of seed. Termite Control: Use 3.3 milliliters of Thiamethoxam 30 FS per kilogram of seed. For Alkaline and Saline Soil: Soak seeds in a 1% sodium sulphate solution for 12 hours. Wash and dry seeds, then treat with fungicide before sowing for better germination.
hi: गुंडिया (इरगोट रोग) की रोकथाम: बीजों को 5 मिनट के लिए 20% नमक के घोल में भिगोएं। तैरते हुए बीज और कचरे को हटाएं, फिर शेष बीजों को धोएं और सुखा लें। सामान्य उपचार: प्रति किलोग्राम बीज में 3 ग्राम थायरम लगाएं। टर्माइट नियंत्रण: बीज प्रति 1% सोडियम सल्फेट घोल में 12 घंटे के लिए भिगोएं। बीजों को धोएं और सुखा लें, फिर बेहतर अंकुरण के लिए कीटनाशक का इलाज करें।
te: గుండియా (ఎర్గోట్ రోగానికి ముందు రోగాన్ని తట్టుకోవటం): సీడ్లను 20% ఉప్పు పరిమితిలో 5 నిమిషాలు నల్లినిచ్చే పారుదలో నానబడ్డ సీడ్లను తీసేయి. ఎరుగుపడి లేదా క్షిపణంలను తీసుకోండి, అయినప్పుడు మిగిలిన సీడ్లను కడిగి కూడానే మిగిలిన సీడ్లను శుభ్రపరచండి. సాధారణ శిక్షణ: మొక్కను కిలోల వారి ప్రతిసారు 3 గ్రాముల థిరామ్ వారితో విధ్యుత్తో తీసుకొనుటకు. కొండపు నియంత్రణ: సీడ్లను 1% సోడియం సల్ఫేట్ పరిమితిలో 12 గంటలు ఉప్పు పరిమితిలో నల్లించండి. మిగిలిన సీడ్లను కడిగి శుభ్రపరచండి, అనంతర బిత్తించడానికి ఫంగిసైడ్ వారితో చికిత్స చేయండి.

# barley_growing_season_key
source: November - December
hi: नवंबर - दिसंबर
te: నవంబర - డిసెంబర్

# barley_crop_duration_key
source: 90-120 days
hi: 90-120 दिन
te: 90-120 రోజులు

# barley_irrigation_schedule_key
source: Pre-sowing: Ensure soil moisture is sufficient for germination. Pre-irrigation may be necessary if soil moisture is low. Germination to Seedling Establishment (1-3 weeks): Irrigate every 7-10 days to support seedling establishment. Apply light irrigation to maintain soil moisture. Vegetative Growth (4-8 weeks): Increase irrigation frequency to every 10-12 days, depending on soil moisture and rainfall. Provide sufficient water for optimal vegetative growth. Critical Growth Stages (Tillering, Booting, Heading): Ensure consistent soil moisture during these stages. Irrigate every 7-10 days or as needed. Late Growth Stage (Grain Filling to Maturity): Reduce irrigation frequency as the crop approaches maturity. Avoid excessive irrigation during grain filling to prevent lodging.
hi: पूर्व-बोन: अंकुरण के लिए मिट्टी की नमी पर्याप्त होना सुनिश्चित करें। यदि मिट्टी की नमी कम है, तो पूर्व-सिंचाई की आवश्यकता हो सकती है। अंकुरण से पौधे की स्थापना (1-3 सप्ताह): पौधे की स्थापना को समर्थन करने के लिए हर 7-10 दिनों में सिंचाई करें। मिट्टी की नमी को बनाए रखने के लिए हल्की सिंचाई करें। पौष्टिक वृद्धि (4-8 सप्ताह): मिट्टी की नमी और वर्षाकाल के अनुसार हर 10-12 दिनों में सिंचाई की वृद्धि करें। शाखात्मक वृद्धि के लिए पर्याप्त पानी प्रदान करें। नाकि
te: ముందు సోకింపు: అగ్ని కొంత సాగరము సూచించేందుకు భూమి ఆరోహణ క్రమంలో పరియాయం అవసరం. ఆరంభ నీటికున్నాండి భూమి నీటి అనుకూలతనము తక్కువైనప్పుడు ప్రీ-ఇరిగేషన్ అవసరమయిన అవసరం ఉండవచ్చు. పురుగుల దేవానికి పురుగుల ఉత్పత్తిని మెరుగుపరచడానికి (1-3 వారాలు): పురుగుల ఉత్పత్తిని మెరుగుపరచడానికి ప్రతి 7-10 రోజుల నీరు పోటీదండి. భూమి నీరు అనుకూలతనాన్ని పొందడానికి కనీసం నీరు పోటీదండి అనుకుంటే మెరుగుపరచినట్లయితే మరియు అంచుల ఉత్పత్తికి లైట్ పోటీదండిని వినియోగించండి. పురుగుల వికాసం (4-8 వారాలు): నీరు ప్రతి 10-12 రోజులకాయాలు పెరుగుతుంటే, భూమి నీరు అనుకూలతనం మరియు వర్షపు ఉప్పు నిర్వహించుకోండి. ఓటమించడానికి సామర్థ్యమైన వాటర్‌ను అందించండి మరియు వర్ధింపు యంత్రం కింది ప్రక్రియను ప్రయోగించండి. ముఖ్య వృద్ధి దశలు (టిల్లరింగ్, బూటింగ్, హెడింగ్): ఈ దశల్లో సామాన్య భూమి నీరు నిర్వహించేంతటి నిర్వాహకత్వం ఉండాలి. ప్రతి 7-10 రోజులకాయాలు లేదా అవసరమైతే నీరు పోటీదండి. చివరి వృద్ధి దశలో (అన్ని కాయల నుండి పరిపాలన చేయడానికి): దశలు పూర్తి చేతిలో ఉండటంవరకు ప్రతి 7-10 రోజులకాయాలు లేకుంటే నీరు నిర్వహించకూడదు. అధికంగా నీరు వర్ధింపు కానివే చూడండి మరియు పూర్తిగా మించకూడదు.

# barley_nutrient_requirement_key
source: Nitrogen (N): 40-60 kg Phosphorus (P): 20-30 kg Potassium (K): 20-30 kg
hi: नाइट्रोजन (एन): 40-60 किलोग्राम फॉस्फोरस (पी): 20-30 किलोग्राम पोटैशियम (के): 20-30 किलोग्राम
te: నైట్రజన్ (ఎన్): 40-60 కిలోలు ఫాస్ఫరస్ (పి): 20-30 కిలోలు పొటాషియం (కే): 20-30 కిలోలు

# barley_weed_management_key
source: Cultural Practices: Proper seedbed preparation, crop rotation, and timely sowing help suppress weeds in barley fields. Mechanical Control: Hand weeding, inter-row cultivation, and shallow tillage can effectively manage weeds in barley crops. Chemical Control: Pre-emergence herbicides: Pendimethalin, Metribuzin, and Clodinafop-propargyl are commonly used pre-emergence herbicides for weed control in barley. Post-emergence herbicides: Post-emergence herbicides like 2,4-D, Metsulfuron-methyl, and Bromoxynil are used to control emerged weeds in barley fields.
hi: सांस्कृतिक प्रथाओं: बार्ली खेतों में खाद्य के लिए उचित बिस्तर तैयार करना, फसल परिभाषा, और समय पर बोने जाने की सहायकता करता है। मेकेनिकल नियंत्रण: हाथ से खुरपा, इंटर-पंक्ति खेती, और उच्च स्तर की खेती से बार्ली फसलों में जंगली जंगली की अच्छी तरह से प्रबंधित हो सकती है। रसायनिक नियंत्रण: पूर्व-उदय जड़नाशक: पेंडीमेथालिन, मेट्रिबुजिन, और क्लोडिनफ़ोप-प्रोपर्गिल बार्ली में खेत की जंगली जंगली के लिए आम रूप से प्रयुक्त पूर्व-उदय जड़नाशक हैं। पोस्ट-उदय जड़नाशक: पोस्ट-उदय जड़नाशक जैसे 2,4-डी, मेटसल्फ़ुरॉन-मिथाइल, और ब्रोमोक्सिनिल बार्ली खेतों में उभरती हुई जंगली को नियंत्रित करने के लिए प्रयुक्त किए जाते हैं।
te: సాంస్కృతిక వ్యవహారాలు: సరైన విత్తన సిద్ధత్తు, వ్యవసాయ చక్రం, మరియు సమయంలో విత్తనం బార్లీ రంధ్రంలను దమంచటం వల్ల వ్యవసాయ పరిసరాన్ని ముద్రింపు చేస్తాయి. యంత్ర నియంత్రణ: చేతికి విత్తన మరియు సాలిని పరిసరంలో కలుపుటకు, ఇంటర్ రో విత్తనానికి, మరియు ముగ్గడి కాలుకలు బార్లీ రంధ్రాలలో వ్యవసాయ గొడవెలను నిర్వహించగలిగే విధానాలను వినియోగించండి. రసాయన నియంత్రణ: ప్రీ-ప్రకటన హెర్బిసైడ్‌లు: పెండిమెథలిన్, మెట్రిబ్యుజిన్, మరియు బ్రాసినాఫోప్ ప్రాపార్గీల్ బార్లీలో గొడవెల నిర్వహణకు సాధారణంగా ఉపయోగిస్తారు. పోస్ట్-ప్రకటన హెర్బిసైడ్‌లు: బార్లీ రంధ్రంలలో సాగే గొడవెలను నిర్వహించడ ానికి 2,4-డి, మెట్‌సల్ఫురాన్-మెథైల్, మరియు బ్రోమోక్సినిల్ వంటి పోస్ట్-ప్రకటన హెర్బిసైడ్‌లను ఉపయోగిస్తారు.

# barley_disease_and_pest_management_key
source: Shootfly: Symptoms: Wilting and drying of central leaf. Cultural Control: Adjust planting time, increase seed rate, remove dead heart seedlings. Chemical Control: Seed treatment with Furadan or imidacloprid, spray with methyl demeton or neem seed kernel extract. Stem Borer: Symptoms: Transparent windows on leaves, stem tunnelling. Cultural Control: Uproot and burn stubbles, chop stems. Chemical Control: Apply Malathion or Furadan into whorls, use Carbofuran granules or Metasystox spray. Shootbug: Symptoms: Twisted, dried leaves, plant death. Chemical Control: Spray with phosphomidon or Dimethoate. Aphids: Symptoms: Yellowing leaves, honeydew production. Chemical Control: Spray with Metasystox or Dimethoate, treat seeds with imidacloprid or thiamethoxam. Ear Head Midge: Symptoms: Red maggots in grains, grain drying. Management: Spray cypermethrin at flowering and milk stages. Mites: Symptoms: Webbing on leaves, leaf redness and drying. Management: Spray Dimethoate or Dicofol. Grainmold Damage: Symptoms: Discolored grains, yield loss. Cultural Control: Timely harvesting and drying. Chemical Control: Spray with Aureofungin or Captan. Ergot: Symptoms: Honeydew exudation, blackened grains. Control: Wash seeds in salt solution, spray with benlate or Propiconazole. Plant Rot: Symptoms: Black or pink fungus growth on grains. Management: Spray Mancozeb during flowering, soft dough, and ripening stages. Leaf Spot: Symptoms: Leaf diseases due to rain and humidity. Management: Spray Zaineb or Mancozeb as needed.
hi: शूटफ्लाई: लक्षण: मध्य एक पत्ती का सुखा होना और सुखाना। सांस्कृतिक नियंत्रण: बोने का समय समायोजित करें, बीज दर बढ़ाएं, मृत हृदय की अंकुरण को हटा दें। रसायनिक नियंत्रण: फुरादान या इमिडाक्लोप्रिड से बीजों का उपचार करें, मिथाइल डेमेटन या नीम बीज बीज के निकास अर्क के साथ छिड़काव करें। स्टेम बोरर: लक्षण: पत्तियों पर पारदर्शी खिड़कियाँ, तन सिकुड़ना। सांस्कृतिक नियंत्रण: जड़ को उखाड़ फेंकें, तन काटें। रसायनिक नियंत्रण: फ्यूराडान या फुरादान वायुवृष्टि में लगाएं, कार्बोफ्यूरान ग्रैन्यूल्स या मेटासिस्टोक्स स्प्रे लगाएं। शूटबग: लक्षण: मोड़ी हुई, सुखी पत्तियाँ, पौधे का मरना। रसायनिक नियंत्रण: फॉस्फोमिडोन या डाइमेथोटेट के साथ स्प्रे करें। एफिड्स: लक्षण: पीले पत्तियाँ, मधुरा उत्पादन। रसायनिक नियंत्रण: मेटासिस्टोक्स या डाइमेथोटेट के साथ स्प्रे करें, बीजों का इमिडाक्लोप्रिड या थाइआमेथोक्साम के साथ उपचार करें। ईयर हेड मिड्ज़: लक्षण: अनाज में लाल कीड़ों, अनाज सुखाना। प्रबंधन: फूलने और दूध स्थितियों में सायपर्मेथ्रिन को छिड़काव करें। माइट्स: लक्षण: पत्तियों पर जाल, पत्तियों का लालापन और सुखाना। प्रबंधन: डाइमेथोटेट या डाइकोफोल का स्प्रे करें। अनाज का कीड़ा कीटनाशक: धान को विद्यमान आधारिक जागरूकता और व्यवस्थापन के साथ विना जलीय उपकरणों का उपयोग करें। समीक्षा: नियमित रूप से धान खेतों की जांच करें और समस्याओं का समाधान समय पर करें।
te: షూట్‌ఫ్లై: లక్షణాలు: ముఖ్య ఆకుల వెంటనే మరియు తీవ్రంగా ఎల్లలింపు అందాలి. సాంస్కృతిక నియంత్రణ: విత్తన సమయం సరిగ్గా అమర్చుకోవడానికి, సీడ్ దరియిని పెరుగుతుంది, డెడ్ హెర్ట్ సీడ్లను తీసుకొనేందుకు తీవ్రంగా ఎల్లలింపును తీర్చేందుకు. రసాయన నియంత్రణ: ఫురాడాన్ లేదా ఇమిడాక్లోప్రిడ్‌తో సీడ్ శిక్షణ, మెథైల్ డెమెటాన్ లేదా నీమ్ సీడ్ కెర్నల్ ఎక్స్ట్రాక్ట్ తో స్ప్రే. స్టెమ్ బోరర్: లక్షణాలు: ఆకులలో కొన్నింటి వెండిపోయినప్పుడు రెండుత్రవుల తీవ్రంగా ఉంటాయి. సాంస్కృతిక నియంత్రణ: కాటుగాలు ఎగురుకోండి మరియు స్టంబ్లను కొట్టేందుకు తిరిగించేందుకు. రసాయన నియంత్రణ: మలాథియాన్ లేదా ఫురాడాన్ వారితో కాటుగాలలు విత్తనం పైకి వేయించడం, కాప్రోఫ్యూరాన్ గ్రాన్యూల్లు లేదా మేటాసిస్టాక్స్ స్ప్రే ఉపయోగించుకోండి. షూట్‌బగ్: లక్షణాలు: తిరిగింపబడిన, ఎల్లలు చీరగా ఉండటం, సస్యంమరణం. రసాయన నియంత్రణ: ఫాస్ఫోమిడోన్ లేదా డిమెథోటేట్ తో స్ప్రే. ఆఫిడ్లు: లక్షణాలు: ఎల్లలు మొదట బాగానే కూడినప్పుడు, హనీడ్యూ ఉత్పత్తి. రసాయన నియంత్రణ: మేటాసైస్టాక్స్ లేదా డిమెథోటేట్ తో స్ప్రే, సీడ్లను ఇమిడాక్లోప్రిడ్ లేదా థియామెథోక్సామ్ తో శిక్షించండి. ఎరా హెడ్ మిడ్జ్: లక్షణాలు: గింజలలో ఎరుపు ముసుగులు, గింజల తిప్పుటిలో నీళ్ళు. నిర్వాహణ: పూలు మరియు పాల దశలలో సైపెర్మెథ్రిన్ ప్రయోగించండి.

# barley_intercultivation_key
source: Weeding: Remove weeds manually or with tools to avoid competition for nutrients. Mulching: Use organic mulch like straw to suppress weeds and conserve moisture. Inter-row Cultivation: Loosen soil between rows for better aeration and root growth. Thinning: Remove overcrowded plants to ensure proper spacing and healthy growth. Intercropping: Plant compatible crops between barley rows for better land use. Companion Planting: Grow plants that benefit barley, like those that repel pests. Crop Rotation: Rotate barley with different crops to maintain soil health. Water Management: Use efficient irrigation methods to water barley effectively. Soil Conservation: Prevent soil erosion with practices like contour plowing. Integrated Pest Management: Control pests and diseases with natural methods whenever possible. Monitoring: Regularly check barley fields for issues and take action promptly. Consultation: Seek advice from experts for specific guidance on barley cultivation.
hi: खुरपाई: पोषक तत्वों के लिए प्रतिस्पर्धा से बचने के लिए मैन्युअल रूप से या उपकरणों के साथ खुरपाई करें। मलचिंग: स्ट्रॉ की तरह कार्बनिक मलच उपयोग करें ताकि खाद्य रोका जा सके और नमी को संरक्षित किया जा सके। इंटर-पंक्ति खेती: बेहतर वायुशोधन और जड़ संवृद्धि के लिए पंक्तियों के बीच मिट्टी को ढीला करें। पतला करना: सही अंतराल और स्वस्थ वृद्धि सुनिश्चित करने के लिए अधिक भरा हुआ पौधे हटाएं। इंटरक्रॉपिंग: बेहतर भूमि के उपयोग के लिए बार्ली पंक्तियों के बीच संगत फसलें लगाएं। कंपनियन प्लांटिंग: बार्ली का लाभ उठाने वाले पौधों को उगाएं, जैसे कि वे उन कीटों को भगाते हैं। कृषि परिरोधी: मिट्टी स्वास्थ्य को बनाए रखने के लिए अलग-अलग फसलों के साथ बार्ली का बदलते रहना। पानी प्रबंधन: बार्ली को अच्छी तरह से पानी देने के लिए कुशल सिंचाई विधियों का उपयोग करें। मिट्टी संरक्षण: कांटोर प्लाऊइंग की तरह की प्रथाओं के साथ मिट्टी का अपघात रोकें। एकीकृत कीट प्रबंधन: संभवत: नेचरल तरीकों से कीटों और रोगों को नियंत्रित करें। मॉनिटरिंग: बार्ली खेतों की समस्याओं की नियमित जाँच करें और त्वरित कार्रवाई करें। सलाह: बार्ली खेती पर विशेष निर्देश के लिए विशेषज्ञों की सलाह लें।
te: విత్తనను గొడవెలా నిర్వహించడానికి విత్తనాల మధ్య వాటర్ నుండి హక్కులను చేయడం. మల్ఛనం: కలుపును అదృష్టంగా మరియు నీటి నిర్వహణ కింద వరిసెనగ వంటి సంక్షేమంలో ఉపయోగించండి. ఇంటర్రో సెకిన్లేటివేషన్: సాలను నిర్వహించడానికి మధ్య వారసేగా మరియు రేతను కొంతగా ఉపయోగించండి. గుణకాలం: సరిపోతుండటానికి ఎండు రకాలు మారుతుంటే నుండి పరిపాలనను ప్రారంభించండి. బ్రోడ్ కల్టివేషన్: బార్లీ సహకరిత వ్యవసాయ పరిసరాన్ని మంచి భూమి ఉపయోగించడానికి మధ్యక్కడ ఉండాలి. విప్లావ విధానం: బార్లీ నుండి కనుగొనవచ్చే దుష్ప్రభ ావాలను తగ్గించడానికి యాంత్రిక విధానాలను ఉపయోగించండి. ప్రదేశాల నిర్వాహణ: నిర్వహణ ప్రణాళికలను బార్లీ యంత్రాలకు నీడ అందించండి. భూసంరక్షణ: కోండగా కలుపును తట్టుకొన్నట్టుగా కాపాడండి. సంసద్ధ కీట నిర్వాహణ: సాహచర్యం అంటే మొత్తం సరిపోతుంది. బార్లీ రంధ్రాలకు స్థాయి నిర్వహణకు మాత్రమే అనుకూలం అయ్యే సాహచర్య విధానాలను ప్రయోగించండి. మానిటరింగ్: బార్లీ రంధ్రాలను సాంకేతికంగా చూడడానికి నియంత్రించండి మరియు త్వరగా చర్యలు తీసుకోండి. ఆలోచనా: బార్లీ రంధ్రాలకు సంబంధిత నిర్వాహణ పై స్పష్టంగా మార్పు చేయడానికి విశేషిస్తారు.

# barley_harvesting_key
source: March - April
hi: मार्च - अप्रैल
te: మార్చి - ఏప్రిల్

# barley_post_harvesting_key
source: Drying: Dry harvested barley in open areas until moisture content is less than 15%. Aim for a drying duration of 3-4 days to achieve optimal moisture levels for storage. Shelling: Use a sheller to separate barley kernels from the cobs efficiently. Ensure kernels are thoroughly dried until moisture content reaches 10-12% for better storage. Packaging: Store dried barley kernels in clean, labeled gunny bags. Seal bags properly and store them in a designated storage area to maintain quality.
hi: सुखाना: सूखे हुए बार्ली को खुले स्थलों में सुखा लें जब तक नमी सामग्री 15% से कम न हो। संचालन के लिए 3-4 दिनों की सुखाने की अवधि का लक्ष्य स्टोरेज के लिए बेहतर नमी स्तर प्राप्त करना है। शैलिंग: बार्ली दानों को अच्छी तरह से अलग करने के लिए एक शेलर का उपयोग करें। उन्हें संपूर्ण रूप से सूखा होने दें जब तक नमी सामग्री 10-12% तक न हो जाए ताकि स्टोरेज के लिए बेहतर हो। पैकेजिंग: साफ, लेबल गन्ना बैग में सूखे हुए बार्ली के दानों को स्टोर करें। बैगों को ठीक से सील करें और उन्हें एक निर्दिष्ट संग्रह स्थल में स्टोर करें ताकि गुणवत्ता बनी रहे।
te: డ్రైయింగ్: నెలకు సేనగలను తరుమి సిద్ధంగా డ్రైచేయండి ఎంతో కనీసం కాలం ఉన్నప్పుడు భద్రతా పొందడానికి. షెలింగ్: సెనగలను దుంపించడానికి ఒక శెలర్‌ను ఉపయోగించండి. భద్రతా పొందడానికి సెనగలు సరిగా డ్రై అయి ఉండాలి వేరు నెలకు కంటంటే 10-12%. ప్యాకేజింగ్: డ్రైడ్ సెనగలను శుభ్రంగా లేబుల్ గన్నెల్లో ఉంచండి. బాగ్‌లను సరిగా మూసి దానిని భద్రంగా భద్రపరచండి.

# appBarTitle
source: Contact Us
hi: संपर्क करें
te: మాకు సంప్రదించండి

# addressTitle
source: Address:
hi: पता:
te: చిరునామా:

# address
source: Vivekananda Global University, Jaipur, Rajasthan - 303012
hi: विवेकानंद ग्लोबल विश्वविद्यालय, जयपुर, राजस्थान - 303012
te: వివేకానంద గ్లోబల్ విశ్వవిద్యాలయం, జైపూర్, రాజస్థాన - 303012

# phoneTitle
source: Phone:
hi: फ़ोन:
te: ఫోన్:

# emailTitle
source: Email:
hi: ईमेल:
te: ఇమెయిల్:

# followUsTitle
source: Follow us on:
hi: हमें फ़ॉलो करें:
te: మాకు అనుసరించండి:

# shareFeedbackTitle
source: Share your feedback:
hi: अपनी प्रतिक्रिया साझा करें:
te: మీ అభిప్రాయాన్ని పంచుకోండి:

# sendButtonLabel
source: Send Message
hi: संदेश भेजें
te: సందేశం పంపు

# nameLabel
source: Name
hi: नाम
te: పేరు

# emailLabel
source: Email
hi: ईमेल
te: ఇమెయిల్

# messageLabel
source: Message
hi: संदेश
te: సందేశం

# nameError
source: Please enter your name
hi: कृपया अपना नाम दर्ज करें
te: దయచేసి మీ పేరు నమోదు చేయండి

# emailError
source: Please enter a valid email
hi: कृपया एक मान्य ईमेल दर्ज करें
te: దయచేసి మాన్యమైన ఇమెయిల్ నమోదు చేయండి

# messageError
source: Please enter a message
hi: कृपया एक संदेश दर्ज करें
te: దయచేసి సందేశం నమోదు చేయండి

# messageSentSnackBar
source: Message sent
hi: संदेश भेजा गया
te: సందేశం పంపబడింది

# weatherTitle
source: Weather
hi: मौसम
te: వాతావరణం

# advisoryTitle
source: Advisory
hi: सलाह
te: సమాచారం

# homeTitle
source: Home
hi: होम
te: హోమ్

# marketTitle
source: Market
hi: बाजार
te: మార్కెట్

# contactTitle
source: Contact
hi: संपर्क
te: సంప్రదించండి

# soilTestings
source: Soil Testing
hi: मृदा परीक्षण
te: భూస్థితి పరీక్ష

# cropAdvisorys
source: Crop Advisory
hi: फसल सलाह
te: పంట సలహా

source: Weather Alerts
hi: मौसम चेतावनियाँ
te: వాతావరణ హెచ్చరికలు

source: Farm Inputs
hi: फार्म इनपुट्स
te: వ్యవసాయ నివేదికలు

source: Uttar Pradesh
hi: उत्तर प्रदेश
te: ఉత్తర ప్రదేశ్

source: Haryana
hi: हरियाणा
te: హరియాణా

source: Maharashtra
hi: महाराष्ट्र
te: మహారాష్ట్ర

source: Kerala
hi: केरल
te: కేరళం

source: Punjab
hi: पंजाब
te: పంజాబ్

source: Rajasthan
hi: राजस्थान
te: రాజస్థాన్

source: Madhya Pradesh
hi: मध्य प्रदेश
te: మధ్య ప్రదేశ్

source: Gujarat
hi: गुजरात
te: గుజరాత్

source: Telangana
hi: तेलंगाना
te: తెలంగాణ

source: Himachal Pradesh
hi: हिमाचल प्रदेश
te: హిమాచల ప్రదేశ్

source: Tripura
hi: त्रिपुरा
te: త్రిపుర

source: Odisha
hi: ओडिशा
te: ఒడిషా

source: Jammu and Kashmir
hi: जम्मू और कश्मीर
te: జమ్మూ కాశ్మీర్

source: Karnataka
hi: कर्नाटक
te: కర్ణాటక

source: Uttarakhand
hi: उत्तराखंड
te: ఉత్తరాఖండ్

source: Chhattisgarh
hi: छत्तीसगढ़
te: ఛత్తీస్గఢ్

source: Nagaland
hi: नागालैंड
te: నాగాల్యాండ్

source: Chandigarh
hi: चंडीगढ़
te: చండీగఢ్

# nctofDelhi
source: National Capital Territory of Delhi
hi: नेशनल कैपिटल टेरिटरी ऑफ़ दिल्ली
te: దిల్లీ జాతీయ రాజధాని ప్రాంతం

source: Bihar
hi: बिहार
te: బిహార్

source: Meghalaya
hi: मेघालय
te: మెఘాలయ

source: Andhra Pradesh
hi: आंध्र प्रदेश
te: ఆంధ్ర ప్రదేశ్

source: Select State
hi: राज्य का चयन करें
te: రాష్ట్రానికి ఎంచుకోండి

source: Fetch Market Prices
hi: बाजार की कीमतें प्राप्त करें
te: మార్కెట్ ధరలు తీసుకోండి

source: Search district or Market name
hi: जिला या बाजार का नाम खोजें
te: జిల్లా లేదా మార్కెట్ పేరు వెతకండి

# commodityLabel
source: Commodity
hi: वस्त्र
te: వస్తువు

# varietyLabel
source: Variety
hi: विविधता
te: వివిధము

# priceLabel
source: Price
hi: मूल्य
te: ధర

source: Market Prices
hi: बाजार के भाव
te: మార్కెట్ ధరలు

source: Temperature
hi: तापमान
te: తాపమానం

source: Humidity
hi: नमी
te: ఆద్రత

source: WindSpeed
hi: हवा की गति
te: గాలి వేగం

# weatherDescription
source: Weather
hi: मौसम का विवरण
te: వాతావరణ వివరణ

# precipitationProbability
source: Chance of Rain
hi: वर्षा की संभावना
te: వర్షా సంభావన

# bajra_soil_type_key
source: Sandy Loam Soil, Sandy Soil
hi: रेतीलोम मृदा, रेतीला मृदा
te: బంగారు మణికి, రబ్బరు మణికి

# bajra_seed_rate_key
source: 1.6 Kg/acre
hi: 1.6 किलोग्राम/एकड़
te: 1.6 కిలోలిటరు/ఎకరా
