Repository: villageboy09/cs
Catalog: lib/l10n/app_*.arb
Languages: hi, te

# mustard_inter_cultivation_key
source: Weeding: Remove weeds manually or with tools to prevent competition for nutrients and water. Mulching: Apply organic mulch around mustard plants to suppress weed growth and conserve soil moisture. Inter-row Cultivation: Loosen soil between mustard rows to improve root development and water infiltration. Thinning: Thin out crowded mustard plants to provide adequate space for growth and airflow. Intercropping: Plant compatible crops between mustard rows to maximize land productivity and diversity. Companion Planting: Grow companion plants alongside mustard to repel pests and enhance soil health. Crop Rotation: Rotate mustard with different crops in successive seasons to prevent disease buildup and improve soil fertility.
hi: खर्डी: पोषक तत्वों और पानी के लिए प्रतिस्पर्धा रोकने के लिए हाथ से या उपकरणों के साथ खर्डी को हटाएं। मल्चिंग: मस्तर्द पौधों के आसपास कार्बनिक मलच लगाएं ताकि खर्डी का विकास और मृदा की नमी को संरक्षित रखा जा सके। अंतर-पंक्ति खेती: मस्तर्द की पंक्तियों के बीच मृदा को हल्का करें ताकि जड़ विकास और पानी का प्रवाह सुधारें। पतला करना: भीड़भाड़ वाले मस्तर्द पौधों को कम करें ताकि विकास और हवा के लिए पर्याप्त स्थान मिल सके। अंतर-फसल: मस्तर्द पंक्तियों के बीच संगत फसलें लगाएं ताकि भूमि की उत्पादकता और विविधता को अधिकतम किया जा सके। सहकारी बोना: मस्तर्द को आगामी मौसमों में विभिन्न फसलों के साथ बोना ताकि बीमारी का निर्माण रोका जा सके और मृदा की उर्वरता को सुधारा जा सके।
te: గోల్లను తీసుకొని: పొలముకు పోటీలలో పోలింగ్ ప్రతిరోధానికి గోర్రెలను మానువడి లేదా సాధనాలతో తీసుకోవడం కారణంగా నీరు, ఆక్సిజన్ మరియు మినుమడి ప్రవాహంకు ప్రతిరోధించవచ్చు. మల్చింగ్: మస్టర్డ్ మొక్కల సుత్తిన ఆర్గానిక్ మల్చ్ చేయండి గోర్రెల వృద్ధి మరియు భూమి నిలువును నియంత్రించడానికి. ఇంటర్-రో మనవడి: మస్టర్డ్ వరుసల మధ్య మస్టర్డ్ రో వర్షాలు మధ్య సాంఘిక రూపంలో వర్షం పనిచేయడానికి చెత్త సమయాలలో మంచి పైరుని తయారు చేయాలి. అందుకే సముద్రాంశ బ్రియెడింగ్ సూపర్నూవాల్ గోర్రెలు ప్రతి స్థలంలో తయారు చేయాలి.

# mustard_harvesting_key
source: February - March
hi: फरवरी - मार्च
te: ఫిబ్రవరి - మార్చి

# mustard_post_harvesting_key
source: Harvest Timing: Harvest the crop when the pods turn yellowish-brown to ensure optimum maturity. Avoid delayed harvesting to prevent shattering and minimize losses. Precautions Against Shattering: Harvest just before the pods open to prevent seed loss due to shattering. Stacking Before Threshing: Stack the harvested crop on the threshing floor for 5-6 days to allow for drying and curing. Threshing Process: Thresh the dried crop to separate grain from husk. Utilize slow-moving natural air currents to aid in the separation process. Husking Separation: Ensure efficient separation of threshed grain from husk for further processing and storage.
hi: फसल की कटाई का समय: पॉड नरम भूरा होने पर पौधों को काटें ताकि आदर्श परिपक्ति सुनिश्चित की जा सके। खर्डी को रोकने के लिए देर से कटाई से बचें और नुकसान को कम करने के लिए। खर्डी से पहले ठहराव: खरीदी गई फसल को 5-6 दिनों तक खराद पर रखें ताकि सुखने और परिपाक के लिए समय मिले। खरदन प्रक्रिया: सुखी फसल को अलग करने के लिए खरदने की प्रक्रिया का पालन करें। अलग किए गए अनाज को अलग करने के लिए धीरे-धीरे चलने वाले प्राकृतिक हवा के प्रवाह का उपयोग करें। बीज से अलग करना: विकल्प के रूप में खर्दने के बाद अनाज को अलग करने के लिए प्रभावी तरीके से सुनिश्चित करें।
te: మార్చి మార్చి చివరిగా స్పంది వరకు బంకింగ్ చేయండి. పొడుకు చివరిగా తీసుకుని, చివరిగా రకాలను నిర్వహించడానికి రుచికరమైన మితంగా నీటిని ప్రమాణం చేయండి. తాకిన బంకింగ్ కొరకు మర్చి పాటు అరగాంకి బెట్టండి. తీసుకునున్న పొడుకు విచ్చిన పంటలను పొడిస్తే మరియు అందరి ప్రాక్టీస్ ప్రమాణాలను అనుసరించినప్పుడు స్పంది వరకు చీకటి చేయండి. స్పంది ప్రక్రియ: ఉష్ణములో పంటలను మరియు ఆవిర్భావానికి వ్యవస్థించడానికి వరికేటప్పిన విధంగా అందించండి.

# soyabean_soil_type_key
source: Loamy Soil
hi: लूमी मिट्टी
te: లోమీ మణ్ణు

# soyabean_seed_rate_key
source: 16-20 kg/acre
hi: 16-20 किलो/एकड़
te: 16-20 కిలోలు/ఎకరం

# soyabean_seed_treatment_key
source: Fungicides: Use fungicides such as metalaxyl, carbendazim, or thiram to control fungal diseases like seed rot and damping-off. Insecticides: Apply insecticides like imidacloprid or thiamethoxam to protect against seed and soil-borne pests such as aphids and bean leaf beetles. Inoculants: Use rhizobium inoculants to promote nitrogen fixation by forming nodules on soybean roots, improving plant health and yield potential.
hi: फंगिसाइड: बीज स्वास्थ्य और प्राकृतिक भूमि संशोधन के लिए मेटालाक्सील, कार्बेंडाजिम, या थिराम जैसे फंगिसाइड का उपयोग करें। कीटनाशक: बीज और मिट्टी जनित कीटों जैसे एफिड और बीन पत्ती का कीटनाशक लगाएं, जैसे इमिडाक्लोप्रिड या थाइमेथॉक्साम। इनोक्यूलेंट: नाइट्रोजन फिक्सेशन को प्रोत्साहित करने के लिए सोयाबीन की जड़ों पर नोड्यूल बनाकर राइजोबियम इनोक्यूलेंट का उपयोग करें, पौधे की स्वास्थ्य और उत्पादकता को बेहतर बनाए।
te: ఫంగ్సైడ్లు: మెటాలక్సైల్, కార్బెండజిమ్, లేదా థిరామ్ వంటి ఫంగల్ జీవాణువిని నియంత్రించడానికి ఉపయోగించండి. కీటాణ్ణులు: సీడ్ మరియు మణ్ణు-బాధిత కీటాణ్ణులకు ఇమిడాక్లోప్రిడ్ లేదా థియామెతోక్సామ్ వంటి కీటనాశకాలను వినియోగించండి. ఇనోక్యులెంట్స్: రైఝోబియం ఇనోక్యులెంట్లను ఉపయోగించి నైట్రజన్ ఫిక్సేషన్ ప్రోత్సహించడం ద్వారా సోయాబీన్ రూట్లపై కణుకను గుర్తించి, ప్రాంటు ఆరోగ్యాన్ని మరియు పంట ప్రతిస్పందన సాధ్యతను పెంచండి.

# soyabean_growing_season_key
source: October - November
hi: अक्टूबर - नवंबर
te: అక్టోబర్ - నవంబర్

# soyabean_crop_duration_key
source: 90-120 days
hi: 90-120 दिन
te: 90-120 రోజులు

# soyabean_irrigation_schedule_key
source: Pre-sowing: Ensure soil moisture is adequate for germination. Pre-irrigation may be necessary if soil moisture is low. Germination to Seedling Establishment (1-3 weeks): Irrigate every 7-10 days to support seedling establishment. Apply moderate irrigation to maintain soil moisture. Vegetative Growth (4-8 weeks): Increase irrigation frequency to every 10-12 days, depending on soil moisture and rainfall. Provide sufficient water for vigorous vegetative growth. Critical Growth Stages (Vegetative Growth, Flowering, Pod Development): Maintain consistent soil moisture during these stages. Irrigate every 7-10 days or as needed. Late Growth Stage (Pod Development to Maturity): Gradually reduce irrigation frequency as the crop matures. Avoid overwatering during pod development to prevent fungal diseases.
hi: प्राकृतिक अभिवृद्धि साधन की जरूरत है: बीजारोपण के पूर्व: अंकुरण के लिए मिट्टी मॉइस्चर पर्याप्त है या नहीं, इसकी जांच करें। यदि मिट्टी की नमी कम है तो प्राकृतिक अभिवृद्धि की आवश्यकता हो सकती है। अंकुरण से बीजलिंग स्थापना तक (1-3 सप्ताह): बीजलिंग स्थापना को समर्थन करने के लिए प्रतिसप्ताह 7-10 दिनों के अंतराल से पानी दें। मिट्टी मॉइस्चर को बनाए रखने के लिए मध्यम प्रकार की प्राकृतिक अभिवृद्धि लागू करें। वनस्पतिक वृद्धि (4-8 सप्ताह): मिट्टी मॉइस्चर और वर्षावन देखते हुए प्रतिसप्ताह 10-12 दिनों के अंतराल से पानी दें। विकसित वनस्पतिक वृद्धि के लिए पर्याप्त पानी उपलब्ध कराएं। महत्वपूर्ण वृद्धि चरण (वनस्पतिक वृद्धि, फूल और फलन): इन चरणों के दौरान संवेदनशील मिट्टी की नमी को बनाए रखने के लिए स्थिर मिट्टी मॉइस्चर का पालन करें। प्रतिसप्ताह 7-10 दिनों के अंतराल से पानी दें या जैसे आवश्यक हो। विलंबित वृद्धि चरण (फल विकास से पक्षियों की परिपक्वता तक): फसल परिपक्व होने के साथ पानी आवश्यकता को धीरे-धीरे कम करें। फंगल बीमारियों को रोकने के लिए फल विकास के दौरान अधिक पानी देने से बचें।
te: ప్రి-సోయింగ్: అంచనా కోసం మణ్ణు నిర్మాణానికి సాధారణ నివృత్తిని ఖచ్చిని చేయండి. మణ్ణు ఆరదం తక్కువైతే, ముందస్తు నీటి సాధారణం అవసరం. అంకెదార్ధం నుండి ప్రోత్సాహిత స్థాపన (1-3 వారాలు): ప్రోత్సాహిత స్థాపనను మద్దతుగా ఉంచడానికి ప్రతి 7-10 రోజులకు సించను నిర్వహించండి. మణ్ణు ఆరదంను నిర్వహించడానికి మధ్యస్థిరంగా మణ్ణు నీటిని అందించండి. ప్రాంగణం వృద్ధి (4-8 వారాలు): మణ్ణు ఆరదం మరియు వర్షాధారం పై ఆధారపడినప్పటికీ, మణ్ణు నీటిని ప్రతి 10-12 రోజులకు ప్రతిస్పందించండి. తీవ్రమైన ప్రాంగణం పొందడానికి యాక్సీసారీ నీటిని అందించండి. క్రిటికల్ వృద్ధి స్థాయిలు (ప్రాంగణం వృద్ధి, పుష్పము, గిన్నె అభివృద్ధి): ఈ స్థాయిల్లో సామాన్యముగా మణ్ణు నీటిని పొందండి. ప్రతి 7-10 రోజులకు లేదా అవసరమైతే అందండి. దంపతి వృద్ధి స్థాయి (గిన్నె అభివృద్ధి నుండి పరిపాలన చేత ప్రారంభం చేత పరిపాలన వరకు): మీకు పంట పురుగును తీసుకోవడం ద్వారా మణ్ణు నీటి స్థాయిని నియంత్రించండి. మీకు ఫంగల్ కీటాలు నివారించటానికి కంపోజిత్ గా బయటకు బూటమి ద్వారా బూటముని వేయండి.

# soyabean_nutrient_requirement_key
source: Nitrogen (N): 60-80 kg Phosphorus (P): 40-50 kg Potassium (K): 30-40 kg
hi: नाइट्रोजन (N): 60-80 किलोग्राम फास्फोरस (P): 40-50 किलोग्राम पोटाशियम (K): 30-40 किलोग्राम
te: నైట్రజన్ (N): 60-80 కిలోలు ఫాస్ఫోరస్ (P): 40-50 కిలోలు పొటాషియం (K): 30-40 కిలోలు

# soyabean_weed_management_key
source: Cultural Practices: Adequate soil fertility management, proper row spacing, and timely weed removal help manage weeds in soybean cultivation. Mechanical Control: Hand weeding, inter-row cultivation, and rotary hoeing are effective mechanical methods for weed control in soybean fields. Chemical Control: Pre-emergence herbicides: Pendimethalin, Metribuzin, and Imazethapyr are commonly used pre-emergence herbicides for weed control in soybean. Post-emergence herbicides: Post-emergence herbicides like Glyphosate, Imazethapyr, and Quizalofop-P-ethyl are used to control emerged weeds in soybean crops.
hi: सांस्कृतिक प्रथाएँ: सोयाबीन उत्पादन में जलवायु की उपयुक्तता, सही पंक्ति अंतरण, और समय पर खाद्य निकासी सहायक होती है। मैकेनिकल नियंत्रण: हैंड वीडिंग, इंटर-रो पेशेवरी, और रोटरी होइंग सोयाबीन क्षेत्रों में खाद्य निकासी के लिए प्रभावी मैकेनिकल तकनीक होती है। रासायनिक नियंत्रण: प्रारंभिक उद्भव हर्बिसाइड: सोयाबीन में खाद्य निकासी के लिए पेंडिमेथालिन, मेट्रिबुजिन, और इमाजेथापायर आमतौर पर प्रारंभिक उद्भव हर्बिसाइड के रूप में प्रयुक्त किए जाते हैं। पोस्ट-उद्भव हर्बिसाइड: पोस्ट-उद्भव हर्बिसाइड जैसे ग्लाइफोसेट, इमाजेथापायर, और क्विज़ालोफ़ोप-पी-एथिल सोयाबीन फसलों में उद्भवित खाद्य निकासी को नियंत्रित करने के लिए प्रयुक्त किए जाते हैं।
te: సాంస్కృతిక పద్దతులు: సారిసే మణ్ణు సంరక్షణ, యావత్తు వ్యవస్థన, సమయంలో ముల్లునీటి తొడిమెదట వంటి చిరునామక పద్ధతులు సోయాబీన్ విత్తనానికి ముల్లువార్త మద్దతు చేస్తాయి. యంత్రిక నియంత్రణ: ముల్లువార్త నియంత్రణలో హ్యాండ్ వీడింగ్, అంతర్-వార్ ఉగ్రవార్తన మరియు రోటరీ హోవింగ్ పద్ధతులు కార్యకరమైన యంత్రిక పద్ధతులు అవుతాయి. రాసాయన నియంత్రణ: ప్రీ-ఇమర్జెన్స్ హెర్బిసైడ్లు: పెండిమెథలిన్, మెట్రిబ్యుజిన్, మరియు ఇమజెతాపైర్ ప్రసిద్ధంగా సోయాబీన్ విత్తనంలో ముల్లువార్త నియంత్రణానికి ప్రి-ఇమర్జెన్స్ హెర్బిసైడ్లు. పోస్ట్-ఇమర్జెన్స్ హెర్బిసైడ్లు: పోస్ట్-ఇమర్జెన్స్ హెర్బిసైడ్లు గ్లైఫోసేట్, ఇమజెతాపైర్, మరియు క్విజలోఫాప్-పి-ఎతిల్ వంటి హెర్బిసైడ్లు సోయాబీన్ విత్తనంలో ముల్లువార్త నియంత్రణానికి ఉపయోగించబడతాయి.

# soyabean_disease_and_pest_management_key
source: Diseases: White Rust / Downy Mildew: Symptoms: White pustules on leaves, stem swelling. Control: Seed treatment with garlic extract, foliar sprays of Bordeaux mixture, disease-free seeds. Alternaria Leaf Spot: Symptoms: Circular brown spots on leaves, stem lesions. Control: Healthy seeds, copper oxychloride sprays, weed management, crop rotation. Grain Mold Damage: Symptoms: Discolored grains, reduced yield. Control: Avoiding rainy maturation periods, timely harvesting, fungicide sprays, seed treatment. Ergot: Symptoms: Blackened grains, honeydew exudation. Control: Mechanical seed cleaning, fungicide sprays (Benlate, Propiconazole), sanitation. Pests: Aphids: Symptoms: Leaf curling, stunted growth, sooty mold. Management: Use tolerant varieties, sticky traps, neem oil or soap sprays, Dimethoate. Painted Bug: Symptoms: Wilting, withering due to sap-sucking. Management: Deep plowing, early sowing, irrigation, quick threshing, Dimethoate sprays. Sawfly: Symptoms: Leaves with shot holes, drying. Management: Summer plowing, early sowing, clean cultivation, bitter gourd seed oil, Quinalphos sprays.
hi: रोग: सफेद जंग: पत्तियों पर सफेद पुलियों का उत्पन्न होना, तने का फूलाव, संवेदनशीलता। नियंत्रण: लहसुन अरक्षण, बोर्डो मिश्रण के फोलियर स्प्रे, रोग-मुक्त बीज। आल्टरनारिया पत्ती की स्थानीय चिह्न: आलूचाया भूरे धागों पर गोलाकार धागे, तने के चोट। नियंत्रण: स्वस्थ बीज, ताम्र पदार्थ के स्प्रे, खाद्य निकासी, फसल चक्र। दाना का कीट नुकसान: चिह्न: रंग बदलने वाले अनाज, कम उपज। नियंत्रण: बारिशी परिपक्वता की आवश्यकता को टालना, समय पर फसली, कीटनाशक स्प्रे, बीज स्वास्थ्य। इर्गोट: सिग्न: काले अनाज, मधुरवा निकासना। नियंत्रण: मैकेनिकल बीज सफाई, फंगिसाइड स्प्रे (बेनलेट, प्रोपिकोनाजोल), स्वच्छता। कीट: एफिड: चिह्न: पत्तियों की कुंडली, रुकी हुई वृद्धि, धूल फैंक। प्रबंधन: उत्तोलक विविधता, चिपकने वाले झांसे, नीम तेल या साबुन स्प्रे, डिमेथोएट। पेंटेड बग: चिह्न: सिकुड़न, सुखाना लेकिन रस-चूसने के कारण। प्रबंधन: गहरा खोदना, जल्दी बोना, सिंचाई, तेज बोना, डिमेथोएट स्प्रे। सॉफ्लाई: चिह्न: धागों के साथ पत्तियाँ, सुखना। प्रबंधन: गर्मियों की खुलाई, जल्दी बोना, स्वच्छता, कड़वी करेला बीज तेल, क्विनालफोस स्प्रे।
te: వ్యాధులు: వైట్ రస్ట్ / డౌనీ మిల్డ్యూ: లేదా కుందుపు అవస్థలు లేదా స్టెం స్వెలింగ్. నియంత్రణ: వెల్లడి పద్ధతిని సిట్రిక్ ఎక్స్ట్రాక్ట్ తో సీడు చికిత్స చేయడం, బొర్డో మిశ్రమం, రోగ రహితమైన సీడ్లను ఉపయోగించడం. ఆల్టర్నేరియా లీఫ్ స్పాట్: లేదా పక్షికించు నిమిషాలు లేదా స్టెమ్ లెషన్లు. నియంత్రణ: ఆరోగ్యశాల సీడ్లు, కాపర్ ఆక్సీక్లోరైడ్ స్ప్రేలు, ముల్లువార్త నియంత్రణ, ముల్లువార్త స్ప్రేలు. గ్రైన్ మోల్డ్ కొత్తింట హాని: రంగులు మారిన పరుపుగాన్ని, తగ్గిన పంట ప్రామాణికంగా చేస్తుంది. నియంత్రణ: వర్షాల అవధుల్లో తీవ్ర పరిస్థితులను తప్పించడానికి, సమయంలో వేయడం, ఫంగిసైడ్ స్ప్రేలు, సీడ్ చికిత్స. ఏర్గోట్: సమాధానం: యంత్రిక సీడ్ క్లీనింగ్, ఫంగిసైడ్ స్ప్రేలు (బెన్లేట్, ప్రొపికోనజోల్), స్యానిటేషన్. ప్రాణిపక్షులు: అఫిడ్లు: లేదా ఆలించిన వ్యాధిలు, పెద్ద వృద్ధి, బుర్రపు మొదలు. నిర్వాహణ: సహిష్ణుల రకాలను, చిట్కాలు వారికి, నీమ్ ఆయిల్ లేదా సోప్ స్ప్రేలు, డైమెథోటేట్. పేంటెడ్ బగ్: లేదా తేలిక కారణంగా ఒక అంశం, ఒక అంశం నాశనం. నిర్వాహణ: గాదు ఖోల్పించడం, ముందస్తు విత్తనానికి, నీటిని, త్వరగా అంచనా చేయడం, క్విక్ థ్రెషింగ్, డైమెథోటేట్ స్ప్రేలు. సావ్ఫ్లై: పేరుకులుని కంటి ముచ్చట్లు, తీవ్రంగా కురిపించడం. నిర్వాహణ: గ్రీష్మంలో ఖోల్పించడం, ముందస్తు విత్తనానికి, స్వచ్ఛ వ్యవస్థలు, కాకర గిన్నె ఎర్ర తెగులు నీటిని అడ్డుకొని క్వినాల్ఫోస్ స్ప్రేలు.

# soyabean_inter_cultivation_key
source: Weeding: Remove weeds manually or with tools to prevent competition for nutrients and space. Mulching: Cover the soil around soybean plants with organic materials to suppress weeds and conserve moisture. Inter-row Cultivation: Loosen the soil between rows to enhance root development, improve water infiltration, and reduce weed growth. Thinning: Remove excess soybean plants to provide adequate spacing for optimal growth and yield. Intercropping: Plant compatible crops between soybean rows to maximize land use and diversify farm output. Companion Planting: Grow companion plants alongside soybeans to enhance soil fertility, attract beneficial insects, and repel pests. Crop Rotation: Rotate soybeans with different crops in subsequent seasons to break pest and disease cycles and maintain soil health.
hi: वीडिंग: पोषक तत्वों और अंतर्निहित जल के लिए प्रतिस्पर्धा रोकने के लिए हस्तप्रयोग या उपकरणों का उपयोग करें। मलचिंग: सोयाबीन पौधों के चारों ओर जैविक सामग्री लगाएं ताकि खाद्य की उत्पत्ति कम हो और नमी संरक्षित रहे। इंटर-रो पेशेवरी: पंक्तियों के बीच मिट्टी को ढीला करें ताकि जड़ विकास, जल प्रवाह को सुधारने और खाद्य की उत्पत्ति को कम करने में मदद मिले। गाढ़ा करना: अधिक सोयाबीन पौधों को हटा दें ताकि उन्हें आवश्यक स्थान प्रदान किया जा सके और श्रेणीबद्धता और उत्पादकता के लिए। इंटरक्रॉपिंग: सोयाबीन की पंक्तियों के बीच अनुकूल फसलों को लगाने के लिए कृषि भूमि का उपयोग करें ताकि भूमि का उपयोग और फसल का उत्पादन विविधता से बढ़ाया जा सके। सहकारी विकास: सोयाबीन के साथ सहकारी पौधों को बढ़ाने के लिए मिट्टी की उपजाऊता को बढ़ाने, लाभकारी कीटों को आकर्षित करने, और कीटों को दूर करने के लिए सहायक होते हैं। फसल चक्र: समाप्ति दिवसों के बाद अगले सीजनों में सोयाबीन को विभिन्न फसलों के साथ फिर से बोने ताकि कीट और रोग चक्रों को ब्रेक किया जा सके और मिट्टी का स्वास्थ्य बनाए रखने के लिए।
te: ముల్లువార్త: ముల్లువార్తను పోషకాల మరియు స్థలం కోసం పోటీది నియంత్రించడం కోసం సాధారణంగా సంగతించవచ్చు. మల్చింగ్: సోయాబీన్ మొక్కల సర్దుబాటు మీద నిలబడే భూమిని ఆహ్లాదకరంగా మరియు నీటి సేకరణను తగ్గించడానికి సామర్ధ్యపరచండి. అంతర్-వార్ ఉగ్రవార్తన: వార్తల మధ్య భూమిని బాహ్య నిండినట్లున్నప్పుడు మీకు బహుళ వ్యవస్థను అందించడం మరియు ముల్లువార్తను తగ్గించడానికి భూమి మధ్య నొక్కినట్లున్నప్పుడు ఉపయోగించండి. తక్కువుగా ముల్లువార్తన: ఆదరణా పోరును కోసం యొక్క కారణాలను తగ్గించడానికి సరిపోయిన సోయాబీన్ మొక్కలను తీసుకోవడం.

# soyabean_harvesting_key
source: September - October
hi: सितंबर - अक्टूबर
te: సెప్టెంబర్ - అక్టోబర్

# soyabean_post_harvesting_key
source: Harvesting: Pick soybeans when they're dry but not yet shedding from the pod. Drying: Dry harvested beans until they're less than 13% moisture to prevent spoilage. Threshing: Separate beans from pods using a thresher or by hand. Cleaning: Remove any debris or damaged beans from the harvest. Grading: Sort beans by size and quality to meet market standards. Storage: Store cleaned beans in dry, well-ventilated containers to keep them fresh. Packaging: Put beans in sealed bags or containers with proper labeling. Transportation: Handle beans carefully during transport to prevent damage.
hi: विवेक की ज़रूरत: सोयाबीन को उस समय तक चुनें जब वह सूखे हुए हों, लेकिन फ़सल से अभी गिरने नहीं लगे हों। सुखाना: संकरित बीज को खराब होने से बचाने के लिए सूखाएँ ताकि उनका नमी सतह 13% से कम हो। अलग करना: बीजों को बेलने या हाथ से खोड़ने के द्वारा पौधों से अलग करें। साफ़ करना: फसल से किसी भी कचरा या बिगड़े हुए बीजों को हटाएं। ग्रेडिंग: बीजों को आकार और गुणवत्ता के अनुसार स्तर बाँटें ताकि बाजारी मानकों को पूरा किया जा सके। स्टोरेज: साफ़ किए गए बीजों को सुखे, अच्छे वायुयुक्त पेयदानों में स्टोर करें ताकि वे ताजगी बनाए रखें। पैकेजिंग: उचित प्रतीकों के साथ सील की गई बैग या पेयदानों में बीज रखें। परिवहन: बीज को परिवहन के दौरान सावधानीपूर्वक हैंडल करें ताकि किसी नुकसान से बचा जा सके।
te: హార్వెస్టింగ్: సోయాబీన్ సాగుచేయడం తరువాత, రెండు లేదా మూడు నెలలు చిరునామక చుక్కలు గల్లాను తొలగించడం లభ్యమవుతుంది. ముందస్తు స్టెర్లైజేషన్ లలో, సోయాబీన్ గల్లాలు అన్ని పెద్దదునుండి, అతి మంచి హైడ్రోసైడ్ బాథ్ లో 130-140 డిగ్రీలు తాపము లో 30 నుండి 40 నిమిషాలు విధానాన్ని పాటుగా ఉపయోగించండి. హైడ్రోసైడ్ బాథ్ మీద సోయాబీన్ గల్లాలు ఒక గంట నానానికి మించి మొక్కలకు చిన్న అంశాన్ని అందిస్తాయి. పరిశోధన: సోయాబీన్ చిరునామక చుక్కలు పూర్తిగా సేకరించి తర్వాత గల్లాలు అందుబాటులో సామర్థ్యపరచడానికి క్షేమం లభ్యమవుతుంది. నీటి పరిశోధన చేసి తర్వాత ఆక్సిజన్ లాగ్నింగ్ ను నిల్వ చేసి చిరునామక చుక్కలు సేకరించండి. చిరునామక చుక్కలు ఆక్సిజన్ లాగ్నింగ్ ను నిల్వ చేసి పూర్తిగా శుద్ధి చేసే నుండి సోయాబీన్ గల్లాలను అన్ని రకాల రకల కింద ఉంచుకోండి.

# wheat_soil_type_key
source: Loamy Soil
hi: लूमी मिट्टी
te: గొధమ మణము

# wheat_seed_rate_key
source: 50 kg/acre
hi: 50 किलो/एकड़
te: 50 కిలో/ఎకరం

# wheat_seed_treatment_key
source: Seed treatment with Carboxin (75 WP @ 2.5 gm/kg seed) or Carbendazim (50 WP @ 2.5 gm/kg seed) or Tebuconazole (2DS @ 1.25 gm/kg seed) or a combination of a reduced dosage of Carboxin (75 WP @ 1.25 gm/kg seed) and a bioagent fungus Trichoderma viride (@ 4 gm/kg seed) is recommended.
hi: बीज संवारण के साथ कार्बोक्सिन (75 WP @ 2.5 ग्राम/किलो बीज) या कार्बेंडाजिम (50 WP @ 2.5 ग्राम/किलो बीज) या टेबुकोनाजोल (2DS @ 1.25 ग्राम/किलो बीज) या कार्बोक्सिन (75 WP @ 1.25 ग्राम/किलो बीज) और बायोएजेंट कवक ट्रिकोडर्मा विरिडे (@ 4 ग्राम/किलो बीज) का संयोजन किया जा सकता है।
te: బీజ చికిత్స: కార్బాక్సిన్ (75 WP @ 2.5 గ్రాములు/కిలో బీజం) లేదా కార్బెండాజిమ్ (50 WP @ 2.5 గ్రాములు/కిలో బీజం) లేదా టెబుకొనాజోల్ (2DS @ 1.25 గ్రాములు/కిలో బీజం) లేదా బీజం కి పట్టికలో ప్రమాణంలో తగినంతవరకు కార్బాక్సిన్ (75 WP @ 1.25 గ్రాములు/కిలో బీజం) మరియు బైయోఏజెంట్ కవక్ ట్రికోడెర్మా విరిడే (@ 4 గ్రాములు/కిలో బీజం) మిశ్రమాన్ని సూచించబడినవి.

# wheat_growing_season_key
source: November - December
hi: नवंबर - दिसंबर
te: నవంబర - డిసెంబర్

# wheat_crop_duration_key
source: 120-150 days
hi: 120-150 दिन
te: 120-150 రోజులు

# wheat_irrigation_schedule_key
source: Pre-sowing: Ensure adequate soil moisture for seed germination. Pre-irrigation may be necessary in dry soil conditions. Initial growth stage (tillering): Irrigate every 10-15 days to support early growth and tiller development. Jointing to booting stage: Maintain soil moisture with irrigation every 10-12 days. Heading to maturity: Irrigate every 10-14 days, adjusting based on weather and soil moisture conditions. Reduce irrigation: Reduce irrigation frequency during grain filling to avoid lodging and promote grain development.
hi: पूर्व-बोना: बीज अंकुरण के लिए मिट्टी में पर्याप्त नमी का सुनिश्चित करें। यदि मिट्टी की नमी कम है, तो पूर्व-बोना की आवश्यकता हो सकती है।
te: ముందుకు-బోనా: బీజం అంకురించడానికి భూమిలో సాధారణ నిలువును నిర్ధారించండి. భూమిలో నిలువు తక్కువునప్పటికీ ముందుకు-బోనా అవసరం ఉండవచ్చు.

# wheat_nutrient_requirement_key
source: Nitrogen (N): 80-100 kg Phosphorus (P): 40-50 kg Potassium (K): 30-40 kg
hi: नाइट्रोजन (एन): 80-100 किलो फॉस्फोरस (पी): 40-50 किलो पोटासियम (के): 30-40 किलो
te: నిట్రోజన్ (N): 80-100 కిలోలు ఫాస్ఫరస్ (P): 40-50 కిలోలు పొటాషియం (K): 30-40 కిలోలు

# wheat_weed_management_key
source: Cultural Practices: Crop rotation, proper seedbed preparation, and optimal planting density help suppress weeds in wheat fields. Mechanical Control: Hand weeding, inter-row cultivation, and shallow tillage can effectively manage weeds in wheat crops. Chemical Control: Pre-emergence herbicides: Pendimethalin, Metribuzin, and Clodinafop-propargyl are commonly used pre-emergence herbicides for weed control in wheat. Post-emergence herbicides: Post-emergence herbicides like 2,4-D, Metsulfuron-methyl, and Bromoxynil are used to control emerged weeds in wheat fields.
hi: सांस्कृतिक प्रथाओं: अनुकूल खेती के लिए फसल क्रम, उचित बीजबाटी तैयारी, और सही रोपण घनत्व में खाद्य वनस्पतियों को दबावभंग करने में मदद करती है। मैकेनिकल नियंत्रण: हाथ से खाद्य निकासी, अंतर-पंक्ति खेती, और हल्का खेती गेहूं की खेती में खाद्य वनस्पतियों का प्रबंधन करने के लिए प्रभावी उपाय हो सकते हैं। रासायनिक नियंत्रण: पूर्व-उत्पन्न हर्बिसाइड: पेंडिमेथालिन, मेट्रिब्यूज़िन, और क्लोडिनाफोप-प्रोपर्जीन हर्बिसाइड गेहूं में खाद्य वनस्पतियों को नियंत्रित करने के लिए सामान्य रूप से उपयोग किए जाते हैं। पोस्ट-उत्पन्न हर्बिसाइड: 2,4-डी, मेथासुल्फोन-मेथाइल, और ब्रोमोक्सिनिल जैसे पोस्ट-उत्पन्न हर्बिसाइड गेहूं की उगाई हुई वनस्पतियों को नियंत्रित करने के लिए प्रयोग किए जाते हैं।
te: సాంస్కృతిక పద్దతులు: ఫస్లు రోటేషన్, సరిపోయిన బీజగాడు తయారీ, మరియు సరిపోయిన రోలరు గానుక నిర్వహించుటకు విధించండి.
