Repository: villageboy09/cs
Catalog: lib/l10n/app_*.arb
Languages: hi, te

# maize_irrigation_schedule_key
source: Irrigation Schedule: - Pre-sowing: Ensure sufficient soil moisture for germination. Pre-sowing irrigation may be necessary if soil moisture is low. - Seedling establishment (1-3 weeks): Irrigate every 7-10 days to establish seedlings. Provide moderate irrigation to maintain soil moisture. - Plant growth (4-8 weeks): Irrigation will be needed every 10-12 days based on soil moisture and rainfall. Provide adequate water to support root growth. - Critical growth stages (plant growth, flowering): Maintain sensitive soil moisture during these stages. Irrigate every 10-15 days or as needed. - Late growth stages (from pod development to maturity): Gradually reduce irrigation as the crop matures. Avoid excessive watering during pod development to prevent fungal diseases.
hi: सिंचाई की अनुसूची: - पूर्व बोना: अंकुरण के लिए प्राचुर्य मिट्टी की नमी सुनिश्चित करें। यदि मिट्टी की नमी कम है, तो पूर्व बोना सिंचाई आवश्यक हो सकती है। - बीजलिंग स्थापना (1-3 सप्ताह): अंकुरण स्थापित करने के लिए हर 7-10 दिनों में सिंचाई करें। मिट्टी की नमी को बनाए रखने के लिए मध्यम सिंचाई प्रदान करें। - पौधा विकास (4-8 सप्ताह): मिट्टी की नमी और वर्षा के आधार पर प्रति 10-12 दिनों में सिंचाई की आवश्यकता होगी। जड़ की वृद्धि को समर्थन करने के लिए पर्याप्त पानी प्रदान करें। - महत्वपूर्ण विकास चरण (पौधा विकास, पुष्पांजलि): इन चरणों के दौरान संवेदनशील मिट्टी की नमी को बनाए रखें। प्रत्येक 10-15 दिनों में सिंचाई करें या जैसे आवश्यक हो। - धीरे से बढ़ने वाले चरण (फली विकास से परिपक्वता तक): पौधे परिपक्व होने पर सिंचाई की अनुमति दें। फंगल बीमारियों को रोकने के लिए फली विकास के दौरान अतिरिक्त पानी न दें।
te: ఇరిగేషన్ షెడ్యూల్: - ముందుకు చివరి: మొక్కల మొదటి క్రింద పరిస్థితి కొనసాగితే మొక్కలు అడ్డంగా విరిగిపోతాయి. మొదట చివరి ఇరిగేషన్ అవసరమవుతుంది అయితే ముందుకు చివరి ముందుకు చేయవచ్చు. - పురుగుల స్థాపన (1-3 వారాలు): పురుగులను స్థాపించడానికి ప్రతి 7-10 రోజులు ఇరిగేట్ చేయవచ్చు. మధ్యస్థితి ఇరిగేషన్ అందించడానికి సరిచూసుకోండి. - మొక్కల వృద్ధి (4-8 వారాలు): మొక్కల వృద్ధికి కారణంగా భూమి నిలువుగా ఉండాలి, ఇది ఆకుపచ్చలను సహాయంగా ప్రోత్సహించడానికి ప్రతి 10-12 రోజుల తర్వాత ఇరిగేషన్ అవసరం. రూట్ వృద్ధిని మద్దిగా పొందడానికి సరిపోవాలి. - క్రిటికల్ వృద్ధి దశలు (మొక్కల వృద్ధి, పుష్పీకరణ): ఈ దశలలో మహత్వపైన భూమి నిలువుగా ఉండాలి. అవసరమైన బాగాన్ని స్థిరంగా ఉంచడానికి ప్రతి 10-15 రోజులు ఇరిగేట్ చేయవచ్చు లేదా అవసరమైనా చేయవచ్చు. - తామరపు వృద్ధి దశలు (పాడ్ అభివృద్ధి నుండి పూర్తయినపుడు): మొక్కలు పూర్తయినపుడు ఇరిగేషన్ చిన్నదిగా తగ్గించాలి. పాడు అభివృద్ధి సమయంలో మీదవ్రి నీటిని తగ్గించకూడదు మరియు క్రిటికల్ వృద్ధి స్థాయిలులో అధిక నీటిని తగ్గించకూడదు.

# maize_nutrient_requirement_key
source: Nutrient Requirement: - Nitrogen (N): 40-60 kilograms - Phosphorus (P): 20-30 kilograms - Potassium (K): 20-30 kilograms
hi: पोषक आवश्यकता: - नाइट्रोजन (N): 40-60 किलोग्राम - फॉस्फोरस (P): 20-30 किलोग्राम - पोटैशियम (K): 20-30 किलोग्राम
te: పోషణ అవసరాలు: - నాయిట్రజన్ (N): 40-60 కిలోలు - ఫాస్ఫోరస్ (P): 20-30 కిలోలు - పొటాషియం (K): 20-30 కిలోలు

# maize_weed_management_key
source: Weed Management: - Cultural practices: Crop rotation, proper bed preparation, and appropriate planting density help suppress weeds in maize fields. - Mechanical control: Hand weeding, inter-row cultivation, and shallow tillage can be effective in managing weeds. - Chemical control: - Pre-emergence herbicides: Pendimethalin, Metribuzin, and Trifluralin are commonly used to control weeds in maize fields. - Post-emergence herbicides: Imazethapyr, Bentazon, and Metsulfuron-methyl are used to control emerged weeds in maize fields.
hi: खरपतवार प्रबंधन: - सांस्कृतिक प्रथाओं: फसल चक्र, उचित बिस्तर तैयारी, और उचित रोड़ा अंतर, छिद्रनाशक प्रयोग करने से चने के खेतों में खरपतवार को दबाने में मदद मिलती है। - यांत्रिक नियंत्रण: हाथ से खरपतवार निकालना, अंतर-पंक्तिवार खेती, और हल्की खेती खरपतवार प्रबंधन में प्रभावी हो सकती है। - रासायनिक नियंत्रण: - पूर्व अंकुरण वास्तुक: चने के खेतों में खरपतवार को नियंत्रित करने के लिए पेंडिमेथालिन, मेट्रिबुजिन, और ट्रिफ्लुरालिन का उपयोग किया जाता है। - उत्तराधिकारी वास्तुक: चने के खेतों में प्रकट होने वाले खरपतवार को नियंत्रित करने के लिए इमाजेथापायर, बेंटाज़ॉन, और मेटसल्फुरॉन-मिथाइल का उपयोग किया जाता है।
te: వీడ్ మేనేజ్మెంట్: - సాంస్కృతిక పద్ధతులు: మినహాయిస్తున్న వీడ్లను అడగండి, సరిపోతుంది రౌండ్ స్పేసింగ్, సరియుగా రైతును తొలగించండి లేదా యోగ్యమైన నాటికాలను ప్రయత్నించండి. - యాంత్రిక నియంత్రణం: హాండ్ వీడింగ్, ఇంటర్-రో కల్టివేషన్, మరియు సన్నివేశాలు వీడిని నియంత్రించడానికి వాడుకలు అనుకూలం. - రసాయన నియంత్రణం: - ప్రీ-ఎమర్జెన్స్ హెర్బిసైడులు: పెండిమెతలిన్, మెట్రిబ్యుజిన్, మరియు ట్రిఫ్లురలిన్ చిక్కుడి వీడిలలో వీడిని నియంత్రించడానికి ఉపయోగిస్తారు. - పోస్ట్-ఎమర్జెన్స్ హెర్బిసైడులు: ఇమాజెథాపైర్, బెంటాజాన్, మేట్సల్ఫురాన్-మెటిల్ చిక్కుడి వీడిలలో వీడిని నియంత్రించడానికి ఉపయోగిస్తారు.

# maize_disease_and_pest_management_key
source: Disease and Pest Management: - Diseases: - White Rust (White Rust/Downy Mildew) - Symptoms: White pustules, swelling of stems. Treat seeds, use sprays, select healthy seeds, control weeds, and practice crop rotation. - Alternaria Leaf Spot - Symptoms: Brown spots, leaf drop. Use sprays, select healthy seeds, and practice crop rotation. - Grain Mould - Symptoms: Discolored grains, reduced yield. Avoid moisture for long periods, timely harvesting, and use fungicide sprays. - Ergot - Symptoms: Black grains, honeydew excretion. Clean seeds mechanically, use fungicide sprays (e.g., Benlate, Propiconazole), and ensure proper field sanitation. - Pests: - Aphids - Symptoms: Honeydew on leaves, yellowing, and drying. Use tolerant varieties, aphid traps, apply neem oil, and consider using dimethoate sprays. - Pod Borers - Symptoms: Larvae infested in pods, causing damage to seeds. Regularly monitor fields, handpick affected pods, and consider neem oil sprays. - Pod Sucking Bugs - Symptoms: Drying, shriveling. Early sowing, irrigation, rapid germination, and dimethoate sprays are helpful. - Wireworms - Symptoms: Round holes, drying. Dig in summers, early sowing, irrigation, and apply Karela oil sprays. - Whiteflies - Symptoms: Whiteflies feed on leaves, causing yellowing and drying. Use yellow sticky traps, neem oil sprays, and maintain good crop hygiene.
hi: रोग और कीट प्रबंधन: - रोग: - सफेद जंग (सफेद जंग/डाउनी माइल्ड्यू) - लक्षण: सफेद पुस्तुल, तनों का फूलना। बीजों का उपचार करें, स्प्रे का उपयोग करें, स्वस्थ बीजों का चयन करें, खरपतवार को नियंत्रित करें, और फसल क्रमांकन का अभ्यास करें। - अल्टर्नेरिया पत्ती स्पॉट - लक्षण: भूरे दाग, पत्तियों का गिरना। स्प्रे का उपयोग करें, स्वस्थ बीजों का चयन करें, और फसल क्रमांकन का अभ्यास करें। - अनाज का कवच - लक्षण: वर्णित अनाज, कम उत्पादन। लंबे समय तक नमी से बचें, समय पर कटाई करें, और फंगीसाइड स्प्रे का उपयोग करें। - एर्गोट - लक्षण: काले अनाज, मधुर शोषण। मैकेनिकली साफ बीजों का उपयोग करें, फंगीसाइड स्प्रे का उपयोग करें (जैसे, बेनलेट, प्रोपिकोनाजोल), और उचित क्षेत्र सफाई सुनिश्चित करें। - कीट: - एफिड - लक्षण: पत्तियों पर मधुमेह, पीलापन, और सुखावट। टॉलरेंट प्रजातियों, एफिड झालर, नीम तेल लगाएं, और डाइमेथोएट स्प्रे का उपयोग करें। - पॉड बोरर्स - लक्षण: पॉड में लार्वे निवासी, बीजों को क्षति पहुंचाना। फील्ड की नियमित निगरानी करें, प्रभावित पॉडों को हाथ से निकालें, और नीम तेल स्प्रे का विचार करें। - पॉड सकिंग बग्स - लक्षण: सुखावट, श्रिवेलिंग। पहले की बुआई, सिंचाई, तेज अंकुरण, और डाइमेथोएट स्प्रे उपयोगी हैं। - वायरवॉर्म्स - लक्षण: गोल होल, सुखावट। गर्मियों में खोदना, पहले की बुआई, सिंचाई, और करेला तेल स्प्रे का उपयोग करें। - सफेद मक्खियाँ - लक्षण: पत्तियों पर सफेद मक्खियाँ, पीलापन, और सुखावट। पीली चिपचिपी झील, नीम तेल स्प्रे का उपयोग, और अच्छे फसल स्वच्छता का पालन करें।
te: రోగాలు మరియు ప్రాణిక నియంత్రణం: - రోగాలు: - వైట్ రస్ట్ (వైట్ రస్ట్ / డౌనీ మైల్డ్యూ) - లక్షణాలు: వైట్ పస్చిమం, స్థానీయ వర్గాలు సాగిపోతున్నాయి. బీజాలను చికిత్సించండి, స్ప్రేలు చేయండి, ఆరోగ్యమైన బీజాలను ఎంచుకోండి, వీడిని నియంత్రించండి, మరియు పరిపాలనను అమలు చేయండి. - అల్టర్నేరియా లీఫ్ స్పాట్ - లక్షణాలు: బ్రౌన్ స్పాట్లు, ఆకు తలుపు. స్ప్రేలు చేయండి, ఆరోగ్యమైన బీజాలను ఎంచుకోండి, మరియు పరిపాలనను అమలు చేయండి. - గ్రైన్ మోల్డ్ - లక్షణాలు: రంగుల దాగులు, తగ్గింపు పంటులు. దీర్ఘకాలం ఆకుల కొవ్వు కలుపుకోలేదు, సమయంలో పంట మొగ్గులు తీసుకోండి, స్ప్రేలు వినియోగించండి (ఉదా. బెన్లేట్, ప్రోపికోనాజోల్), మరియు ఫీల్డ్ స్యానిటేషన్‌ను ఖచ్చితంగా ఉంచండి. - ఎర్గాట్ - లక్షణాలు: బ్లాక్ దానాలు, హనీడ్యూ ఎగ్జ్క్రెషన్. మెకానికలీ తీసుకోండి మీకానికలీ, స్ప్రేలు వినియోగించండి (ఉదా. బెన్లేట్, ప్రోపికోనాజోల్), మరియు ఫీల్డ్ స్యానిటేషన్‌ను ఖచ్చితంగా ఉంచండి. - ప్రాణికులు: - ఆఫిడ్స్ - లక్షణాలు: ఆకులలో తేనె పిండం, పచ్చికేవాళ్ళు, ముడివడి. సహిష్ణుల రకాలను ఉపయోగించండి, ఆఫిడ్ ట్రాప్స్, నీమ్ ఆయిల్ వినియోగించండి, డైమెథోట్ స్ప్రేలు చేయండి. - పాడ్ బోరర్స్ - లక్షణాలు: పాడులలో లార్వాలు, వీడికి హానిని కలిగిస్తాయి. ఫీల్డ్లను నియంత్రించడానికి నియమించండి, పాడులను అనుకూలంగా పిక్ చేయండి, నీమ్ ఆయిల్ స్ప్రేలు అనువదించండి. - పాడ్ సక్కింగ్ బగ్స్ - లక్షణాలు: డ్రైంగ్, నురిగిపోవుట. ముందుకు చివరి ముందుకు ముందుకు చేయడానికి నియమించండి, పాడులను సర్వే చేయండి, నీమ్ ఆయిల్ స్ప్రేలు అనువదించండి.

# maize_inter_cultivation_key
source: Intercultivation: - Weed control: Regular weeding is essential to prevent competition for nutrients and sunlight. Manual weeding or light tillage can be used to control weeds. - Intercropping: Intercropping with compatible crops like maize, sorghum, or pigeon pea can help utilize land more efficiently and increase soil fertility. - Mulching: Applying mulch helps conserve soil moisture, suppress weed growth, and maintain soil temperature, encouraging better development of black and green gram crops. - Crop rotation: Rotating black and green grams with non-leguminous crops can break disease cycles and reduce pest and disease pressure on soil health. - Fertilization: Proper fertilization with balanced nutrients is essential for maximum growth. Application of compost or farmyard manure can replenish soil fertility.
hi: अंतरकृषि: - खरपतवार नियंत्रण: पोषक तत्वों और सूर्य की किरणों के लिए प्रतिस्पर्धा रोकने के लिए नियमित खरपतवार आवश्यक है। खरपतवार को नियंत्रित करने के लिए मैन्युअल खरपतवार या हल्की खेती का उपयोग किया जा सकता है। - अंतरकल्पना: अंतरकल्पना मक्का, ज्वार, या तूर दाल जैसी संगत फसलों के साथ किया जा सकता है, जो भूमि का अधिक समझने में मदद कर सकता है और मिट्टी की उर्वरता बढ़ा सकता है। - मल्चिंग: मल्चिंग वृद्धि और फसल की प्रदर्शन को बढ़ाने के लिए मिट्टी की नमी को बनाए रखने में मदद कर सकता है।
te: అంతర వ్యవస్థ: - కీటనాశనం నియంత్రణ: పోషణశాస్త్రాలు మరియు సూర్యుడి కిరణాలకు స్పర్ధాత్మకంగా తడిస్తున్నట్లను నిలిపివేయడానికి నియమిత కీటనాశనం అత్యవసరం. కీటనాశనాన్ని నియంత్రించడానికి మాన్యువల్ కీటనాశనం లేదా సౌలభ్య కీటనాశనం ఉపయోగించవచ్చు. - అంతర వ్యవస్థ: అంతర వ్యవస్థ మొక్కలను విత్తించే విధంగా మొక్కలతో వినియోగించవచ్చు, మొక్కలు భూమిని అధిక అర్థంలో తీసుకున్నట్లుగా అనుమానించడం మరియు మణువు పరిపరించే ప్రభావం ఉంటుంది. - మల్చింగ్: మల్చింగ్ భూమి నిమ్మి పోగొట్టడం మరియు ఫస్లు పెరుగుతున్నట్లుగా పరిమాణం నిలిపివేయడానికి సహాయపడగలదు.

# maize_harvesting_key
source: February - March
hi: कटाई: - कटाई का समय: चना की कटाई को 120 दिनों के बाद किया जाना चाहिए। - कटाई का तरीका: दो पंक्तियों में दराज कटाई का उपयोग करें। फसल को धीरे से काटें ताकि पौधों को क्षति न हो।
te: కట్టడం: - కట్టడం సమయం: సన్నాహం నాణ్యతల తర్వాత చనా విధానం 120 రోజుల తర్వాత చేయాలి. - కట్టడం పద్ధతి: రెండు రెండు వర్గాలలో దొరికిన దరాల కట్టడం చేయండి. మొక్కలను కష్టపరుస్తుగా కట్టండి మొక్కలు గాయం కాకుండా ఉండాలి.

# maize_post_harvesting_key
source: After harvesting: Pods are opened to dry the beans inside, preventing them from spoiling. Drying: Dry harvested crops to less than 13% moisture to prevent spoilage. Threshing: Separate beans from the pods either manually or using a thresher. Cleaning: Remove any damaged or defective beans from the crop to ensure quality. Grading: Grade beans based on size and quality to meet market standards and preferences. Storage: Store dried beans in well-ventilated containers to maintain freshness and prevent pest development. Packing: Pack beans in sealed bags or containers for preservation, with proper labeling. Transportation: Handle beans carefully during transportation to maintain quality and prevent damage.
hi: भंडारण: - स्थान: बीजों को एक ठंडे, सूखे, और जल के साथ सुरक्षित स्थान पर स्टोर करें। - पैकेजिंग: सभी बीजों को पैकेजिंग में बंधक बैग्स में बंधें ताकि बीजों को नुकसान से बचाया जा सके। - समय: बीजों को जल्द से जल्द खरीदने की आवश्यकता होती है और उन्हें अच्छे खास पैकेजिंग में बंधें ताकि उनकी गुणवत्ता पर कोई असर न हो।
te: భండారణ: - స్థలం: బీజాలను చలికగా, ఉల్లిపినిగా, మరియు నీటితో భద్రంగా ఉంచండి. - ప్యాకేజింగ్: అన్ని బీజాలను ప్యాకేజింగ్ బ్యాగ్‌లలో ముడిచండి వేసి, బీజాలను క్షేమంగా ఉంచించాలి. - సమయం: బీజాలను త్వరగా తీసుకోవడానికి అవసరం ఉండదు మరియు వేలుగా తీసుకోవడానికి అదనపు ప్యాకేజింగ్ వలన అవి మీరున్నతను మరియు గుణమును కాపాడుకోవడం అత్యంత అవసరము.

# mustard_soil_type_key
source: Sandy Loam Soil
hi: सैंडी लोम मिट्टी
te: స్యాండీ లోమ్ మణ్ణు

# mustard_seed_rate_key
source: 1.6 to 2 kg/acre
hi: 1.6 से 2 किलोग्राम प्रति एकड़
te: 1.6 నుండి 2 కిలోల ప్రతి ఏకరా

# mustard_seed_treatment_key
source: Treat the seeds according to the disease incidence in your region. In areas where stem rot is more prevalent, the seeds should be treated with Carbendazim @ 2g/1kg seed. Seed treatment with imidacloprid 70 WS @ 5g/kg of seed provides good control to painted bugs up to 30-35 DAS.
hi: बीमारी का दृष्टिकोण क्षेत्र के अनुसार बीजों का उपचार करें। जहां पौधे की डंठल अधिक प्रचलित है, वहां बीजों का उपचार कारबेंडाजिम @ 2 ग्राम/1 किलोग्राम बीज से किया जाना चाहिए। बीजों का इमिडाक्लोप्रिड 70 WS @ 5 ग्राम/किलोग्राम बीज से उपचार करने से 30-35 DAS तक रंगीन कीटों को अच्छा नियंत्रण मिलता है।
te: మీ ప్రాంతంలో రోగం ప్రసారం పూర్తిగా ఉండడానికి బీజాలను చికిత్సించండి. అంటే స్టెం రాట్ ఎక్కువగా జరిగే ప్రాంతాల్లో, బీజాలను కార్బెండజిమ్ @ 2g/1kg బీజుతో చికిత్సించాలి. బీజ చికిత్స: బీజాలను ఇమిడాక్లోప్రిడ్ 70 WS @ 5g/kg బీజుతో చికిత్సించినప్పుడు పైంటెడ్ బగ్లపై 30-35 DAS వరకు కంట్రోల్ అద్దు ఇస్తుంది.

# mustard_growing_season_key
source: October - November
hi: अक्टूबर - नवंबर
te: అక్టోబర్ - నవంబర్

# mustard_crop_duration_key
source: 100-120 days
hi: 100-120 दिन
te: 100-120 రోజులు

# mustard_irrigation_schedule_key
source: Pre-sowing: Ensure soil moisture is adequate for germination. Pre-irrigation may be required if soil moisture is low. Germination to Seedling Establishment (1-3 weeks): Irrigate every 7-10 days to support seedling establishment. Apply moderate irrigation to maintain soil moisture. Vegetative Growth (4-8 weeks): Increase irrigation frequency to every 10-12 days, depending on soil moisture and rainfall. Provide sufficient water for vigorous vegetative growth. Critical Growth Stages (Vegetative Growth, Flowering): Maintain consistent soil moisture during these stages. Irrigate every 10-15 days or as needed. Late Growth Stage (Pod Development to Maturity): Gradually reduce irrigation frequency as the crop matures. Avoid overwatering during pod development to prevent fungal diseases.
hi: पूर्व-बोना: अंकुरण के लिए मृदा की नमी पर्याप्त हो। अगर मृदा की नमी कम है, तो पूर्व-बोना की जरूरत हो सकती है। अंकुरण से पौधे स्थापित होने तक (1-3 सप्ताह): प्रत्येक 7-10 दिनों में सिंचाई करें ताकि पौधे की स्थापना को सहारा मिले। मृदा की नमी बनाए रखने के लिए मध्यम सिंचाई करें। वनस्पतिक वृद्धि (4-8 सप्ताह): मृदा की नमी और वर्षा के आधार पर हर 10-12 दिनों में सिंचाई की अधिकता बढ़ाएं। प्रबल वनस्पतिक वृद्धि के लिए पर्याप्त पानी प्रदान करें। नाभिकीय विकास चरण (वनस्पतिक वृद्धि, फूलन): इन चरणों के दौरान सतत मृदा की नमी बनाए रखें। प्रत्येक 10-15 दिनों में या आवश्यकतानुसार सिंचाई करें। देर से वृद्धि चरण (फलित विकास से परिपूर्णता तक): परिपक्वता के समय सिंचाई की अधिकता को धीरे-धीरे कम करें। फंगल बीमारियों को रोकने के लिए फलित विकास के दौरान अधिक सिंचाई से बचें।
te: పూర్వ-బోణించడం: అంకురణకు భూమి నిరుపించడానికి భూమి నిలువును సాక్ష్యపడండి. భూమి నిలువు తక్కువవాగి ఉంటే, అయితే పూర్వ-బోణించడం అవసరమవుతుంది. అంకురణ నుండి పౌదు పెరుగుతున్నప్పుడు (1-3 వారాలు): పౌదు స్థిరీకరణకు మద్దతు కోసం ప్రతి 7-10 రోజులలో నీటి చేయండి. భూమి నిలువును నిర్వహించడానికి మధ్యస్థ నీటిని విధించండి. పంట వృద్ధి (4-8 వారాలు): భూమి నిలువును మరియు వర్షాల ప్రకారం ప్రతి 10-12 రోజులలో నీటిని అధికంగా నీటిని నీరజనుగా ప్రదానం చేయండి. ప్రబల ప్లాంట్ వృద్ధికోసం సాకండి. క్రిటికల్ వృద్ధి హెచ్చరికలు (వనస్పతిక వృద్ధి, పుష్పీకరణ): ఈ దశలలో సమన్న భూమి నిలువును నిర్వహించండి. ప్రతి 10-15 రోజులలో నీటిని లేదా అవసరం అనుకుంటే నీటిని ప్రదానం చేయండి. టడుపు వృద్ధి దశాలు (పొడ్ అభివృద్ధి నుండి పరిపక్వత వరకు): మందగా నీటిని ప్రతినితులు కాలేదుబాటు చేయండి. ఫంగల్ రోగాలను తట్టుకోవడానికి పొడ్ అభివృద్ధి పరిస్థితులలో పాలించవచ్చు.

# mustard_nutrient_requirement_key
source: Nitrogen (N): 20-30 kg Phosphorus (P): 30-40 kg Potassium (K): 20-30 kg
hi: नाइट्रोजन (एन): 20-30 किलोग्राम फॉस्फोरस (पी): 30-40 किलोग्राम पोटैशियम (के): 20-30 किलोग्राम
te: నైట్రజన్ (ఎన్): 20-30 కిలో ఫాస్ఫరస్ (పి): 30-40 కిలో పొటాషియం (కే): 20-30 కిలో

# mustard_weed_management_key
source: Cultural Practices: Proper seedbed preparation, crop rotation, and timely weeding help manage weeds in mustard fields. Mechanical Control: Hand weeding, inter-row cultivation, and shallow tillage can effectively manage weeds in mustard crops. Chemical Control: Pre-emergence herbicides: Pendimethalin, Metribuzin, and Fluchloralin are commonly used pre-emergence herbicides for weed control in mustard. Post-emergence herbicides: Post-emergence herbicides like 2,4-D, Metsulfuron-methyl, and Quizalofop-P-ethyl are used to control emerged weeds in mustard fields.
hi: सांस्कृतिक प्रथाओं: उचित बीजबेड की तैयारी, फसल चक्र, और समय पर खुरपाई मस्तर्द क्षेत्रों में खर्डी का प्रबंधन करने में मदद करती है। मैकेनिकल नियंत्रण: हाथ से खुरपाई, अंतर पंक्ति खेती, और हल्की खुरपाई समृद्ध मस्तर्द फसलों में खर्डी का प्रबंधन करने में कार्यक्षम हो सकती है। रासायनिक नियंत्रण: पूर्व-उद्भव हर्बिसाइड: पेंडिमेथालिन, मेट्रिबुजिन, और फ्लूक्लोरालिन खर्डी में खर्डी का नियंत्रण करने के लिए सामान्य रूप से उपयोग किए जाने वाले पूर्व-उद्भव हर्बिसाइड हैं। पोस्ट-उद्भव हर्बिसाइड: पोस्ट-उद्भव हर्बिसाइड जैसे कि 2,4-डी, मेटसल्फुरोन-मिथाइल, और क्विजालोफोप-पी-इथाइल को मस्तर्द खेतों में उभरे हुए खर्डी को नियंत्रित करने के लिए उपयोग किया जाता है।
te: సాంస్కృతిక పద్ధతులు: శిక్షు గొర్రెల ప్రణాళిక, మాసగాడి పరిమితి, మరియు సమయంలో గోల్లు తరచుకోవడం మస్తిష్కాలను ఖర్చుకోవడం కోసం సహాయపడుతుంది. యంత్రాల నియంత్రణ: హస్తంగా గొర్రెలను తీసుకొని, అంతర వారి కళ్ళకు, మరియు తీర్చుకోవడానికి తక్కువగా ఖాళీ కావాలి. రాసాయనిక నియంత్రణ: పూర్వ-ఉద్భవ గాడిదలు: పెండిమెతాలిన్, మెట్రిబ్యూజిన్, మరియు ఫ్లూక్లోరాలిన్ మస్తిష్కాలను నియంత్రించడానికి సాధారణంగా ఉపయోగించబడుతున్న పూర్వ-ఉద్భవ గాడిదలు ఉంటాయి. పోస్ట్-ఉద్భవ గాడిదలు: 2,4-డి, మెట్సల్ఫ్యూరాన్-మెథైల్, మరియు క్విజాలోఫోప్-పి-ఎత్యిల్ వంటి పోస్ట్-ఉద్భవ గాడిదలు వచ్చిన గొర్రెలను నియంత్రించడానికి ఉపయోగిస్తారు.

# mustard_disease_and_pest_management_key
source: Pests: Mustard Aphid Symptoms: Sap-sucking leads to leaf curling, stunted growth, and sooty mold. Yellow sticky traps can monitor populations. Soft soap or neem oil sprays are effective. Management: Use tolerant varieties, employ traps, apply neem oil or soap sprays, and consider chemical control like Dimethoate. Painted Bug Symptoms: Sap-sucking causes wilting and withering. Early sowing and irrigation can reduce damage. Quick threshing and crop burning help prevent spread. Management: Deep plowing, early sowing, irrigation, quick threshing, and Dimethoate sprays are recommended. Mustard Sawfly Symptoms: Larvae feed on leaves, causing shot holes and drying. Summer plowing, early sowing, clean cultivation, and bitter gourd seed oil sprays are effective. Management: Summer plowing, early sowing, irrigation, clean cultivation, and Quinalphos sprays are recommended. Diseases: White Rust / Downy Mildew Symptoms: White pustules on leaves, stem swelling, and distortion. Seed treatment and foliar sprays with Bordeaux mixture or copper oxychloride help manage the disease. Management: Seed treatment, foliar sprays, use of disease-free seeds, weed control, and crop rotation. Alternaria Leaf Spot Symptoms: Circular brown spots on leaves, stem lesions, and defoliation. Use of healthy seeds and foliar sprays with copper oxychloride aid in disease control. Management: Use healthy seeds, foliar sprays, and crop rotation for disease management.
hi: कीट: मस्तर्द एफिड लक्षण: रस-चूसने से पत्ती कुर्लाना, अवविकसित वृद्धि, और सूती कविता होती है। पीले चिकने झालर जनसंख्या का मॉनिटरिंग कर सकते हैं। सॉफ्ट सोप या नीम तेल स्प्रेस प्रभावी हैं। प्रबंधन: सहिष्णु प्रजातियों का उपयोग करें, फंदे का उपयोग करें, नीम तेल या साबुन स्प्रेस का उपयोग करें, और डाइमेथोएट जैसे रासायनिक नियंत्रण को ध्यान में रखें। पेंटेड बग लक्षण: रस-चूसने से पौधे का सूखना और मुरझाना होता है। जल्दी बोना और सिंचाई नुकसान को कम कर सकती है। तेज अलंकरण और फसल जलाने से प्रसार को रोकने में मदद मिलती है। प्रबंधन: गहरा खेती, जल्दी बोना, सिंचाई, तेज अलंकरण, और डाइमेथोएट स्प्रेस की सिफारिश की जाती है। मस्तर्द सॉफ्लाई लक्षण: लार्वा पत्तियों पर खाने से छेद होते हैं, जिससे छिद्र और सुखाने का कारण होता है। गर्मियों की खेती, जल्दी बोना, साफ संवालन, और कड़वा करेल के बीज तेल स्प्रेस प्रभावी होते हैं। प्रबंधन: गर्मियों की खेती, जल्दी बोना, सिंचाई, साफ संवालन, और क्विनाल्फोस स्प्रेस की सिफारिश की जाती है। रोग: सफेद जंग / डाउनी माइल्ड्यू लक्षण: पत्तियों पर सफेद दाने, डाल का स्फोट, और विकृति। बीज का उपचार और बोर्डो मिश्रण या तांबे का ऑक्सीक्लोराइड फोलियर स्प्रेस रोग प्रबंधन में मदद करते हैं। प्रबंधन: बीज का उपचार, फोलियर स्प्रेस, बीमारी मुक्त बीजों का उपयोग, खर्डी कंट्रोल, और फसल चक्र। अल्टरनेरिया पत्ती स्पॉट लक्षण: पत्तियों पर गोल भूरे दाग, डाल अंश, और पत्तियों का अपशिष्ट होना। स्वस्थ बीजों का उपयोग और कॉपर ऑक्सीक्लोराइड के सहायता से फोलियर स्प्रेस रोग प्रबंधन में मदद करते हैं। प्रबंधन: स्वस्थ बीजों का उपयोग, फोलियर स्प्रेस, और फसल चक्र के लिए बीमारी प्रबंधन।
te: ప్రాణులు: మస్టర్డ్ ఆఫిడ్ లక్షణాలు: రాసాన్ని పానుపెట్టడం ద్వారా ఆకు కర్లను, నానప్పు వృద్ధిని, మరియు కర్మిగా వస్తుంది. పిల్లల స్టిక్ థ్రాప్స్ జనాభా చూడడానికి ఉపయోగించవచ్చు. సాఫ్ సోప్ లేదా నీమ్ ఆయిల్ స్ప్రేస్ పరికారంలు ప్రభావకరం. ప్రబంధం: సహిష్ణుడు రకాలు ఉపయోగించండి, ట్రాప్లు అనువర్తించండి, నీమ్ ఆయిల్ లేదా సోప్ స్ప్రేస్ లేదా డిమెథోట్ లేదా రాసాయనిక నియంత్రణాన్ని ఆపండి. పెయింటెడ్ బగ్ లక్షణాలు: రాసాన్ని పాని తరిమికొట్టే పరిస్థితులు వల్ల, పొలము మరియు చిరునామాని కారణం సాంకేతికంగా వేసేది. బంగాళి పండుగ మరియు పంట కాల్చే త్వరగా తెరాలు మరియు సాంకేతికంగా మరియు డిమెథోట్ స్ప్రేస్ చేయడం సహాయకం. మస్టర్డ్ సాగిస్ లక్షణాలు: లార్వా ఆకులను తినేవారు, షాట్ హోల్స్ మరియు విసుకులను కారణం గురించి చెప్పుకోవడం. గ్రీన్ లోన్, మరియు మరువలు బీజాల తెల్లగా తానిక సహాయపడుతుంది. ప్రబంధం: గ్రీన్ లోన్, మరియు మరువలు బీజాల తెల్లగా తానిక, నీటి ప్రబంధం, సాఫ్ కల్టివేషన్, క్వినాల్ఫాస్ స్ప్రేస్ చేయడం సహాయకం. రోగాలు: వైట్ రస్ట్ / డౌనీ మైల్డ్యూ లక్షణాలు: ఆకులలో తెల్లని పులుసులు, స్థంభ స్ఫూర్తి, మరియు వికర్షణ. బీజ చికిత్స మరియు బోర్డో మిశ్రమ్ లేదా కాపర్ ఆక్సిక్లోరైడ్ తయారీ లేకపోతే రోగానికి నియంత్రణం చేసేందుకు ఉపయోగించండి. మనవడి ఎర్రని బొట్టు లక్షణాలు: ఆకులలో చిక్కగా మచ్చలు, స్థంభ క్షీణత, మరియు అప్పుడుకు నిలబడియున్నప్పుడు పరిపక్వత. ఆకుల మీద కావలసిన కొన్ని లేదా కాపర్ ఆక్సిక్లోరైడ్ లేక పాక్ మిశ్రమ్లను బళిపించండి. ప్రబంధం: ఆరోగ్యకరమైన బీజాలను ఉపయోగించండి, ఫాలియర్ స్ప్రేస్ మరియు రోటేషన్ పోటీ మరియు వృష్టిలోని నిర్వహణ.
