Repository: villageboy09/cs
Catalog: lib/l10n/app_*.arb
Languages: hi, te

# wheat_disease_and_pest_management_key
source: Disease Management Guidelines: Rust: Symptoms: Yellow or brown powdery pustules on leaves. Control: Spray with Propiconazole or Tebuconazole at 0.1% concentration at the initiation of rust using 200 litres of water per acre. Loose Smut: Symptoms: Ears turn into a black powdery mass. Control: Treat seeds with Carboxin, Carbendazim, or Tebuconazole. Karnal Bunt: Symptoms: Black powder on infected grains. Control: Spray Propiconazole at 0.1% concentration at 50% flowering, repeat if needed every 15 days. Powdery Mildew: Symptoms: White powdery patches on leaves and stems. Control: Spray with Propiconazole at 0.1% concentration when disease appears. Flag Smut: Symptoms: Long black streaks on leaves. Control: Follow seed treatment with Carboxin or Tebuconazole. Pests: Termites: Symptoms: Damage near sowing and maturity. Control: Treat seeds with thiamethoxam or fipronil. Aphids: Symptoms: Discolouration of leaves. Control: Foliar spray of Imidacloprid when aphid infestation exceeds economic threshold. Pink Stem Borer: Symptoms: Central shoot killed causing 'dead heart'. Control: Foliar spray of Quinalphos when pink stem borer is seen. Ear Cockle: Symptoms: Swollen base, dark-brown galls instead of grains. Control: Use the floatation technique to separate galls, destroy them, and wash seeds thoroughly before sowing.
hi: रोग प्रबंधन दिशानिर्देश: रस्ट: लक्षण: पत्तियों पर पीला या भूरा पाउडरी पुटियों का उपस्थिति। नियंत्रण: रस्ट की शुरुआत में प्रोपिकोनाज़ोल या टेबुकोनाज़ोल को 0.1% घनत्व में 200 लीटर प्रति एकड़ प्रयोग करें। ढीला बाज़ार: लक्षण: कानों में काला पाउडरी मस्से में परिणामित होता है। नियंत्रण: कार्बोक्सिन, कार्बेंडाजिम, या टेबुकोनाज़ोल के साथ बीजों का इलाज करें। कर्नल बंट: लक्षण: सियाह पाउडर अप्रभावित अनाज। नियंत्रण: 50% फूलने पर 0.1% घनत्व में प्रोपिकोनाज़ोल को स्प्रे करें, आवश्यकता अनुसार हर 15 दिन में दुहराएं। पाउडरी माइल्ड्यू: लक्षण: पत्तियों और डंडों पर सफेद पाउडरी धागे। नियंत्रण: रोग के प्रकट होने पर प्रोपिकोनाज़ोल के 0.1% घनत्व के साथ स्प्रे करें। फ्लैग स्मट: लक्षण: पत्तियों पर लंबी काली धाराएँ। नियंत्रण: कार्बोक्सिन या टेबुकोनाज़ोल के साथ बीज संवारण का पालन करें। कीट: टर्माइट्स: लक्षण: बोने और परिपक्वता के करीब हानि। नियंत्रण: बीजों को थायमेथॉक्साम या फिप्रोनिल के साथ इलाज करें। एफिड्स: लक्षण: पत्तियों का रंगीन होना। नियंत्रण: एफिड की आक्रमण सीमा को पार करने पर इमिडाक्लोप्रिड की पत्तियों पर स्प्रे करें। गुलाबी डंडा खोदकर: लक्षण: केंद्रीय डंडे का मौत। नियंत्रण: पिंक स्टेम बोरर को देखने पर क्विनाल्फोस की पत्तियों पर स्प्रे करें। इयर कॉकल: लक्षण: अनाज के बजाय काली गालियां, गुलाबी डंडे। नियंत्रण: गालों को अलग करने के लिए तैराकी तकनीक का उपयोग करें, उन्हें नष्ट करें, और बोने से पहले बीजों को धो दें।
te: రోగ నిర్వహణ మార్గసూచిలు: రస్ట్: లక్షణాలు: పత్తెలలో పిల్లి లేదా నలుపు పొడి నిలువుగా ఉంటాయి. నియంత్రణ: రస్ట్ ఆరంభంలో ప్రొపికొనాజోల్ లేదా టెబుకొనాజోల్ ను 0.1% ఘనత తో 200 లీటర్ల నీరుతో స్ప్రే చేయండి. లూజ్ స్మట్: లక్షణాలు: కాళ్ళలు నలుపు పొడి గా మారుతాయి. నియంత్రణ: బీజాలను కార్బోక్సిన్, కార్బెండాజిమ్, లేదా టెబుకొనాజోల్ తో చికిత్స చేయండి. కర్ణల్ బంట్: లక్షణాలు: అనాజంలో నలుపు పొడి. నియంత్రణ: 50% పూవుల సమయంలో ప్రొపికొనాజోల్ ను 0.1% ఘనతతో స్ప్రే చేయండి, అవసరమైతే ప్రతి 15 రోజుల్లో మళ్ళీ ప్రచురించుకోండి. పౌడరి మైల్డ్యూ: లక్షణాలు: పత్తిలో మరియు కొంచెం స్థాయిలో తెల్లని పొడి ధాగలు. నియంత్రణ: రోగం కనిపించినప్పుడు 0.1% ఘనతతో ప్రొపికొనాజోల్ ను స్ప్రే చేయండి. ఫ్లాగ్ స్మట్: లక్షణాలు: పత్తిలు మీద పొడిగా నిలబడించడం. నియంత్రణ: బీజ చికిత్స తరువాత కార్బోక్సిన్ లేదా టెబుకొనాజోల్ ను పట్టికలో స్ప్రే చేయండి. కీటాలు: టెర్మైట్స్: లక్షణాలు: బోనే మరియు పరిపక్వత సమయంలో హాని. నియంత్రణ: కార్బోక్సిన్ లేదా ఫిప్రోనిల్ తో బీజాలను చికిత్స చేయండి. ఎఫిడ్స్: లక్షణాలు: పత్తెలు రంగులోనివేయించేసినంతవి. నియంత్రణ: ఎఫిడ్ల ఆక్రమణాన్ని పొలియబడినప్పుడు ఇమిడాక్లోప్రిడ్ ను పత్తెల మీద స్ప్రే చేయండి. గలాబీ డింగ్ బోరర్: లక్షణాలు: మధ్యస్థ డింగ్ నిలబడుతుంది. నియంత్రణ: పింక్ స్టెం బోరర్ ను చూడడానికి క్వినాల్ఫోస్ ను పత్తెల మీద స్ప్రే చేయండి. ఇయర్ కోకిల్: లక్షణాలు: అనాజం ప్రతి కాలకు కాళ్ళు మరియు గలాబీ డింగ్లు. నియంత్రణ: గలాలను ప్రత్యేకించే విధానంలో గార్డన్ లో కరించండి, వాలిపై ప్రత్యేకించే విధానంలో చికిత్స చేయండి, మరియు బోనే ముందు బీజాలను నలుపుగా మార్చండి.

# wheat_harvesting_key
source: March - April
hi: मार्च - अप्रैल

# wheat_post_harvesting_key
source: Drying: Dry harvested wheat to 12% moisture or lower. Avoid direct sun drying to preserve nutrients. Cleaning: Remove chaff, straw, and weed seeds. Ensure wheat is clean for storage. Storage: Store wheat in dry, ventilated areas. Use sealed containers or silos to prevent pests. Grading: Sort wheat based on quality. Separate into different grades for market. Milling: Mill wheat to produce flour. Use modern equipment for efficiency. Packaging: Package flour in clean, labeled bags. Include production and expiry dates. Transportation: Handle wheat carefully during transport. Use appropriate vehicles and packaging. Quality Assurance: Monitor quality throughout the process. Inspect and test for safety and standards.
hi: सुखाना: 12% नमी या उससे कम तक धान को सुखाएं। पोषक तत्वों को संरक्षित करने के लिए सीधे सूरज से बचें। सफाई: छाल, तिल, और खाद्य बीजों को हटाएं। भंडारण: सूखे, हवादार क्षेत्रों में धान संग्रहित करें। कीटों को रोकने के लिए बंद बर्तन या साइलो का प्रयोग करें। ग्रेडिंग: गुणवत्ता के आधार पर गेहूं का छाँटें। बाजार के लिए विभिन्न ग्रेडों में अलग करें। चक्की: आटा बनाने के लिए गेहूं की चक्की। प्रभावकारीता के लिए आधुनिक उपकरण का उपयोग करें। पैकेजिंग: साफ, लेबल बनाएं। उत्पादन और समाप्ति तिथियों को शामिल करें। परिवहन: गेहूं को परिवहन के दौरान सावधानीपूर्वक संभालें। उपयुक्त वाहन और पैकेजिंग का प्रयोग करें। गुणवत्ता आश्वासन: प्रक्रिया के दौरान गुणवत्ता का मॉनिटरिंग। सुरक्षा और मानकों के लिए जांच और परीक्षण करें।
te: డ్రైయింగ్: 12% నీటితో లేదా అది తగ్గిన ధానాన్ని డ్రై చేయండి. పోషక గుణాలను కాపాడడానికి సింగిల్ సన్ డ్రైంగ్ చేయండి. శుద్ధీకరణం: అడిగిన పొట్ల, స్ట్రా మరియు వీటి బీజాలను తీసేయండి. భండారణ: డ్రై, వెంటిలేటెడ్ ప్రాంతాల్లో ధానాన్ని భండరించండి. కీటాలను నిరోధించడానికి సీల్డ్ కంటేనర్లు లేదా సైలోలు ఉపయోగించండి. గ్రేడింగ్: గుణముల ఆధారంగా ధానాన్ని సరిచేయండి. బజారుకు అనేక గ్రేడులలో విభజించండి. మిలింగ్: ఆటా తయారీకి ధానాన్ని మిలింగ్ చేయండి. తగ్గింపు కొనసాగడానికి ఎఫిషన్సీ కోసం స్వీట్ ఉపకరణాలను ఉపయోగించండి. ప్యాకేజింగ్: శుద్ధం, లేబుల్ చేయండి. ఉత్పత్తి మరియు అవధి తేదీలను అంటే నేర్పులు చేయండి. వహనం: వహనం ప్రాముఖ్యత తీసుకుని ధానాన్ని నడపండి. ఉపయోగించే యానాలు మరియు ప్యాకేజింగ్ కోసం సరిచేయండి. గుణము ఆధారంగా కొనసాగడానికి పరిశోధించండి. సురక్షత మరియు మానకాల కోసం పరిశోధించండి.

source: No data available
hi: कोई डेटा उपलब्ध नहीं है
te: సరఫరా కోసం డేటా అందుబాటులో లేదు

source: Title
te: శీర్షిక
