Repository: villageboy09/cs
Catalog: lib/l10n/app_*.arb
Languages: hi, te

# bajra_seed_treatment_key
source: Prevention of Gundia (Ergot Disease): Soak seeds in 20% salt solution for 5 minutes. Remove floating seeds and debris, then wash and dry remaining seeds. General Treatment: Apply 3 g of thiram per kg of seed. Termite Control: Use 3.3 ml Thiamethoxam 30 FS per kg of seed. For Alkaline and Saline Soil: Soak seeds in 1% sodium sulphate solution for 12 hours. Wash and dry seeds, then treat with fungicide before sowing for better germination.
hi: गुंडिया (एरगोट रोग) का निवारण: 20% नमक के घोल में 5 मिनट तक बीजों को भिगोएं। तैरते बीजों और कचरे को हटाएं, फिर बचे हुए बीजों को धोएं और सुखा लें। सामान्य उपचार: प्रति किलोग्राम बीज पर 3 ग्राम थिराम लगाएं। टर्माइट नियंत्रण: प्रति किलोग्राम बीज में 3.3 मिलीलीटर थायमेथोक्साम 30 एफएस का उपयोग करें। अल्कलाइन और खारी मिट्टी के लिए: 1% सोडियम सल्फेट घोल में 12 घंटे के लिए बीजों को भिगोएं। बीजों को धोकर सुखा लें, फिर बेहतर अंकुरण के लिए कवकनाशी के साथ इलाज करें।
te: గుండితం (ఏర్గోట్ రోగం) నివారణ: 20% ఉప్పు కలుపులో 5 నిమిషాలు వరికీ విత్తనాలను నిలిచి ఉండాలి. ఊడిన విత్తనాలు మరియు కచ్చితోటులను తీసి, మిగిలిన విత్తనాలను కడిగి కోసం నిలిచి పూసి, తరువాత మిగిలిన విత్తనాలను వాడుకోవాలి మరియు డ్రై చేయాలి. సాధారణ చికిత్స: కిలోలిటరు విత్తనం కోసం 3 గ్రాముల థిరామ్ వేసిన లేదా ప్రతి లీటరుకు 3 గ్రాముల పిరిథియన్ వేసిన కింద చెప్పబడింది. టెర్మైట్ నియంత్రణం: కిలోలిటరు విత్తనం కోసం 3.3 మిలిలీటర్లు థాయమెతొక్సామ్ 30 ఎఫ్ఎస్ ఉపయోగించాలి. కార్బన్ లక్స్ మరియు కార్బండాజిమ్ కలుపుల పరిస్థితులకు చెందినా, మందు విత్తనంలో 1% సోడియం సల్ఫేట్ కలుపులలో 12 గంటలు ప్రామాణిక కలుపులలో విత్తనాలను అవిగా చేయాలి. విత్తనాలను తరిగించడానికి, కొందరు తోటకుల నివాసిని ఉపయోగించి మరియు విత్తనాల యొక్క గుణకాలను మెరుగుపరచడానికి మొదటి ఆశ్రిత యంత్రం నిర్మించడానికి ఇతర ప్రక్రియలను మనము చేస్తుంటుంది.

# bajra_growing_season_key
source: June - July
hi: जून - जुलाई
te: జూన్ - జూలై

# bajra_crop_duration_key
source: 90-100 days
hi: 90-100 दिन
te: 90-100 రోజులు

# bajra_irrigation_schedule_key
source: Pre-sowing: Ensure soil moisture is adequate. Perform land preparation to facilitate water penetration. Pre-irrigation may be necessary if soil moisture is low. Germination to Seedling Establishment (1-3 weeks): Irrigate every 5-7 days to maintain soil moisture for seed germination and establishment. Apply light irrigation to prevent waterlogging. Vegetative Growth (4-8 weeks): Increase irrigation frequency to every 7-10 days, depending on rainfall and soil moisture. Apply sufficient water to support vigorous vegetative growth. Critical Growth Stages (Tillering, Flowering, Grain Filling): Maintain consistent soil moisture during these stages. Irrigate every 10-15 days or as needed to prevent moisture stress. Late Growth Stage (Maturity): Gradually reduce irrigation frequency as the crop nears maturity to facilitate drying for harvest. Avoid overwatering during this stage to prevent lodging and fungal diseases.
hi: पूर्व-बोना: मिट्टी मॉइस्चर पर्याप्त हो। पानी प्रवेश को सुविधाजनक बनाने के लिए भूमि की तैयारी करें। यदि मिट्टी मॉइस्चर कम है तो पूर्व-पानी की आवश्यकता हो सकती है। अंकुरण से सप्ताह (1-3 सप्ताह): बीज अंकुरण और स्थापना के लिए मिट्टी मॉइस्चर को बनाए रखने के लिए प्रति 5-7 दिन पानी दें। जल-लॉगिंग रोकने के लिए हल्के पानी का उपयोग करें। पौधों की वृद्धि (4-8 सप्ताह): बर्षात और मिट्टी मॉइस्चर के आधार पर प्रति 7-10 दिन पानी की आवश्यकता को बढ़ाएं। उत्तेजक वृद्धि को समर्थन करने के लिए पर्याप्त पानी दें। महत्वपूर्ण वृद्धि चरण (तिल्लीणन, फूलोट्ती, अनाज भरना): इन चरणों के दौरान सतत मिट्टी मॉइस्चर को बनाए रखें। उन्हें साइल मोइस्चर स्थिति का ध्यान रखते हुए हर 10-15 दिन में या जरूरत के हिसाब से पानी दें। धीरे वृद्धि चरण (परिपक्वता): फसल परिपक्वता के करीब आते हुए पानी की आवश्यकता को धीरे-धीरे कम करें। बूटियों और कवक रोग के लिए अधिक पानी देने से बचें।
te: ముందుమాట: మణికి మోయిస్చర్ పరిమితం ఉండాలి. మణికి ప్రవేశంను సులభముగా చేయడానికి భూమి సిద్ధం చేయాలి. మణికి మోయిస్చర్ కమివ్యూ ఉంటే, ముందు-నీటి ముక్కువుగా అవసరమైతే ఉండవచ్చు. అంకురణ (1-3 వారాలు): విత్తనాలకు మోయిస్చర్ నిర్మాణం మరియు స్థాపన కోసం 5-7 రోజుల పాటు నీటి అందించండి. నీటి లాగింగ్ నిరోధకాలను నిరోధించడానికి సౌకర్యంగా తక్కువగా నీటిని ఉపయోగించండి. మొదటి వృద్ధి (4-8 వారాలు): వారాన్నిరిగిన మణికి మోయిస్చర్ మరియు మణికి మోయిస్చర్ ఆధారంగా 7-10 రోజులకు ఒక వారికి మోయిస్చర్ అవసరమైన త్వరలోనే ఉండండి. చర్యల పొందుటను మద్దించడానికి సాధారణంగా నీటిని అందించండి. ప్రముఖ వృద్ధి దశా (కాలువ, పువ్వుల సరాసరి, అన్నం మెరిగిపోవడం): ఈ దశలు చికిత్సలను విడుదల చేయడానికి సాధారణంగా నీటిని అందించండి. ప్రతి 10-15 రోజులకు లేదా అవసరం అయ్యాలనుకుంటే మణికి మోయిస్చర్ స్థితిని పాత్రాధారంగా ఉండటం చేయండి. నిర్వాహక వృద్ధి దశ (పరిపక్వత): ఫసలు పరిపక్వతకు సమీపంగా వచ్చేటప్పుడు మనికి మోయిస్చర్ ఆవశ్యకత పెరుగుతుంది. బూటికోల్స్ మరియు రోగాలకు మీరు మంచి నీటిని ఇవ్వడం ద్వారా తొందరగా మీరు నీటిని ఇవ్వకుండా ఉంచాలి.

# bajra_nutrient_requirement_key
source: Nitrogen (N): 20-30 kg Phosphorus (P): 10-15 kg Potassium (K): 10-15 kg
hi: नाइट्रोजन (एन): 20-30 किलोग्राम फॉस्फोरस (पी): 10-15 किलोग्राम पोटैशियम (के): 10-15 किलोग्राम
te: నైట్రాజన్ (ఎన్): 20-30 కిలోలిటరు ఫాస్ఫరస్ (పి): 10-15 కిలోలిటరు పొటాషియం (కే): 10-15 కిలోలిటరు

# bajra_weed_management_key
source: Cultural Practices: Adequate soil preparation, proper row spacing, and timely planting help promote rapid crop establishment and competitiveness against weeds. Mechanical Control: Hand weeding, inter-row cultivation, and shallow hoeing are effective methods for controlling weeds in bajra fields. Chemical Control: Pre-emergence herbicides: Atrazine, Metribuzin, and Pendimethalin are commonly used pre-emergence herbicides for controlling grassy and broadleaf weeds in bajra. Post-emergence herbicides: For post-emergence weed control, herbicides like 2,4-D, Metsulfuron-methyl, and Glyphosate can be used, depending on the weed species present.
hi: सांस्कृतिक प्रथाओं: पर्याप्त मिट्टी की तैयारी, सही पंक्ति अंतर, और समय पर बोना किया होना तेजी से पौधों की स्थापना और खरपतवार से प्रतिस्पर्धा करने में मदद करते हैं। मैकेनिकल नियंत्रण: हैंड वीडिंग, इंटर-पंक्ति खेती, और शैलो तोती बार्ना बाजरा के खरपतवार को नियंत्रित करने के लिए प्रभावी तरीके हैं। रासायनिक नियंत्रण: प्री-उद्भव शाकत्रियों: बाजरा में गेंहू के और फूलदार खरपतवारों को नियंत्रित करने के लिए एट्राजीन, मेट्रिबूजिन, और पेंडिमेथेलिन आमतौर पर प्री-उद्भव शाकत्रिय होते हैं। पोस्ट-उद्भव शाकत्रियों: पोस्ट-उद्भव शाकत्रियों के लिए, उदाहरण के लिए 2,4-डी, मेटसुल्फुरॉन-मेथाइल, और ग्लाइफोसेट जैसे रासायनिक नियंत्रण उपयोग किया जा सकता है, नियंत्रित खरपतवारों के आधार पर।
te: సాంస్కృతిక విధులు: సరైన భూమి సిద్ధత, సరైన రెండింటి నియంత్రణ, మరియు సమయంలో సైన్యముగా విత్తనను తీసుకొని ప్రత్యర్థిని ప్రతిస్పర్ధించడంలో సహాయపడుతుంది. యాంత్రిక నియంత్రణ: హ్యాండ్ వీడింగ్, అంటర్-రోళ్ విత్తనం, మరియు షేలో పోటీలు బాజ్రా కాయలను నియంత్రించడానికి ప్రభావశాలి మెథడ్లు. రాసాయనిక నియంత్రణం: ప్రీ-మౌలిక శాకత్రికులు: బాజ్రాలో గోధుమ మరియు పువ్వులకు నియంత్రణానికి, ప్రీ-మౌలిక శాకత్రికులు ఆరోగ్యకరమైన ఎండోజిన్, మెట్రిబ్యుజిన్, మరియు పెండిమెతిలిన్ ఉన్నాయి. పోస్ట్-మౌలిక శాకత్రికులు: పోస్ట్-మౌలిక శాకత్రికుల కోసం, ఉదాహరణకు 2,4-డి, మెటాసల్ఫురోన్-మెథిల్, మరియు గ్లైఫోసేట్ వంటి రాసాయనిక నియంత్రణాలను ఉపయోగించవచ్చు, నియంత్రణం కింద తెలియకండి. మంచి నియంత్రణా క్రమాలు: రెండు చక్రాలను అప్పగా పోస్ట్-ఎమ్ర్జెన్సీ అన్ని సమయంలో మరియు పోస్ట్-ఇమర్జెన్సీ మాత్రమే విత్తనను కలిగి మోయిస్చర్ నిర్వహించవచ్చు. మిక్స్ కల్చరల విత్తనం చేతిమిరపకు నిర్మాణం మరియు విత్తనం పరిమిత సమయంలో విత్తనను తీసుకొని విత్తనను తెరిచిపెట్టేందుకు ఆసక్తి కలిగి ఉంటుంది.

# bajra_disease_and_pest_management_key
source: Disease Downy Mildew: Symptoms: Appearance of yellow to whitish powdery growth on the lower surface of leaves. Chemical Control: The symptoms of the disease appear, Carbendazim 50% WP or thiophenate methyl 70% WP dissolved in 2 grams per litre of water should be sprayed twice at intervals of 10 days. Ergot: Symptoms: This fungal disease affects the bajra flowers, replacing them with dark. These ergots are poisonous to humans and animals. Chemical Control: To save the crop, spray 1 kg Zineb or 0.6 to 0.8 kg Mancozeb 2-3 times at an interval of 2-3 days at the time of emergence of the head. This will reduce the outbreak. Rust: Symptoms: This fungal disease causes orange-brown pustules on leaves and stems. It can reduce yields and grain quality. Chemical Control: Spray 2Hexaconazole 75% WG26.7 g/acre to control rust in the standing crop of pearl millet, one month after sowing, keeping the nozzle between the rows 6 inches above the surface. Pests: Shoot Fly: Symptoms: Infested plants exhibit dead hearts (drying of central leaves). Chemical control: One of the following chemicals should be sprinkled by dissolving it in 200-240 Litres of water per acre. Oxydemeton-methyl 25 % EC 400 ml per acre or Imidacloprid 70 % WS 400 ml per acre. Stem Borers: Symptoms: Presence of larvae within the stem, causing wilting and stunting of plants. Chemical control: One of the following chemicals should be dissolved in 200-240 litres of water per acre and sprayed. Chlorantraniliprole 18.50 % SC 60ml/acre or Thiamethoxam 25 % WG 40g per acre or Dimethoate 30% EC 0.4 L per acre. Pest affected plants should be uprooted and destroyed in the initial stage. Spraying of NSKE (Neemshat) / 5 % at least 2 times to reduce the number of insects. Aphids: Symptoms: Colonization of aphids on the undersides of leaves, causing stunted growth and yellowing. Chemical control: Chlorantraniliprole 18.50% SC: Mix 60 ml of the product per acre with 200-240 litres of water and spray thoroughly on the crop. Thiamethoxam 25% WG: Apply 40 grams of the product per acre mixed with 200-240 litres of water and spray on the affected plants. Dimethoate 30% EC: Use 0.4 litres of the product diluted in 200-240 litres of water per acre for spraying. Armyworms: Symptoms: Presence of caterpillars feeding on leaves and stems. Chemical control: Chlorantraniliprole 18.50% SC: Mix 60ml/acre in 200-240 litres of water per acre and spray. Thiamethoxam 25% WG: Mix 40g/acre in 200-240 litres of water per acre and spray. Dimethoate 30% EC: Mix 0.4 litres/acre in 200-240 litres of water per acre and spray.
hi: रोग डाउनी माइल्ड्यू: लिविंगय विकासित पत्तियों की निचली सतह पर पीले से सफेद धूलभर प्रवृत्ति की दिखाई देती है। रासायनिक नियंत्रण: बीमारी के लक्षण दिखाई देते हैं, तो कार्बेंडेजिम 50% डब्ल्यूपी या थायोफेनेट मिथाइल 70% डब्ल्यूपी को दो ग्राम प्रति लीटर पानी में दो बार 10 दिन के अंतराल पर छिड़कें। एरगोट: लक्षण: यह फंगल बीमारी बाजरा के फूलों और अंकुरों पर होती है। रासायनिक नियंत्रण: पौधों पर परोचन धुंधला पत्ता, सफेद धूलभर अवरुद्ध, या वृक्षों के फूलों की अवरुद्धता के लक्षणों को देखकर, आपको अगर्बत्ती, सूक्ष्म, डब्ल्यूपी (1 ग्राम प्रति लीटर पानी), डीडीपी (2 ग्राम प्रति लीटर पानी), और मेटालाक्झिल 35 एमई (2 ग्राम प्रति लीटर पानी) को लागू करना चाहिए। रोगों के लिए फिटोसानीत्री या कोणीय उपायों का प्रयास करें। कीट गण्डोका: अंकुरों पर पीले या काले रंग के रोमांचकों का उत्थान। रासायनिक नियंत्रण: प्रतिक्रिया देखते हुए, पौधों के पेड़ों के तनों और पत्तियों के आसपास अगर्बत्ती, डीडीपी (1 मिलीग्राम प्रति लीटर पानी), या साइफ्लूथ्रिन (0.5 मिलीग्राम प्रति लीटर पानी) का उपयोग करें। उपचार के लिए अंगूठी बाली आदि अवश्य ध्यान में रखें।
te: పురుగులు పిళ్ళలు:అంకురాలపై పిల్లలు మరియు నిండిన రంగు మొడవు వేసిన వెల్లడి కనిపిస్తాయి.రాసాయనిక నియంత్రణ:ప్రతిక్రియ కనిపిస్తే, మొక్కల మొడవలు మరియు ఆకుల పెదలు మీద ఆంత్రప్రదీపులను, డీడీపీ (1 మిలీగ్రామ్ లిటరు నీటి కోసం), లేదా సైఫ్లూథ్రిన్ (0.5 మిలీగ్రామ్ లిటరు నీటి కోసం) వినియోగించాలి.చికిత్సకు అంగులీ బంగారు మొదలు పెట్టండి.

# bajra_harvesting_key
source: September - October
hi: फसल को अच्छी तरह से पकने के बाद हार्वेस्ट करें। पूर्णतः पके हुए बाजरे की पहचान करने के लिए उसके अंकुरों की सुनवाई करें। अधिकतम प्रदर्शित की हुई कम्बल और बाजरे के पूरी तरह से सूख जाने की संकेत देते हैं। हार्वेस्टिंग को तब करें जब बाजरा पूरी तरह से पक चुका हो।
te: ఫసలను పూర్తిగా పచ్చని నిలువు తర్వాత హార్వెస్ట్ చేయండి. సమర్పితమైన బాజ్రా కాయలను గురించి గుర్తించడానికి, అది పూర్తిగా పచ్చినట్లయిన అంకురాల మీద వేళ్లను దరిచండి. గట్టిగా గుండగలం మరియు పూర్తిగా బాజ్రా కాయలను కూడా అవగాహన చేయండి.

# bajra_post_harvesting_key
source: Drying: Bajra cobs are dried in open areas until moisture content is less than 15%. Optimal drying duration is 3-4 days for seeds to reach 15% moisture. Popcorn varieties should be dried in shade only when seed moisture is between 30-35% to prevent grain cracking. Shelling: Use a sheller to separate kernels from cobs efficiently. Ensure kernels are dried until moisture content reaches 10-12% for better storage. Packaging: Store dried Bajra kernels in clean gunny bags to maintain quality. Properly label and seal bags before storing in a designated storage area.
hi: हार्वेस्ट की हुई फसल को अच्छे से सुखा लें और अधिकतम 12% की नमी तक कम करें। बाजरे को स्टोरेज के लिए सुखे और ठंडे स्थान पर रखें।
te: హార్వెస్ట్ చేసిన ఫసలను చాలా బాగా డ్రై చేసి, మరియు అధికంగా 12% ఆకులు కనిష్టం చేయండి. బాజ్రాను స్టోరేజ్ కోసం డ్రై మరియు చల్లని స్థలాల్లో ఉంచండి.

# chilli_soil_type_key
source: Sandy Loam Soil, Loamy Soil
hi: सैंडी लोम मिट्टी, लोमी मिट्टी
te: ఇసుక మట్టి నేల, లోమీ నేల

# chilli_seed_rate_key
source: Direct Sowing: 2.5kg seeds per 1 acre TrayMethod: 70gm seeds per 1 acre TraditionalMethod: 650gm seeds per 40 sqmt nursery bed
hi: सीधा बोना: प्रति 1 एकड़ बीज 2.5 किलोग्राम ट्रे विधि: प्रति 1 एकड़ बीज 70 ग्राम पारंपरिक विधि: प्रति 40 वर्ग मीटर नर्सरी बिस्तर के लिए बीज 650 ग्राम
te: నేరుగా విత్తడం: 1 ఎకరానికి 2.5 కిలోల విత్తనాలు ట్రే పద్ధతి: 1 ఎకరానికి 70 గ్రాముల విత్తనాలు సాంప్రదాయ పద్ధతి: 40 చ.మీటర్ నర్సరీ బెడ్‌కు 650 gm విత్తనాలు

# chilli_seed_treatment_key
source: Control of sap-sucking insects can be done by treating the seed with Imidacloprid @ 8ml-10ml/kg seed before sowing. Treat the seed with Mancozeb or Carbendazim @ 3gm/kg seed before sowing to control any soil borne diseases like damping off.
hi: बोने जाने से पहले बीज को इमिडाक्लोप्रिड @ 8 मिलीलीटर-10 मिलीलीटर/किलोग्राम बीज के साथ उपचार किया जा सकता है। बीज को बोने से पहले Mancozeb या Carbendazim @ 3 ग्राम/किलोग्राम बीज के साथ उपचार करें ताकि डैम्पिंग ऑफ जैसी किसी भी मिट्टी संगठित बीमारी को नियंत्रित किया जा सके।
te: విత్తనాలను విత్తే ముందు ఇమిడాక్లోప్రిడ్ @ 8 ml-10 ml/kg విత్తనంతో శుద్ధి చేయవచ్చు. విత్తనాలను విత్తే ముందు మాంకోజెబ్ లేదా కార్బెండజిమ్ @ 3 gm/kg విత్తనంతో శుద్ధి చేయవచ్చు. నేల ద్వారా వచ్చే ఏదైనా వ్యాధి నియంత్రించవచ్చు.

# chilli_growing_season_key
source: (K) June - July (R) October - November
hi: (क) जून - जुलाई (आर) अक्टूबर - नवंबर
te: (a) జూన్ - జూలై (r) అక్టోబర్ - నవంబర్

# chilli_crop_duration_key
source: 90-120 days
hi: 90-120 दिन
te: 90-120 రోజులు

# chilli_irrigation_schedule_key
source: Pre-sowing: Ensure soil moisture is adequate for germination. Pre-irrigation may be necessary if soil moisture is low. Germination to Seedling Establishment (1-3 weeks): Irrigate every 5-7 days to support seedling establishment. Apply moderate irrigation to maintain soil moisture. Vegetative Growth (4-8 weeks): Increase irrigation frequency to every 7-10 days, depending on soil moisture and rainfall. Provide sufficient water for vigorous vegetative growth. Critical Growth Stages (Vegetative Growth, Flowering, Fruit Setting): Maintain consistent soil moisture during these stages. Irrigate every 4-5 days or as needed. Late Growth Stage (Maturity): Gradually reduce irrigation frequency as the crop matures. Avoid overwatering during maturity to prevent fruit deterioration.
hi: पूर्व बोने: अंकुरण के लिए मिट्टी की नमी पर्याप्त हो। यदि मिट्टी की नमी कम है, तो पूर्व-सिंचाई की आवश्यकता हो सकती है। अंकुरण से बीजबुनाई स्थापना (1-3 सप्ताह): हर 5-7 दिनों में सिंचाई करें ताकि बीजबुनाई स्थापना का समर्थन मिल सके। मिट्टी की नमी को बनाए रखने के लिए मध्यम सिंचाई दें। वृष्टिपातिय समय (4-8 सप्ताह): मिट्टी की नमी और वर्षा के अनुसार हर 7-10 दिन में सिंचाई की वृद्धि करें। शक्तिशाली वृष्टिपातिय वृद्धि के लिए पर्याप्त पानी प्रदान करें। महत्वपूर्ण वृद्धि चरण (वनस्पतिक वृद्धि, पुष्पण, फल सेटिंग): इन चरणों के दौरान संवेदनशील मिट्टी की नमी बनाए रखें। हर 4-5 दिनों में या आवश्यकतानुसार सिंचाई करें। धीमे वृद्धि चरण (परिपक्वता): फसल पक जाने पर सिंचाई की अधिकतम आवश्यकता को धीरे-धीरे कम करें। परिपक्वता के दौरान अधिक सिंचाई से फल क्षय होने से बचें।
te: విత్తనానికి ముందు: నేల తేమ అంకురోత్పత్తికి సరిపడా ఉండాలి. నేలలో తేమ తక్కువగా ఉంటే, ముందుగా నీటిపారుదల అవసరం కావచ్చు. మొలకలు మొలకెత్తడం (1-3 వారాలు): ప్రతి 5-7 ప్రతి కొన్ని రోజులకు ఒకసారి నీరు త్రాగుట నేల తేమను నిర్వహించడానికి మితమైన నీటిపారుదలని అందించండి. వర్షాకాలం (4-8 వారాలు): నేల తేమ మరియు వర్షపాతం ప్రకారం నీటిపారుదలని పెంచండి. క్లిష్టమైన ఎదుగుదల దశలు. ఏపుగా పెరగడం, పుష్పించేది, పండ్ల అమరిక: ప్రతి 4-5 రోజులకు లేదా అవసరమైన విధంగా సున్నితమైన నేల తేమను నిర్వహించండి (పరిపక్వత): పంట పరిపక్వత సమయంలో అధిక నీటిపారుదలని నివారించండి.

# chilli_nutrient_requirement_key
source: Nitrogen (N): 80-100 kg Phosphorus (P): 40-50 kg Potassium (K): 40-50 kg
hi: नाइट्रोजन (एन): 80-100 किलोग्राम फॉस्फोरस (पी): 40-50 किलोग्राम पोटैशियम (के): 40-50 किलोग्राम
te: నైట్రోజన్ (N): 80-100 kg భాస్వరం (P): 40-50 kg పొటాషియం (K): 40-50 kg

# chilli_weed_management_key
source: Cultural Practices: Proper seedbed preparation, mulching, and timely weeding help manage weeds in chilli fields. Mechanical Control: Hand weeding, inter-row cultivation, and mulching with plastic or organic materials are effective methods for weed control in chilli crops. Chemical Control: Pre-emergence herbicides: Pendimethalin, Metribuzin, and Oxyfluorfen are commonly used pre-emergence herbicides for weed control in chilli. Post-emergence herbicides: Post-emergence herbicides like Glyphosate, Bentazon, and Paraquat are used to control emerged weeds in chilli fields.
hi: सांस्कृतिक प्रथाएं: उचित बीजबेड तैयारी, मल्चिंग, और समय पर खाद्य फसल में खरपतवारों का प्रबंधन करने में मदद करती हैं। मैकेनिकल नियंत्रण: हाथ से खरपतवार निकालना, इंटर-रो पेड़ों का खेती करना, और प्लास्टिक या कार्बनिक सामग्री के साथ मल्चिंग, खरपतवारों को नियंत्रित करने के लिए प्रभावी उपाय हैं। रसायनिक नियंत्रण: पूर्व-उत्पन्न उद्भिदनाशक: खरपतवारों को नियंत्रित करने के लिए आमतौर पर उपयोग किए जाने वाले पूर्व-उत्पन्न उद्भिदनाशक हैं: Pendimethalin, Metribuzin, और Oxyfluorfen। पोस्ट-उत्पन्न उद्भिदनाशक: पोस्ट-उत्पन्न उद्भिदनाशक जैसे कि Glyphosate, Bentazon, और Paraquat का उपयोग बाजरे के खरपतवारों को नियंत्रित करने के लिए किया जाता है।
te: సాంస్కృతిక పద్ధతులు: సరైన సీడ్‌బెడ్ తయారీ, మల్చింగ్ మరియు సకాలంలో కలుపు తీయడం ఆహార పంటలలో కలుపు మొక్కలను నిర్వహించడంలో సహాయపడుతుంది. యాంత్రిక నియంత్రణ: చేతితో కలుపు తీయడం, అంతర్ వరుస చెట్లను పెంచడం మరియు పదార్థాలతో ప్లాస్టిక్ లేదా సేంద్రీయ మల్చింగ్ కలుపు మొక్కలను నియంత్రించడానికి సమర్థవంతమైన చర్యలు. . రసాయన నియంత్రణ: ప్రీ-ఎమర్జెంట్ హెర్బిసైడ్‌లు: కలుపు మొక్కలను నియంత్రించడానికి సాధారణంగా ఉపయోగించే ప్రీ-ఎమర్జెంట్ హెర్బిసైడ్‌లు: పెండిమెథాలిన్, మెట్రిబుజిన్ మరియు ఆక్సిఫ్లోర్ఫెన్ పోస్ట్-ఎమర్జెన్స్ హెర్బిసైడ్‌లు: గ్లైఫోసేట్ మరియు పారా-ఎమర్జెన్స్ హెర్బిసైడ్‌లు. మిల్లెట్‌లో కలుపు మొక్కలను నియంత్రించండి.
