Repository: villageboy09/cs
Catalog: lib/l10n/app_*.arb
Languages: hi, te

# grams_inter_cultivation_key
source: Weed control: Regular weeding is essential to prevent competition for nutrients and sunlight. Manual weeding or light tillage can be used to control weeds. - Intercropping: Intercropping with compatible crops like maize, sorghum, or pigeon pea can help utilize land more efficiently and increase soil fertility. - Mulching: Applying mulch helps conserve soil moisture, suppress weed growth, and maintain soil temperature, encouraging better development of black and green gram crops. - Crop rotation: Rotating black and green grams with non-leguminous crops can break disease cycles and reduce pest and disease pressure on soil health. - Fertilization: Proper fertilization with balanced nutrients is essential for maximum growth. Application of compost or farmyard manure can replenish soil fertility.
hi: खरपतवार नियंत्रण: पोषक तत्वों और सूर्य की किरणों के लिए प्रतिस्पर्धा रोकने के लिए नियमित खरपतवार अत्यंत आवश्यक है। खरपतवारों को नियंत्रित करने के लिए हाथ से खरपतवार निकालना या हल्की खेती का प्रयोग किया जा सकता है। - अंतरफसली: मक्का, ज्वार, या अरहर जैसी संगत फसलों के साथ अंतरफसली बिजाई जा सकती है, जो भूमि का उपयोग अधिक करने और मृदा की उर्वरता को बढ़ाने में मदद कर सकती है। - मल्चिंग: मल्च लगाने से मृदा की नमी को संरक्षित करने, खरपतवार वृद्धि को दबाने और मृदा के तापमान को बनाए रखने में मदद मिलती है, इस प्रकार के काले और हरे चनों के बेहतर विकास को प्रोत्साहित करती है। - फसल चक्र: गैर-दलहनी फसलों के साथ काले और हरे चनों का चक्र लगाने से रोग चक्र को तोड़ा जा सकता है और कीट और रोग दबाव को कम करके मृदा स्वास्थ्य में सुधार किया जा सकता है। - पोषण: संतुलित पोषण के साथ उचित खाद का प्रयोग अधिकतम विकास के लिए आवश्यक है। कॉम्पोस्ट या फार्मयार्ड मैन्यूर के आवेदन से मृदा की उर्वरता को संपूर्ण किया जा सकता है।
te: పోషక_మూలాలు_మరియు_సూర్యుడి_కిరణాలకు_సంఘర్షాన్ని_తడుటుకోవడానికి_నియమిత_ఖరపతి_అత్యంత_ముఖ్యం. -పోషక తత్వాల మరియు సూర్యుడి కిరణాలకు సంఘర్షాన్ని తడుటుకోవడానికి నియమిత ఖరపతి అత్యంత ముఖ్యం. ఖరపతిలను నియంత్రించడానికి మనుషుల ద్వారా ఖరపతిని తీసుకోవడం లేదా మెరుగుపెంపు పరిశోధన చేయడం వంటి లేదా నిమ్మది కృషిని వాడవచ్చు. -_అంతర్గత_ఫస్లు -మక్కా, జొన్నలు, లేక తొలి మరియు తొలి దానిలో అంతర్గత ఫస్లు వేయబడవచ్చు, దేనిని భూమి ఉపయోగించి మరియు భూమి నియంత్రించడానికి సహాయపడవచ్చు. -_మల్చింగ్ -మల్చింగ్ చేయడం ద్వారా భూమి నీటిని సంరక్షించడం, కలుపు వృద్ధిని నియంత్రించడం మరియు భూమి గరిష్టతను కలుపులతో పొందడం మరియు కాలుల మరియు పచ్చి గ్రాముల మెరుగును ప్రోత్సహించడంతో మద్దతు కలుగుతుంది. -_ఫసల_చక్ర: గేటాలకు ప్రత్యేక ధరణి తో చక్రాలను రోటేషన్ చేయడం వలన రోగ చక్రాన్ని తోడువుతుంది మరియు ప్రాణిని మరియు రోగ ఒత్తిడిని తగ్గించడంతో భూమి ఆరోగ్యాన్ని మెరుగు చేయడంలో సహాయపడుతుంది. -పోషణ: అత్యధిక అభివృద్ధికి సరిహద్దు పోషణతో కావాలి. కంపోస్ట్ లేదా ఫార్మ్ యార్డ్ మేన్యూర్ అనువర్తించడం ద్వారా భూమి ఉర్వరతను పూర్తిగా పెంచవచ్చు.

# grams_harvesting_key
source: February - March
hi: फरवरी - मार्च
te: మొక్కను ఆపండి: మొక్కను పూర్తిగా పెంచిన మీద మొక్కను ఆపండి. మొక్కను గోధుమలు నలుగురాయించడానికి మొక్కను బరువుతో ఒకటి గోధుమను నలుగురాయించడానికి ఉండాలి.

# grams_post_harvesting_key
source: Pods are opened to dry the beans inside, preventing them from spoiling. Drying: Dry harvested crops to less than 13% moisture to prevent spoilage. Threshing: Separate beans from the pods either manually or using a thresher. Cleaning: Remove any damaged or defective beans from the crop to ensure quality. Grading: Grade beans based on size and quality to meet market standards and preferences. Storage: Store dried beans in well-ventilated containers to maintain freshness and prevent pest development. Packing: Pack beans in sealed bags or containers for preservation, with proper labeling. Transportation: Handle beans carefully during transportation to maintain quality and prevent damage.
hi: फलों को उन्हें सूखने के लिए खोला जाता है, ताकि वे टूटने से बच सकें। शुष्क करना: कटी हुई फसल को 13% से कम नमी के साथ सूखा दें, गलने से बचने के लिए। अलग करना: बीन्स को खाद्यान्न को अलग करें, या हाथ से या एक थ्रेसर का उपयोग करके। साफ़ करना: फसल से किसी भी धब्बे या क्षतिग्रस्त बीन्स को हटा दें, गुणवत्ता सुनिश्चित करने के लिए। ग्रेडिंग: आकार और गुणवत्ता के आधार पर बीन्स को ग्रेडिंग करें, बाजारी मानकों और पसंदों को पूरा करने के लिए। स्टोरेज: धूप में सूखे हुए बीन्स को ठीक से वेंटिलेटेड डिब्बों में स्टोर करें, ताजगी बनाए रखने और कीटाणु विकास को रोकने के लिए। पैकेजिंग: पुष्टिकरण के लिए सीलदार थैलों या डिब्बों में बीन्स पैक करें, अच्छे लेबलिंग के साथ। परिवहन: गुणवत्ता को बनाए रखने और क्षति को रोकने के लिए परिवहन के दौरान सावधानीपूर्वक बीन्स का नियंत्रण करें।
te: విత్తన నిర్వహణ: మొక్కను తొలగించడానికి మరియు విత్తనను నిర్వహణ చేయడానికి చేయండి. విత్తనం చదవడానికి కాలం కూడా చాలా ముఖ్యం.

# jowar_disease_and_pest_management_key
source: Shootfly: Symptoms: The larva eats the stem of the plant, the first plant is blown back (dead heart). Technical control: Control planting time to change the path. Increase the seed rate efficiently and remove the dead heart seedlings. Chemical control: Seed treatment with Furadan or Imidacloprid. Spray with Methyl Demeton or Neem Seed Kernel Extract. Stem Borer: Symptoms: Larvae eat their food on the stem, take the shape of a dead heart after the stem is swollen and kill the insect. Technical control: Print in Furadan or Furadan van. Use Carbophuran granules or Metasystox spray. Shootbug: Symptoms: Leaves dry out and the worm dies. Chemical control: Spray with Phosphamidon or Dimethoate. Aphids: Symptoms: Green leaves, small creature production. Chemical control: Spray with Metasystox or Dimethoate. Treat seeds with Imidacloprid or Thiamethoxam. Earhead midge: Symptoms: Red flowers in the ears, start of ears. Management: Spray lightly on flowering and milk. Mites: Symptoms: Webbing on leaves, the leaf ends with red. Management: Spray with Dimethoate or Dicofol. Grainmold damage: Symptoms: Colored grains, gain in it. Technical control: Avoid rain-prone areas, maintain values for timely cutting and drying. Chemical control: Spray with Aureofungin or Captan. Ergot: Symptoms: Black colors with sweet hand. Control: Soak the seeds in salt solution, spray with Benlate or Propiconazole. Plant rot: Symptoms: Drying on the grains, stem grows with day. Management: Spray with Mancozeb during flowering, growth and maturity stage. Leaf spot: Symptoms: Leaf diseases due to rains and humid conditions. Management: Spray with Mancozeb or Mancozeb without the need for covers.
hi: शूटफ्लाई: लक्षण: लार्वा पौधे की तना को खाता है, पहला पौधा पीछे उड़ जाता है (मृत हृदय). तकनीकी नियंत्रण: मार्ग को बदलने के लिए बुवाई समय को नियंत्रित करें। बीज दर को कुशलतापूर्वक बढ़ाएं और मृत हृदय बीजलिंगों को हटा दें। रासायनिक नियंत्रण: फुरादान या इमिडाक्लोप्रिड के साथ बीज उपचार। मिथिल डेमेटन या नीम बीज कर्नल निष्पादन के साथ स्प्रे करें। स्टेम बोरर: लक्षण: लार्वा तना पर अपना भोजन खाता है, तना सूजने के बाद मृत हृदय की आकृति लेता है और कीट को मार देता है। तकनीकी नियंत्रण: फुरादान या फुरादान वैन में मुद्रित करें। कार्बोफ्यूरान ग्रैन्यूल्स या मेटासिस्टॉक्स स्प्रे का उपयोग करें। शूटबग: लक्षण: पत्तियां सूख जाती हैं और कीट मर जाता है। रासायनिक नियंत्रण: फॉस्फामिडोन या डाइमेथोएट के साथ स्प्रे करें। एफिड्स: लक्षण: हरी पत्तियां, छोटे प्राणी उत्पादन। रासायनिक नियंत्रण: मेटासिस्टॉक्स या डाइमेथोएट के साथ स्प्रे करें। बीजों को इमिडाक्लोप्रिड या थायमेथोक्साम के साथ उपचार करें। ईरहेड मिड्ज: लक्षण: कानों में लाल फूल, कानों की शुरुआत। प्रबंधन: फूलने और दूध पर हल्के से स्प्रे करें। माइट्स: लक्षण: पत्तियों पर वेबिंग, पत्ती लाल हो जाती है। प्रबंधन: डाइमेथोएट या डाइकोफोल के साथ स्प्रे करें। ग्रेनमोल्ड क्षति: लक्षण: रंगीन अनाज, इसमें लाभ। तकनीकी नियंत्रण: वर्षा प्रवृत्ति क्षेत्रों से बचें, समय पर कटाई और सुखाने के लिए मान बनाए रखें। रासायनिक नियंत्रण: औरियोफंगिन या कैप्टन के साथ स्प्रे करें। एरगोट: लक्षण: मिठाई हाथ के साथ काले रंग। नियंत्रण: बीजों को नमकीन विलयन में डुबोएं, बेनलेट या प्रोपिकोनाजोल के साथ स्प्रे करें। प्लांट रॉट: लक्षण: अनाज पर सुखाना, दिन के साथ तना बढ़ता है। प्रबंधन: पुष्पण, विकास और परिपक्वता चरण में मैनकोजेब के साथ स्प्रे करें। पत्ती दाग: लक्षण: वर्षा और आर्द्र परिस्थितियों के कारण पत्ती रोग। प्रबंधन: मैनकोजेब या मैनकोजेब के साथ स्प्रे करें, बिना कवर की आवश्यकता हो।
te: షూట్ఫ్లై: లక్షణాలు: మొక్క యొక్క మెదడును తినిపిస్తుంది, మొదటి మొక్క వెనుకకు వేడిగా ఎండబెట్టించుకుంటుంది (డెడ్ హార్ట్). సాంకేతిక నియంత్రణ: సంచికను ఎటువంటి పట్టుకు మార్పు చేయడానికి ప్లాంటింగ్ టైమ్ నియంత్రించడం. సామర్థ్యవంతంగా సీడ్ రేటును పెరుగుతుంచండి మరియు డెడ్ హార్ట్ సీడ్లింగ్లను తీసుకోండి. రసాయనిక నియంత్రణ: ఫ్యూరాడాన్ లేదా ఇమిడాక్లోప్రిడ్ తో సీడ్ ట్రీట్‌మెంట్. మెతిల్ డెమెటాన్ లేదా నీమ్ సీడ్ కర్నెల్ ఎక్స్ట్రాక్ట్ తో స్ప్రే. స్టెం బోరర్: లక్షణాలు: లార్వాలు వారి పరిపు పైన తినిపిస్తాయి, చెర ఆకారాలు తీసుకున్నట్టుగా డెడ్ హార్ట్ పైన కొంగితం తరవాత మరియు మృతాన్ని ఉంచుకున్నట్లు ఉంటుంది. సాంకేతిక నియంత్రణ: తీరాన్ లేదా ఫ్యురాడాన్ వ్హాన్ లో ప్రింట్ చేయండి. కార్బోఫ్యూరాన్ గ్రాన్యూల్స్ లేదా మెటాసైస్టాక్స్ స్ప్రే ఉపయోగించండి. షూట్బగ్: లక్షణాలు: ఆకులు తల్లిబడిపోతాయి మరియు క్రిమి మరణం జరిగిపోతుంది. రసాయనిక నియంత్రణ: ఫాస్ఫోమిడాన్ లేదా డిమెథోయట్ తో స్ప్రే. ఆఫిడ్స్: లక్షణాలు: పచ్చగా ఉన్న ఆకులు, చిన్న జీవి ఉత్పత్తి. రసాయనిక నియంత్రణ: మెటాసైస్టోక్స్ లేదా డిమెథోయట్ తో స్ప్రే. సీడ్లను ఇమిడాక్లోప్రిడ్ లేదా థియామెథోక్సామ్ తో మార్చుకోండి. ఇయర్ హెడ్ మిడ్జ్: లక్షణాలు: గారిలులో ఎరుపు పువ్వులు, గారిలు ఆరంభం చేయడం. నిర్వాహణ: ఫ్లవరింగ్ మరియు పాలు మేద చిన్నగా స్ప్రే చేయండి. మైట్స్: లక్షణాలు: ఆకుల మీద వెబ్బింగ్, ఆకు ఎరుపుతో చివరిస్తుంది. నిర్వాహణ: డిమెథోయేట్ లేదా డికోఫాల్ తో స్ప్రే. గ్రెయిన్మోల్డ్ డామేజీ: లక్షణాలు: రంగులు మారినవి, దానికి దాగిన కాయ లాభం. సాంకేతిక నియంత్రణ: వర్షాల ప్రాంతాలను తప్పక తిరిగి ఎండుకున్నట్లు, సమయంలో కట్టడానికి మరియు డ్రైంగ్ చేయడానికి విలువలు ఉంచండి. రసాయనిక నియంత్రణ: ఆరెఫ్యూన్ లేదా కాప్టాన్ తో స్ప్రే చేయండి. ఎర్గోట్: లక్షణాలు: మధుర చేతితో బ్లాక్ రంగులు. నియంత్రణ: సాల్ట్ సాల్యూషన్‌లో విత్తనాలను కడిగి, బెన్లేట్ లేదా ప్రొపికోనజోల్ తో స్ప్రే చేయండి. ప్లాంట్ రోట్: లక్షణాలు: గ్రేన్ల పై నల్లి లేదా రోజు సుక్కింపుతో నల్లి పెరుగుతుంది. నిర్వాహణ: ఫ్లవరింగ్, మెరుగు మరియు పరిపక్వత స్థాయిల్లో మంకోజెబ్ స్ప్రే చేయండి. లీఫ్ స్పాట్: లక్షణాలు: వర్షాలు మరియు ఆద్రత యొక్క ఆకుల మరియు పరిస్థితుల వల్ల ఆకు వ్యాధులు. నిర్వాహణ: కావాళ్ళను అవసరం కాకుండా మంకోజెబ్ లేదా మాన్‌కోజెబ్ స్ప్రే చేయండి.

# jowar_soil_type_key
source: sandy loam soil, loamy soil.
hi: रेती दोमट मिट्टी, दोमट मिट्टी।
te: సాండీ లోమ్ మణ్ణం, లోమీ మణ్ణం.

# jowar_seed_rate_key
source: 3.6-4 kilos/acre
hi: 3.6-4 किलो/एकड़
te: 3.6-4 కిలోలు/ఎకరం

# jowar_seed_treatment_key
source: Treat the seed with Thiomethaxam @ 3 g/kg of seed and Thiram or Captan @ 3 g/kg of seed.
hi: बीज को Thiomethaxam @ 3 g/kg बीज और Thiram या Captan @ 3 g/kg बीज के साथ उपचार करें।
te: మొక్కను Thiomethaxam @ 3 g/kg మొక్కతో మార్చుకోండి మరియు Thiram లేదా Captan @ 3 g/kg మొక్కతో మార్చుకోండి.

# jowar_growing_season_key
source: (k) June - July (re) November - December
hi: (क) जून - जुलाई (रे) नवम्बर - दिसम्बर
te: (క) జూన్ - జులై (రె) నవంబర్ - డిసెంబర్

# jowar_crop_duration_key
source: 100-120 days
hi: 100-120 दिन
te: 100-120 రోజులు

# jowar_irrigation_schedule_key
source: First, ensure soil moisture with good water from the pre-soaked time. Pre-irrigation may be necessary if moisture is not visible. From the beginning of the pests to the pests (1-3 weeks): To feed the crop, water every 7-10 days without prejudice to the water. The right water should be provided to keep the soil moisture. Vegetative growth (4-8 weeks): More water is needed every 10-12 days, for the right vegetative growth to keep the soil moisture. Critical growth stages (tillering, flowering): Keep the soil moisture evenly during these events. Every 10-15 days or if necessary for irrigation. Late growth stage (maturity): When the crop matures fully, reduce the irrigation frequency actively. Do not moisten the crop a little for crop uptake.
hi: सबसे पहले, पूरी तरह भिगोने के समय से अच्छा पानी देकर मिट्टी की आर्द्रता सुनिश्चित करें। यदि आर्द्रता दिखाई नहीं देती है, तो पूर्व-सिंचाई आवश्यक हो सकती है। कीटों की शुरुआत से कीटों तक (1-3 सप्ताह): फसल को पोषण देने के लिए, हर 7-10 दिन पानी दें, बिना पानी की हानि के। मिट्टी की आर्द्रता को बनाए रखने के लिए सही पानी प्रदान किया जाना चाहिए। वनस्पतिक विकास (4-8 सप्ताह): हर 10-12 दिन अधिक पानी की आवश्यकता होती है, मिट्टी की आर्द्रता को बनाए रखने के लिए सही वनस्पतिक विकास। महत्वपूर्ण विकास चरण (टिलरिंग, फूलना): इन घटनाओं के दौरान मिट्टी की आर्द्रता को समान रूप से बनाए रखें। हर 10-15 दिन या यदि आवश्यक हो तो सिंचाई के लिए। देरी से विकास चरण (परिपक्वता): जब फसल पूरी तरह पक जाती है, तो सक्रिय रूप से सिंचाई की आवृत्ति को कम करें। फसल को थोड़ा सा नम न करें फसल के उत्पादन के लिए।
te: ముందుగా సొరగించిన వేళ ఉత్తమమైన నీటితో భూమి ఆర్ద్రతను ఖాతరీ చేయండి. ఆర్ద్రత కనిపించకుండా ప్రీ-ఇరిగేషన్ అవసరమైతే ఉండవచ్చు. పురుగులతో ప్రారంభం నుండి పురుగులను అందించే వరకు (1-3 వారాలు): మొక్కను అందించడానికి ప్రతి 7-10 రోజులకు నీటితో ప్రీతి నిలువాకుండా నీరుపెట్టండి. భూమి ఆర్ద్రతను నిలిచాలనే కాలుకి సరైన నీరు అందించాలి. వెజిటేటివ్ గ్రోత్ (4-8 వారాలు): ప్రతి 10-12 రోజులకు అధికంగా నీటి అవసరం ఉంచండి, భూమి ఆర్ద్రతను నిలిచిన సరైన వెజిటేటివ్ గ్రోత్ కోసం. క్రిటికల్ గ్రోత్ స్టేజెస్ (టిలరింగ్, ఫ్లవరింగ్): ఈ ఘటనల సమయంలో సమానంగా భూమి ఆర్ద్రతను నిలిపి ఉంచండి. ప్రతి 10-15 రోజులకు లేదా అవసరమైతే ఇరిగేషన్ చేయడానికి. లేట్ గ్రోత్ స్టేజె (పరిపక్వత): మొక్క పరిపక్వత పూర్తిగా నిలబడుతున్నప్పుడు ఇరిగేషన్ ఫ్రిక్వెన్సీని క్రియాశీలంగా తగ్గించండి. మొక్కను కొద్దిగా ఆర్ద్రం చేయకండి మొక్క అధిగమనానికి.

# jowar_nutrient_requirement_key
source: Nitrogen (N): 40-60 kilos Phosphorus (P): 20-30 kilos Potassium (K): 20-30 kilos
hi: नाइट्रोजन (N): 40-60 किलो फॉस्फोरस (P): 20-30 किलो पोटाशियम (K): 20-30 किलो
te: నైట్రజన్ (ఎన్): 40-60 కిలోలు ఫాస్ఫోరస్ (పి): 20-30 కిలోలు పొటాషియం (కే): 20-30 కిలోలు

# jowar_weed_management_key
source: Weed management: General weed management, proper row spacing, timely weed removal helps in weed management in jowar sowing. Mechanical control: Hand weeding, inter-row hoeing, rotary hoeing are adequately used in weed control in jowar sowing. Chemical controls: Pre-emergence herbicides: Atrazine, metribuzin, and pendimethalin pre-emergence herbicides are used to control weeds in jowar sowing. Post-emergence herbicides: 2,4-D, metsulfuron-methyl, and glyphosate are used in post-emergence weed control.
hi: खरपतवार प्रबंधन: सामान्य खरपतवार प्रबंधन, उचित पंक्ति अंतर, समय पर खरपतवार हटाने से जोवार बोने में खरपतवार प्रबंधन में मदद मिलती है। मैकेनिकल नियंत्रण: हाथ से खरपतवार हटाना, पंक्तियों के बीच हल चलाना, रोटरी होइंग जोवार बोने में खरपतवार नियंत्रण में पर्याप्त रूप से उपयोग किया जाता है। रासायनिक नियंत्रण: प्राग-उद्भव हर्बीसाइड: एट्राज़ीन, मेट्रीबुज़ीन, और पेंडिमेथालिन प्राग-उद्भव हर्बीसाइड जोवार बोने में खरपतवार को नियंत्रित करने के लिए उपयोग किया जाता है। पश्चात-उद्भव हर्बीसाइड: 2,4-D, मेटसल्फुरॉन-मिथिल, और ग्लाइफोसेट पश्चात-उद्भव खरपतवार नियंत्रण में उपयोग किया जाता है।
te: వనరుల నిర్వహణ: జోవర్ విత్తేదానికి సాధారణ వనరుల నిర్వహణ, సరిపోయిన రో స్పేసింగ్, సమయంలో వనరుల తీసుకోవడం వలన వనరుల నిర్వహణలో సహాయపడుతుంది. యంత్రిక నియంత్రణ: హ్యాండ్ వీడింగ్, ఇంటర్-రో మళ్ళీతి, రోటరీ హోయింగ్ జోవర్ విత్తనంలో వనరుల నియంత్రణలో తగినంతగా వినియోగించబడతాయి. రసాయనిక నియంత్రణలు: ప్రీ-ఎమర్జెన్స్ హెర్బిసైడ్లు: జోవర్ విత్తనంలో వనరులను నియంత్రించడానికి అత్రజీన్, మెట్రిబ్యూజిన్, మరియు పెండిమెతాలిన్ ప్రి-ఎమర్జెన్స్ హెర్బిసైడ్లను వాడుతుంది. పోస్ట్-ఎమర్జెన్స్ హెర్బిసైడ్లు: 2,4-డి, మెట్సల్ఫ్యూరాన్-మెథైల్, మరియు గ్లైఫోసేట్ వంటి పోస్ట్-ఎమర్జెన్స్ హెర్బిసైడ్లను నియంత్రించడంలో వాడుతుంది.

# jowar_inter_cultivation_key
source: Weeds: Hand or tool weed near jowar plants. Mulching: Mulch the soil around jowar for use near jowar and also keep the weeds. Inter-row hoes: Hoe in the middle to prevent water and welcome water. Suckers: Remove others to remove the remaining jowar plants. Intercropping: Grow plants that are favorable in jowar rows. Companion planting: Grow plants that are used in jowar rows to improve the environment. Agricultural cycle: Maintain values for daily and every season to keep jowar with various agricultural practices.
hi: खरपतवार: जोवार के पौधों के पास हाथ या उपकरण से खरपतवार। मल्चिंग: जोवार के चारों ओर मिट्टी को मल्च करें जोवार के पास उपयोग के लिए और खरपतवार को भी रखें। इंटर-रो होज: बीच में हो ताकि पानी रोकने और स्वागत करने के लिए पानी। सकर्स: बाकी जोवार पौधों को हटाने के लिए दूसरों को हटा दें। इंटरक्रॉपिंग: जोवार की पंक्तियों में अनुकूल पौधे उगाएं। साथी बोना: जोवार की पंक्तियों में उपयोग किए जाने वाले पौधे उगाएं ताकि पर्यावरण को सुधारें। कृषि चक्र: रोजाना और हर मौसम के लिए मान बनाए रखें ताकि विभिन्न कृषि प्रथाओं के साथ जोवार को बनाए रखें।
te: వనరులు: జోవర్ మొక్కల సమీపంలో వనరులను కైతేయండి లేదా సాధనాలతో. మల్చింగ్: జోవర్ సమీపంలో ఉపయోగించడానికి జోవర్ సుత్తలో భూమిని మల్చించండి మరియు వనరులను కూడా నిలబడించండి. ఇంటర్-రో వాళ్ళు: అంగరాల నడుపున జలనిషేధం మరియు నీటి స్వాగతం మేరకు మధ్యలో భూమిని మలిచి వాయిదాలున్నాయి. పొగాకులు: మిగితాయిన జోవర్ మొక్కలను తీసుకోవడానికి ఇతరాలను తీసుకోవండి. ఇంటర్క్రాపింగ్: జోవర్ వాళ్ళలో అనుకూలంగా ఉండే సస్యాలను రోల్లలో నెలవించండి. కంపెనియన్ ప్లాంటింగ్: పరిస్థితిని మెరుగుపరచేందుకు జోవర్ వాళ్ళలో ఉపయోగపడే సస్యాలను పెరుగుతుంది. వ్యవసాయ చక్రం: ప్రతి రోజుకు మరియు ప్రతి సీజన్‌ని జాగ్రత్తగా ఉంచేందుకు జోవర్ ను వివిధ వ్యవసాయ ప్రణాళికలతో పరిష్కారం చేయండి.

# jowar_harvesting_key
source: (k) September - October (r) March - April
hi: (क) सितम्बर - अक्टूबर (र) मार्च - अप्रैल
te: (కే) సెప్టెంబర్ - అక్టోబర్ (ఆర్) మార్చి - ఏప్రిల్

# jowar_post_harvesting_key
source: Threshing: Harvest the harvested crop and cut the jowar at the stump near the stump with a sickle or mechanical harvester. Threshing: Dry the jowar on dry ground. To reduce the grains, dry the crop completely. Threshing: Separate the harvested jowar plants from the stalks by falling on the mat or mechanical threshers. Winnowing: Use air or fan to separate the grains from the chaff and other impurities. Winnow on a windy day. Cleaning: Use sieves or screens to reduce the grains and separate the grains from other impurities. Storage: Decide to tie the cleaned and dry jowar grains in a gas or plastic tight bag. Report the income from the gas environment and plastics when storing. Packaging: Clean and dry jowar grains in clean labeled sacks or review. Provide date and variety or management labels. Quality control: Take care of the stored jowar grains until they are satisfactory or insect attack.
hi: धान उत्कीर्णन: फसल को काटकर उत्कीर्णन करें और जोवार को गड्ढे के पास गड्ढे के साथ एक दरांती या मैकेनिकल हार्वेस्टर के साथ काटें। धान उत्कीर्णन: जोवार को सूखे भूमि पर सुखाएं। अनाज को कम करने के लिए, फसल को पूरी तरह से सुखाएं। धान उत्कीर्णन: फसल के जोवार पौधों को तनों से अलग करें, चटाई पर गिरकर या मैकेनिकल थ्रेसर्स का उपयोग करके। छाँवनी: हवा या पंखा का उपयोग करके अनाज को भूसे और अन्य अशुद्धियों से अलग करें। हवादार दिन पर छाँवनी करें। सफाई: अनाज को कम करने और अनाज को अन्य अशुद्धियों से अलग करने के लिए छलनी या स्क्रीन का उपयोग करें। भंडारण: निर्णय लें कि स्वच्छ और सुखे जोवार अनाज को गैस या प्लास्टिक की कसी हुई थैली में बांधें। गैस पर्यावरण और प्लास्टिक्स से आय की रिपोर्ट करें जब भंडारण कर रहे हों। पैकेजिंग: स्वच्छ और सुखे जोवार अनाज को स्वच्छ लेबल वाले बोरियों में पैक करें या समीक्षा करें। तारीख और विविधता या प्रबंधन लेबल प्रदान करें। गुणवत्ता नियंत्रण: भंडारित जोवार अनाज का ध्यान रखें जब तक वे संतोषजनक न हों या कीट हमला न हो।
te: అరగంటా: ధారిచేయబడిన సస్యాహారం మరియు తగిననివారంలో జోవర్ ను ధారిచేయండి. సిక్కిల్ లేదా యాంత్రిక హార్వెస్టర్ ద్వారా అట్టు సమీపంలో మొక్కను కత్తిబట్టండి. అరగంటా: డ్రై తూరుపై జోవర్ ధారించండి. గ్రేన్లను తగ్గించడానికి మొక్కను పూర్తిగా డ్రై చేయండి. థ్రెషింగ్: హార్వెస్ట్ చేయబడిన జోవర్ మొక్కలు స్టాల్కుల నుండి విభజించడానికి అలాగే తాటిలో పడిపోయినా మెకానికల్ థ్రెషర్లు వాడవచ్చు. వినోదం: గ్రేన్లను చాఫ్ మరియు ఇతర మోతాన్ని మొక్కలను విభజించడానికి వాయు లేదా వేయి ఉపయోగించండి. వినోదంపై ఒక గాలిబాటి రోజులో చేయండి. శుభ్రీకరణ: గ్రేన్ల మీద మిగిలిన మోతాన్ని మరియు వేరే విద్యుత్తంలను గ్రేన్లను తగ్గించడానికి సీవ్లు లేదా స్క్రీన్‌లను ఉపయోగించండి. నిలుపు: శుభ్రీకరించబడిన మరియు డ్రై జోవర్ గ్రేన్‌లను గాస్ దానిలో లేదా ప్లాస్టిక్ సరిహద్దు కట్టుకోవాలని నిర్ణయించండి. ఆదా చేసుకోవడంలో తొందరగా గాస్ వాతావరణం మరియు ప్లాస్టిక్‌ల నుండి ఆదాయాన్ని నివేదించండి. ప్యాకేజింగ్: శుభ్రీకరణ చేయబడిన మరియు డ్రై జోవర్ గ్రేన్‌లను శుద్ధంగా లేబల్ చేసిన స్యాక్లు లేదా సమీక్షనా చేయండి. తేది మరియు వివిధత లేదా పరిపాలన లాబుల్‌ను అందించండి. గుణము నియంత్రణ: భండారించిన జోవర్ గ్రేన్‌లను దాని నాణ్యత లేదా కీటక ఆక్రమణంను నిలిపించడానికి సరిపోవడం వరకూ సరిపడి తీసుకోండి.

# maize_soil_type_key
source: Loamy soil
hi: मिट्टी प्रकार: लोमी मिट्टी
te: లోమీ మణ్ణు

# maize_seed_rate_key
source: 6 to 8 kilograms per acre
hi: बीज दर: प्रति एकड़ 6 से 8 किलोग्राम
te: 6 నుండి 8 కిలోల పేరుగల

# maize_seed_treatment_key
source: Seed Treatment: - Insecticides: Control insect pests and diseases in seeds. Examples: Metalaxyl, Carbendazim. - Insecticides: Protect seeds from insect pests. Examples: Imidacloprid, Thiamethoxam. - Propagator: Include beneficial microorganisms for soil health. Example: Rhizobacteria. - Biostimulants: Promote seed germination and plant growth. Contains plant hormones and nutrients. - Coating: Improve seed handling and emergence. Contains polymers and nutrients.
hi: बीज का इलाज: - कीटनाशक: बीजों में कीट और रोगों को नियंत्रित करें। उदाहरण: मेटालेक्सिल, कारबेन्डाजिम। - कीटनाशक: बीजों को कीटों से सुरक्षित रखें। उदाहरण: इमिडाक्लोप्रिड, थायमेथोक्साम। - प्रसारक: मिट्टी स्वास्थ्य के लिए लाभकारी सूक्ष्मजीवों को शामिल करें। उदाहरण: राइजोबैक्टीरिया। - बायोस्टिमुलेंट्स: बीज के अंकुरण और पौधे की वृद्धि को प्रोत्साहित करें। पौधों के हार्मोन और पोषक तत्व समाविष्ट करता है। - कोटिंग: बीज का हैंडलिंग और उद्भवन में सुधार। पॉलिमर्स और पोषक तत्व समाविष्ट करता है।
te: బీజం చిటికెడుతుల మరియు రోగాలను తగ్గించే ప్రయోగములు: - కీటక నియంత్రణకు: మెటాలాక్సిల్, కార్బెండజిమ్ ఉదాహరణలు. - కీటక నివారణకు: సన్నివేశాలను నుండి బీజాలను రక్షించండి. ఉదాహరణలు: ఇమిడాక్లోప్రిడ్, థియామెతొక్సామ్. - ప్రోపగేటర్: భూమి ఆరోగ్యానికి ఉపయోగపడే ప్రయోజనకర మైక్రోరొగనిజమ్‌లను సేర్చేయండి. ఉదాహరణ: రైజోబాక్టీరియా. - బైయోస్టిములెంట్స్: బీజం బెరకులు మరియు మొక్కల వృద్ధిని ప్రోత్సహించేలా బైయోస్టిములెంట్స్ అనువర్తనం. మొక్కల హార్మోన్‌లు మరియు పరిపాక లవణాలను కలిపి ఉంటాయి. - ఆవరణము: బీజం హాండ్లింగ్ మరియు ప్రకటనను మెరుగుపరచేలా ఆవరణాలు. పాలిమర్లు మరియు పరిపాక లవణాలను కలిగి ఉంటాయి.

# maize_growing_season_key
source: October - November
hi: बढ़ती की सीज़न: अक्टूबर - नवंबर
te: పెద్ద సీజన్: అక్టోబర్ - నవంబర్

# maize_crop_duration_key
source: 100-120 days
hi: फसल की अवधि: 100-120 दिन
te: దాని కాలం: 100-120 రోజులు
